<div id="documentation">
	<h2><a href="documentation.php?doc_id=whats_new">История версий KVS</a></h2>
	<p>
		Здесь вы можете узнать об изменениях в софте от версии к версии. Если вы уже работали с KVS более старых
		версий, вам следует ознакомиться с новыми возможностями софта.
	</p>
	<h2><a href="documentation.php?doc_id=quick_start">Основные аспекты работы с KVS</a></h2>
	<p>
		Документ описывает основы работы с KVS с точки зрения всех базовых понятий. Мы постарались
		написать это руководство простыми словами, чтобы можно было быстро познакомиться с основными возможностями
		софта. Обязательно следует прочитать перед началом работы с софтом.
	</p>
	<h2><a href="documentation.php?doc_id=settings">Настройки</a></h2>
	<p>
		Детальное описание раздела настроек KVS.
	</p>
	<h2><a href="documentation.php?doc_id=website_ui">Управление сайтом</a></h2>
	<p>
		Детальное описание функционала KVS для настройки сайта и работы с ним. Рекомендуется
		прочитать, прежде чем работать с настройкой сайта.
	</p>
</div>