<div id="documentation">
	<h1 id="section_whats_new">История версий KVS</h1>
	<h2 id="section_whats_new_contents">Содержание</h2>
	<div class="contents">
		<a href="#section_whats_new_5_2" class="l2">KVS v5.2</a><br/>
		<a href="#section_whats_new_5_2_0" class="l3">KVS v5.2.0 [25.06.2020]</a><br/>
		<a href="#section_whats_new_5_1" class="l2">KVS v5.1</a><br/>
		<a href="#section_whats_new_5_1_1" class="l3">KVS v5.1.1 [15.10.2019]</a><br/>
		<a href="#section_whats_new_5_1_0" class="l3">KVS v5.1.0 [29.07.2019]</a><br/>
		<a href="#section_whats_new_5_0" class="l2">KVS v5.0</a><br/>
		<a href="#section_whats_new_5_0_1" class="l3">KVS v5.0.1 [17.04.2019]</a><br/>
		<a href="#section_whats_new_5_0_0" class="l3">KVS v5.0.0 [24.03.2019]</a><br/>
		<a href="#section_whats_new_4_0" class="l2">KVS v4.0</a><br/>
		<a href="#section_whats_new_4_0_4" class="l3">KVS v4.0.4 [12.10.2018]</a><br/>
		<a href="#section_whats_new_4_0_3" class="l3">KVS v4.0.3 [04.09.2018]</a><br/>
		<a href="#section_whats_new_4_0_2" class="l3">KVS v4.0.2 [17.05.2018]</a><br/>
		<a href="#section_whats_new_4_0_1" class="l3">KVS v4.0.1 [16.02.2018]</a><br/>
		<a href="#section_whats_new_4_0_0" class="l3">KVS v4.0.0 [15.01.2018]</a><br/>
		<a href="#section_whats_new_3_9" class="l2">KVS v3.9</a><br/>
		<a href="#section_whats_new_3_9_1" class="l3">KVS v3.9.1 [08.05.2017]</a><br/>
		<a href="#section_whats_new_3_9_0" class="l3">KVS v3.9.0 [24.11.2016]</a><br/>
		<a href="#section_whats_new_3_8" class="l2">KVS v3.8</a><br/>
		<a href="#section_whats_new_3_8_5" class="l3">KVS v3.8.5 [04.08.2016]</a><br/>
		<a href="#section_whats_new_3_8_4" class="l3">KVS v3.8.4 [15.05.2016]</a><br/>
		<a href="#section_whats_new_3_8_3" class="l3">KVS v3.8.3 [13.01.2016]</a><br/>
		<a href="#section_whats_new_3_8_2" class="l3">KVS v3.8.2 [22.12.2015]</a><br/>
		<a href="#section_whats_new_3_8_1" class="l3">KVS v3.8.1 [10.08.2015]</a><br/>
		<a href="#section_whats_new_3_8_0" class="l3">KVS v3.8.0 [01.05.2015]</a><br/>
		<a href="#section_whats_new_3_7" class="l2">KVS v3.7</a><br/>
		<a href="#section_whats_new_3_7_0" class="l3">KVS v3.7.0 [21.01.2015]</a><br/>
		<a href="#section_whats_new_3_6" class="l2">KVS v3.6</a><br/>
		<a href="#section_whats_new_3_6_0" class="l3">KVS v3.6.0 [22.09.2014]</a><br/>
		<a href="#section_whats_new_3_5" class="l2">KVS v3.5</a><br/>
		<a href="#section_whats_new_3_5_2" class="l3">KVS v3.5.2 [29.08.2014]</a><br/>
		<a href="#section_whats_new_3_5_1" class="l3">KVS v3.5.1 [21.07.2014]</a><br/>
		<a href="#section_whats_new_3_5_0" class="l3">KVS v3.5.0 [14.06.2014]</a><br/>
		<a href="#section_whats_new_3_4" class="l2">KVS v3.4</a><br/>
		<a href="#section_whats_new_3_4_2" class="l3">KVS v3.4.2 [14.03.2014]</a><br/>
		<a href="#section_whats_new_3_4_1" class="l3">KVS v3.4.1 [29.01.2014]</a><br/>
		<a href="#section_whats_new_3_4_0" class="l3">KVS v3.4.0 [23.12.2013]</a><br/>
		<a href="#section_whats_new_3_3" class="l2">KVS v3.3</a><br/>
		<a href="#section_whats_new_3_3_3" class="l3">KVS v3.3.3 [19.09.2013]</a><br/>
		<a href="#section_whats_new_3_3_2" class="l3">KVS v3.3.2 [01.09.2013]</a><br/>
		<a href="#section_whats_new_3_3_1" class="l3">KVS v3.3.1 [31.07.2013]</a><br/>
		<a href="#section_whats_new_3_3_0" class="l3">KVS v3.3.0 [03.07.2013]</a><br/>
		<a href="#section_whats_new_3_2" class="l2">KVS v3.2</a><br/>
		<a href="#section_whats_new_3_2_0" class="l3">KVS v3.2.0 [30.04.2013]</a><br/>
		<a href="#section_whats_new_3_1" class="l2">KVS v3.1</a><br/>
		<a href="#section_whats_new_3_1_1" class="l3">KVS v3.1.1 [18.03.2013]</a><br/>
		<a href="#section_whats_new_3_1_0" class="l3">KVS v3.1.0 [05.03.2013]</a><br/>
		<a href="#section_whats_new_3_0" class="l2">KVS v3.0</a><br/>
		<a href="#section_whats_new_3_0_3" class="l3">KVS v3.0.3 [10.02.2013]</a><br/>
		<a href="#section_whats_new_3_0_2" class="l3">KVS v3.0.2 [06.02.2013]</a><br/>
		<a href="#section_whats_new_3_0_1" class="l3">KVS v3.0.1 [15.01.2013]</a><br/>
		<a href="#section_whats_new_3_0_0" class="l3">KVS v3.0.0 [17.12.2012]</a><br/>
		<a href="#section_whats_new_2_4" class="l2">KVS v2.4</a><br/>
		<a href="#section_whats_new_2_4_4" class="l3">KVS v2.4.4 [03.06.2012]</a><br/>
		<a href="#section_whats_new_2_4_3" class="l3">KVS v2.4.3 [25.03.2012]</a><br/>
		<a href="#section_whats_new_2_4_2" class="l3">KVS v2.4.2 [06.03.2012]</a><br/>
		<a href="#section_whats_new_2_4_1" class="l3">KVS v2.4.1 [12.02.2012]</a><br/>
		<a href="#section_whats_new_2_4_0" class="l3">KVS v2.4.0 [10.12.2011]</a><br/>
		<a href="#section_whats_new_2_3" class="l2">KVS v2.3</a><br/>
		<a href="#section_whats_new_2_3_2" class="l3">KVS v2.3.2 [25.09.2011]</a><br/>
		<a href="#section_whats_new_2_3_1" class="l3">KVS v2.3.1 [12.08.2011]</a><br/>
		<a href="#section_whats_new_2_3_0" class="l3">KVS v2.3.0 [27.06.2011]</a><br/>
		<a href="#section_whats_new_2_2" class="l2">KVS v2.2</a><br/>
		<a href="#section_whats_new_2_2_2" class="l3">KVS v2.2.2 [10.05.2011]</a><br/>
		<a href="#section_whats_new_2_2_1" class="l3">KVS v2.2.1 [22.04.2011]</a><br/>
		<a href="#section_whats_new_2_2_0" class="l3">KVS v2.2.0 [24.03.2011]</a><br/>
		<a href="#section_whats_new_2_1" class="l2">KVS v2.1</a><br/>
		<a href="#section_whats_new_2_1_1" class="l3">KVS v2.1.1 [05.02.2011]</a><br/>
		<a href="#section_whats_new_2_1_0" class="l3">KVS v2.1.0 [17.01.2011]</a><br/>
		<a href="#section_whats_new_2_0" class="l2">KVS v2.0</a><br/>
		<a href="#section_whats_new_2_0_6" class="l3">KVS v2.0.6 [30.12.2010]</a><br/>
		<a href="#section_whats_new_2_0_5" class="l3">KVS v2.0.5 [07.12.2010]</a><br/>
		<a href="#section_whats_new_2_0_4" class="l3">KVS v2.0.4 [15.11.2010]</a><br/>
		<a href="#section_whats_new_2_0_3" class="l3">KVS v2.0.3 [31.10.2010]</a><br/>
		<a href="#section_whats_new_2_0_2" class="l3">KVS v2.0.2 [11.10.2010]</a><br/>
		<a href="#section_whats_new_2_0_1" class="l3">KVS v2.0.1 [26.09.2010]</a><br/>
		<a href="#section_whats_new_2_0_0" class="l3">KVS v2.0.0 [17.09.2010]</a><br/>
		<a href="#section_whats_new_1_5" class="l2">KVS v1.5</a><br/>
		<a href="#section_whats_new_1_5_0" class="l3">KVS v1.5.0 [13.01.2010]</a><br/>
		<a href="#section_whats_new_1_4" class="l2">KVS v1.4</a><br/>
		<a href="#section_whats_new_1_4_2" class="l3">KVS v1.4.2 [02.09.2009]</a><br/>
		<a href="#section_whats_new_1_4_1" class="l3">KVS v1.4.1 [18.07.2009]</a><br/>
		<a href="#section_whats_new_1_4_0" class="l3">KVS v1.4.0 [01.07.2009]</a><br/>
		<a href="#section_whats_new_1_3" class="l2">KVS v1.3</a><br/>
		<a href="#section_whats_new_1_3_0" class="l3">KVS v1.3.0 [24.04.2009]</a><br/>
		<a href="#section_whats_new_1_0" class="l2">KVS v1.0</a><br/>
		<a href="#section_whats_new_1_0_0" class="l3">KVS v1.0.0 [01.02.2009]</a><br/>
	</div>
	<h2 id="section_whats_new_5_2">KVS v5.2</h2>
	<h3 id="section_whats_new_5_2_0">KVS v5.2.0 [25.06.2020]</h3>
	<ul>
		<li>
			Пакет улучшений и оптимизаций движка конвертации:<br/>
			- При использовании локальных серверов конвертации движок больше не будет копировать и дублировать исходные
			  файлы, что в целом призвано снизить нагрузку на файловую систему во время обработки видео.<br/>
			- Улучшено логгирование процессов конвертации: логи видео станут значительно короче и не будут содержать
			  вырезки из логов ffmpeg, если во время конвертации все идет по плану.<br/>
			- Фоновые задачи, которые выполнялись на главном сервере по большому объему данных, переписаны через
			  итеративный подход. Это значит что данные типы задач (например, создание нового формата скриншотов)
			  больше не будут блокировать движок конвертации на длительное время, как это происходило ранее в случае
			  больших баз видео.<br/>
			- Пост-процессинг MP4 видеофайлов упрощен по использованию ресурсов: KVS теперь будет проверять
			  необходимость пост-процессинга и не делать его без необходимости. Это сэкономит ресурсы файловой системы
			  на сервере конвертации, что особенно важно, когда он локальный.<br/>
			- Форматы видео теперь поддерживают 2 разных ватермарка параллельно. Это можно использовать для показа
			  своего логотипа поверх видео и параллельно показа бегущей строки с копирайтом в разных эпизодах видео.
			  Кроме того, для ватермарков теперь можно указывать максимальный процент от ширины видео отдельно для
			  вертикальных и горизонтальных видео, что позволит идеально подогнать ватермарк для всех случаев.<br/>
			- Добавлена архивация логов видео, альбомов и фоновых задач, чтобы снизить размер занимаемого пространства
			  и кол-во файлов на файловой системе.<br/>
			- В форматах видео в опциях ffmpeg теперь поддерживается возможность указания кастомного набора фильтров
			  видео в опции -vf.<br/>
		</li>
		<li>
			Улучшения по скриншотам видео:<br/>
			- Изменена концепция применения кропа к скриншотам. Ранее кроп применялся при создании форматов скриншотов,
			  а исходные файлы скриншотов оставались нетронутыми. Сейчас мы решили переделать эту схему, и по всем
			  новым видео KVS будет применять кроп уже к исходным файлам скриншотов. При этом исходные файлы по старым
			  видео останутся нетронутыми.<br/>
			- В настройках кропа теперь можно включить галочку автоматического удаления черных полос со скриншотов.
			  Данная опция будет включена по умолчанию после обновления.<br/>
			- Изменился подход к файлам скриншотов, загружаемых вручную. Если раньше загружаемые вручную скриншоты
			  никогда не кропились и на них не накладывался ватермарк, то сейчас в настройках контента появились опции,
			  которые позволяют включить и кроп, и ватермарк для загружаемых вручную скриншотов.<br/>
			- Благодаря этим улучшениям исправилась также проблема, при которой на загруженные вручную скриншоты при
			  создании новых форматов скриншотов шло наложение и кропа, и ватермарка, и полных опций обработки
			  ImageMagick, что могло приводить к ухучшению их качества в новых форматах. Теперь для новых видео данная
			  проблема перестанет быть актуальной.<br/>
			- Добавлена новая группа скриншотов - постеры, которые поддерживают свой отдельный набор форматов.
			  Скриншоты этой группы можно только загрузить вручную.<br/>
			- Скриншоты для вертикальных видео стали лучше! Во-первых, в форматах скриншотов теперь можно выбирать
			  разные настройки ресайза для вертикальных и горизонтальных видео. Во-вторых, в случаях когда аспект ратио
			  видео отличается от аспект ратио скриншота (например, у вертикальных видео), вместо черных полос по краям
			  теперь будет отображаться размытое изображение скриншота.<br/>
			- Улучшена юзабилити работы со скриншотами в панели администрирования.<br/>
			- Ручной граббинг скриншотов в панели администрирования теперь будет учитывать ограничения по LA и
			  интервалу времени в настройках контента и не позволять запускать граббинг при попадании в эти
			  ограничения.<br/>
			- В массовом редактировании появилась возможность удалить обзорные скриншоты у выбранных видео, а также
			  пересоздать любые форматы скриншотов исключительно для выбранного набора видео.<br/>
		</li>
		<li>
			Улучшения по фидам экспорта:<br/>
			- Появилась возможность экспортировать неактивные видео.<br/>
			- Добавлена поддержка статических фильтров по всей категоризации и флагу администратора.<br/>
			- Теперь в фидах экспорта можно использовать несколько параметров для трекинга трафика (ранее можно было
			  только 1). Данные параметры будут автоматически добавляться ко всем ссылкам и embed кодам, которые выдает
			  фид.<br/>
			- Добавлена поддержка сателлитов и возможность через фиды экспорта сформировать ссылки через любой
			  сателлит.<br/>
			- Фиды экспорта теперь вместо документации в текстовом формате выводят удобную форму, которая позволяет
			  легко настроить все опции фида и получить данные в нужном формате.<br/>
			- Изменена логика работы фильтров по формату видео, которые можно было передавать на фид экспорта. Раньше
			  фильтры по форматам работали таким образом, что в случае отсутствия у видео указанного формата, вместо
			  ссылки на видеофайл этого формата выдавалась ссылка на любой другой видеофайл. Мы решили переделать этот
			  аспект, чтобы фильтрация по форматам видео выдавала ссылки только в тех случаях, когда у видео есть
			  видеофайл данного формата. По этой причине мы также изменили названия параметров - вместо
			  <b>video_format_standard</b> и <b>video_format_premium</b> это теперь <b>video_format_1</b> и
			  <b>video_format_2</b>. Данное изменение приведет к потере работоспособности старых ссылок на фиды
			  экспорта, если они используют старые названия параметров. Чтобы они снова заработали, будет необходимо
			  открыть ссылку фида в браузере и в появившейся форме выбрать заново фильтры по форматам, чтобы получить
			  новый формат ссылки. Также вы должны понимать, что некоторые видео в фиде после этого могут приводить к
			  ошибкам импорта, т.к. у них может не быть заполнено поле видеофайла - для тех видео, у которых
			  отсутствует файл данного формата.<br/>
		</li>
		<li>
			Улучшения по фидам импорта:<br/>
			- Фиды импорта в формате KVS теперь стали гораздо удобнее. Во-первых, для них можно галочками выбрать какие
			  данные они должны импортировать, а какие нет. Во-вторых, теперь они позволяют импортировать сразу
			  несколько форматов видео (например, основной видеофайл и превью).<br/>
			- Улучшено логгирование фидов, а также появилась возможность указать длительность хранения логов, чтобы
			  старые логи подчищались самостоятельно.<br/>
			- Фиды импорта стали поддерживать автоматическое удаление видео. Для фидов CSV формата вы должны будете
			  указать URL фида удаленных видео, который выдает ссылки на страницы удаленных видео. При этом в качестве
			  ключевого поля в настройках данных фида у вас должен быть выбран URL страницы видео, чтобы KVS мог их
			  сопоставить. Для фидов KVS формата все намного проще - для них не накладывается никаких дополнительных
			  условий.<br/>
			- В настройках фидов импорта появилась возможность указать статические фильтры не только по длительности,
			  но и по рейтингу, популярности и терминологии. Это позволит ограничивать поток импорта, даже если фид,
			  откуда берутся данные, не поддерживает такую фильтрацию.<br/>
			- Мы также добавили поддержку плагина грабберов в фидах импорта. Это позволит вам либо настраиваться на RSS
			  каналы с нужными данными для дальнейшего граббинга видео в этих каналах через плагин грабберов, либо
			  самостоятельно формировать списки страниц с видео, которые вы хотите сграббить и скармливать их фиду
			  импорта.<br/>
		</li>
		<li>
			Улучшения плеера KVS и VAST:<br/>
			- Плеер стал поддерживать несколько VAST рекламодателей в одном XML файле. Это может использоваться
			  некоторыми рекламными брокерами для указания альтернативных рекламодателей с целью повышения конверсии.<br/>
			- При отображении VPAID рекламы наш плеер теперь будет создавать несколько иную структуру HTML для поддержки
			  более широкого круга рекламодателей, которые чувствительны к структуре верстки рекламного блока.<br/>
			- Таймаут VAST, который задается в настройках плеера KVS теперь будет действовать не ко всей рекламе в
			  целом, а по каждому рекламодателю отдельно. Это поможет в случае медленной работы одного из
			  рекламодателей, что позволит дать шанс другим (альтернативным) рекламодателям показать рекламу.<br/>
			- В настройках плеера теперь можно указывать любое кол-во альтернативных VAST рекламодателей, которые будут
			  использоваться по очереди до тех пор, пока какой-либо из них не покажет рекламу.<br/>
			- Улучшено логгирование ошибок рекламы в плеере.<br/>
			- Значительные изменения произошли в VAST профилях. Для каждого рекламодателя в VAST профиле теперь также
			  можно указать список его альтернативных рекламодателей. Кардинально изменилась логика работы фильтра по
			  странам. Раньше при использовании странового фильтра, как правило, было необходимо задать еще одного
			  рекламодателя без указания стран, чтобы он использовался как бы по умолчанию для всех остальных стран.
			  Данная схема настроек оказалась не совсем удачной, и мы изменили поведение страновых фильтров. Теперь в
			  настройках каждого рекламодателя в профиле VAST можно задать для каких стран он должен включаться, либо
			  для каких стран он должен исключаться. При этом, рекламодатель с пустым набором стран будет включаться
			  абсолютно для всех стран.<br/>
			- В дополнение к фильтру по странам мы добавили фильтр по реферерам, чтобы позволить еще более глубокий
			  контроль над монетизацией VAST рекламы. Очень часто сайты, которые продают трафик, имеют ограничения по
			  тому, какая рекламы и какой длительности может быть показана для их трафика. Такая реклама, как правило,
			  имеет более низкие рейты, что не позволяет вам использовать полноценную монетизацию при покупке трафика,
			  даже если вы покупаете только небольшую его часть. Теперь эта проблема может быть решена при помощи
			  фильтрации по реферерам - она позволит вам использовать разные стратегии монетизации для трафика из
			  разных источников.<br/>
			- Изменение настроек плеера теперь будет автоматически сбрасывать кэш блоков просмотра видео. Тем самым,
			  новые настройки будут вступать в действие сразу же. Ранее изменение настроек плеера не приводило к
			  обнулению кэша и вступало в силу постепенно для разных видео (как правило в пределах часа, но не
			  сразу).<br/>
			- Ключ для VAST подписки теперь не требуется прописывать в настройках плеера, он будет автоматически
			  подтягиваться из репозитория KVS. Кроме удобства это также добавит поддержку зеркал, что ранее было
			  возможно только через шаблон.<br/>
		</li>
		<li>
			Улучшения статистики:<br/>
			- В статистике трафика и плеера теперь будет доступна сегментация по типу устройств: десктопы, телефоны,
			  планшеты. Для ее включения необходимо воспользоваться опцией в настройках статистики.<br/>
			- В статистике по плееру также можно получить сегментацию статистики по профилям embed кодов. Это может
			  пригодиться в случае раздачи embed кодов на свои сторонние сайты и необходимости анализа по каждому из
			  сайтов.<br/>
			- Общая статистика по трафику теперь также будет включать статистику по проигрываниям видео в плеере для
			  лучшей детализации качества трафика.<br/>
			- Поисковые запросы, которые добавляются из панели администрирования больше не будут автоматически
			  очищаться вместе с остальной статистикой поиска. Также в настройках статистики поиска появилась
			  возможность форсировать приведение поисковых запросов к нижнему регистру.<br/>
		</li>
		<li>
			Добавлен модуль антиспама. Он анализирует кол-во отправленных данных одного типа с одинакового IP / логина
			или от всех пользователей. Если это кол-во превосходит указанный лимит (например, с одного IP будет сделано
			более 10 комментариев за 300 секунд, или всего будет сделано более 10 комментариев за 300 секунд), все
			будущие данные этого же типа (например, комментарии) от этого же IP или от всех пользователей будут
			обрабатываться по заданным правилам. Правила позволяют настроить несколько различных уровней строгости
			действий: включить каптчу, добавить но деактивировать, удалить без оповещения или показать ошибку.
		</li>
		<li>
			Загрузка файлов с диска переведена на загрузку по фрагментам, что позволяет обойти практически любое
			ограничение на размер загружаемых файлов. Это особенно актуально для проектов, работающих под Cloudflare.
			Ранее для них можно было переводить загрузку файлов на сабдомен, теперь же данная проблема должна решиться
			сама собой без использования сабдомена. Обновление автоматически переключит загрузку в панели
			администрирования, в то время как для переключения сайта потребуется обновлять JS файл темы (информация об
			этом будет представлена на форуме).
		</li>
		<li>
			KVS переведен на модуль PHP Memcached. Так сложилось, что в PHP5 было несколько похожих модулей для работы с
			библиотекой Memcached. После перехода на PHP7, модуль, который ранее использовался в KVS, был удален из
			официального репозитория. Теперь KVS поддерживает "правильный" модуль для работы с Memcached.
		</li>
		<li>
			В массовом редактировании альбомов появилась возможность пересоздать любые форматы альбомов только для
			указанного набора альбомов. Ранее пересоздание форматов альбомов можно было запустить только для всей базы
			альбомов.
		</li>
		<li>
			В рекламе в фильтрам по браузерам добавилась поддержка Yandex и UCBrowser.
		</li>
		<li>
			Несколько улучшилась концепция разделения контента между работниками. Ранее можно было ограничить
			работников на доступ только к тому контенту, для которого они назначены администраторами. Возможность
			назначать администраторов контенту была доступна только для суперадминов; в новой версии мы сделали такую
			возможность доступной для любых администраторов с привилегией на администрирование. Кроме этого мы ввели
			возможность разграничения доступа через флаги администратора, что, возможно, будет более удобной
			альтернативой. Также появилась возможность деактивировать администраторов, а не удалять их.
		</li>
		<li>
			В опциях ручного импорта появилась возможность выключить проверку галерей грабберами. На самом деле данная
			проверка скорее вещь ненужная, чем нужная, поскольку она, во-первых, дублирует все запросы на сайт-источник
			и может повлиять на блокировку IP, а во-вторых, она может занимать значительное время.
		</li>
		<li>
			Улучшился интерфейс плагина статистики контента. Плагин теперь показывает историю недавних запусков, а в
			самих результатах при выводе дискового пространства, занятого на серверах хранения, позволяет получить
			разбиение по группам хранения.
		</li>
		<li>
			Плагин генерации аватаров из категорий теперь будет использовать лучшую тумбу по CTR, если включена ротация
			скриншотов. Ранее плагин всегда брал главную тумбу, без учета их CTR.
		</li>
		<li>
			Добавлен плагин для интеграции с AWE Black Label. Для подключения просьба связаться с нашей службой
			поддержки.
		</li>
		<li>
			Улучшено тестирование серверов хранения. Теперь KVS будет проверять проблемы с SSL настройками удаленных
			серверов хранения и сообщать о них автоматически.
		</li>
		<li>
			Панель администрирования теперь будет подсвечивать неактивные объекты категоризации в интерфейсе их
			селекторов. Также будет доступна возможность отфильтровать неактивные объекты категоризации.
		</li>
		<li>
			Теперь при удалении пользователей будут также удаляться и их комментарии. За это отвечает отдельная опция
			удаления с контентом. Ранее комментарии пользователей не удалялись, а переводились на анонимного
			пользователя, что могло приводить к невозможности массово удалить спам.
		</li>
		<li>
			Добавлена поддержка каптчи в блоках <b>post_edit</b>, <b>playlist_edit</b> и <b>dvd_edit</b>.
		</li>
		<li>
			Функционал блока <b>invite_friend</b> был полностью удален как устаревший. Мы рекомендуем убрать ссылку на
			этот блок в футере сайта, в любом случае он не будет больше работать.
		</li>
		<li>
			В блоке <b>logon</b> реализована поддержка функционала SSO (Single Sign-On). Этот функционал будет полезен
			при интеграции KVS с другими вашими проектами (форумом или другой мемберзоной). Суть в том, чтобы вам не
			нужно было каким-либо образом интегрировать ваших пользователей в KVS, а достаточно было бы сформировать
			зашифрованную ссылку, подписанную секретным ключом, и предоставить ее пользователю. Кликая по данной
			ссылке, пользователь автоматически получит профиль в базе KVS и сразу же станет залогиненным без
			необходимости ввода пароля. Это очень удобная, безопасная и простая для реализации концепция.
		</li>
		<li>
			Улучшилась логика параметра <b>randomize_positions</b> в блоке <b>list_videos</b>. Этот параметр
			используется для инъекции случайных видео внутрь списка, отсортированного по CTR, чтобы добавлять примесь в
			ротатор и позволять новым видео отротироваться. Теперь инъекция больше не будет случайной - добавлен
			параметр <b>randomize_positions_sort_by</b>, в котором можно выбрать по какой сортировке выбирать примесь.
			Кроме этого, раньше инъекции заменяли топовые видео и могли приводить к падению кликабельности всего блока,
			а сейчас они будут сдвигать топовые видео на следующие позиции, тем самым наиболее кликабельные видео
			всегда будут отображаться в списке.
		</li>
		<li>
			В блоке <b>list_models</b> появилась возможность динамической фильтрации по доп. полям.
		</li>
		<li>
			В блоке <b>list_members</b> появилась возможность статической фильтрации по статусу пользователя.
		</li>
		<li>
			Пустые результаты поиска при включенном параметре <b>search_empty_404</b> будут просто выдавать 404 статус
			без использования системной 404 страницы. Это приведет к тому, что поиск данных, которых нет в вашей базе,
			выдаст страницу с пустыми результатами поиска и 404 статусом.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- <b>[СЕРЬЕЗНО]</b> В ручном экспорте видео и альбомов нельзя было выбрать более 5 полей (появился после
			  5.1.0).<br/>
			- <b>[СЕРЬЕЗНО]</b> У сателлитов не отображался список администраторов в панели администрирования (появился
			  после 5.1.1).<br/>
			- <b>[СРЕДНЕ]</b> Поисковая статистика не учитывала регистр поисковых запросов и могла приводить к
			  дубликатам запросов с разным регистром (появился после 5.1.1).<br/>
			- <b>[СРЕДНЕ]</b> Загрузка видеофайла по ссылке через сайт могла приводить к ошибке для медленно
			  скачиваемых файлов.<br/>
			- <b>[СРЕДНЕ]</b> В блоке <b>list_models</b> неправильно работал параметр <b>show_model_groups</b>.<br/>
			- <b>[СРЕДНЕ]</b> KVS иногда мог сам удалять /tmp директорию.<br/>
			- <b>[СРЕДНЕ]</b> NATS User Management постбэк мог не учитывать некоторые случаи конверсий.<br/>
			- <b>[МЕЛОЧЬ]</b> В случае большого ручного импорта данных проверка импорта могла занимать неприлично
			  длительное время.<br/>
			- <b>[МЕЛОЧЬ]</b> В некоторых случаях в статистику по трафику могли попадать даты из будущего.<br/>
			- <b>[МЕЛОЧЬ]</b> Стоп-слова имели приоритет над регулярными выражениями автозамены, хотя по логике должно
			  быть наоборот.<br/>
			- <b>[МЕЛОЧЬ]</b> При деактивации сервера конвертации задачи, которые уже начали выполняться на этом
			  сервере, выдавали ошибку вместо успешного завершения.<br/>
		</li>
	</ul>
	<h2 id="section_whats_new_5_1">KVS v5.1</h2>
	<h3 id="section_whats_new_5_1_1">KVS v5.1.1 [15.10.2019]</h3>
	<ul>
		<li>
			Очередной пакет улучшений плеера:<br/>
			- Переработана архитектура VPAID рекламы, теперь слот с видео подключается внутри ифрейма с VPAID модулем
			  для лучшей совместимости с рекламодателями.<br/>
			- В настройках плеера добавлена возможность настраивать таймаут для VPAID рекламы, таймаут по умолчанию
			  увеличен до 10 секунд (к сожалению, многим рекламодателям требуется очень много времени для инициализации
			  рекламы, что может также негативно сказываться на поведении пользователей сайта).<br/>
			- В настройках плеера добавлена возможность включения логгирования ошибок плеера.<br/>
			- Изменено поведение плеера при перемотке стрелками - теперь перемотка работает гораздо удобнее.<br/>
			- В настройках VAST профилей убран лимит на длину URL, теперь можно даже очень длинные URL-ы задавать.
		</li>
		<li>
			В плагине Push сообщений добавлена возможность показывать пуши только для трафика от определенных рефереров
			(раньше была возможность наоборот не показывать для трафика от определенных рефереров).
		</li>
		<li>
			В локализации контента добавлена проверка переводов на дубликаты.
		</li>
		<li>
			Стоп слова теперь можно разделять не только запятыми, но и с новой строки.
		</li>
		<li>
			При создании языков локализации новые столбцы в таблицах базы данных теперь создаются более оптимальным
			образом. Ранее создание новых языков на крупных проектах могло приводить к долгому зависанию базы данных.
		</li>
		<li>
			В плагине грабберов добавлена поддержка фильтрации добавляемого контента по качеству. Так, например, теперь
			можно импортировать только видео c 720p форматом или выше.
		</li>
		<li>
			В плагине интеграции с Google ReCAPTCHA появилась возможность задавать отдельные наборы ключей при
			использовании доменных зеркал.
		</li>
		<li>
			В импорте контента появилась опция более быстрого копирования исходных файлов путем использования операции
			переименования, если они уже находятся на вашем сервере.
		</li>
		<li>
			Интеграция с NATS разделилась на 2 части - одна (старая) работает через транзакционные постбэки (approval,
			rebill, refund, chargeback и т.д.), а новая разновидность рассчитана на User Management Postback. Разница
			между ними - разный подход к работе с пользователями. Новый постбэк, например, также поддерживает ручное
			добавление пользователей в NATS или изменения их паролей, однако в отличие от старого не собирает
			информацию по рефандам или чарчбэкам. Кроме этого, KVS теперь может использовать API NATS для отправки
			уведомлений об изменении пароля или email-а пользователя, происходящих в KVS.
		</li>
		<li>
			В настройках работы с тэгами теперь появилась новая опция, включение которой при переименовании любых тэгов
			в панели администрирования будет добавлять старое значение тэга в синонимы к его новому значению, что
			позволит избежать повторного появления старого (переименованного тэга). Данная опция включится по умолчанию.
		</li>
		<li>
			Оптимизирована страница плагинов в панели администрирования, скорость ее работы значительно повышена.
		</li>
		<li>
			В настройках контента появилась возможность ограничить скорость скачивания файлов системой, чтобы снижать
			нагрузку на сервер во время импорта или массовой загрузки контента пользователями через URL-ы.
		</li>
		<li>
			В грабберах появилась поддержка функции постобработки, которую можно использовать при написании кастомных
			грабберов. Например, с ее помощью для сграбленных видео можно дополнительно импортировать и комментарии.
		</li>
		<li>
			В синонимах категорий теперь можно использовать частичное совпадение при помощи символа *. Это нужно, когда
			вы хотите чтобы при импорте вместо множественных категорий с похожими названиями у вас использовалась одна
			специфическая категория - в таком случае вместо перечисления всех возможных комбинаций вы можете просто
			задать маску. Стоит отметить, что * в данном случае значит любое кол-во символов до конца границы слова.
		</li>
		<li>
			При включении реферральской награды за регистрацию теперь можно также указать интервал уникальности IP, в
			течение которого любые другие регистрации с такого же IP не приведут к получению награды.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- <b>[СРЕДНЕ]</b> Обработчик CCBill завершал обработку постбэка с ошибкой, если постбэк приходил по
			  несуществующему пакету доступа (появилась после 5.0.0).<br/>
			- <b>[СРЕДНЕ]</b> При некоторых кодах отказа обработчик CCBill мог создавать пользователя в базе KVS.<br/>
			- <b>[МЕЛОЧЬ]</b> Если выполнение задачи на сервере конвертации занимало более 2 минут, KVS мог показывать
			  ложную ошибку по серверу конвертации с сообщением что сервер висит более 2 часов (появилась после
			  5.1.0).<br/>
			- <b>[МЕЛОЧЬ]</b> В списке моделей в панели администрирования не отображался возраст (появилась после
			  5.0.0).<br/>
			- <b>[МЕЛОЧЬ]</b> В редких случаях FFmpeg производил настолько большой файл лога, что движку конвертации
			  KVS не хватало памяти открыть его и выполнение задач останавливалось.<br/>
			- <b>[МЕЛОЧЬ]</b> Попытка создания WebP формата скриншотов не приводила к ошибке, если версия ImageMagick
			  не поддерживала этот кодек.<br/>
			- <b>[МЕЛОЧЬ]</b> В статистике по датам сравнение со средним теперь не будет показываться для сегодняшней
			  даты, т.к. не имеет смысла.<br/>
			- <b>[МЕЛОЧЬ]</b> При загрузке видео или альбомов анонимными пользователями была возможность установки
			  личного типа, который не должен использоваться при анонимной загрузке.<br/>
			- <b>[МЕЛОЧЬ]</b> Импорт контента через грабберы не проверял контент на дубликат по названию до скачивания
			  файлов, что могло приводить к неоптимальной работе импорта.
		</li>
	</ul>
	<h3 id="section_whats_new_5_1_0">KVS v5.1.0 [29.07.2019]</h3>
	<ul>
		<li>
			Появилась поддержка WebP формата для скриншотов видео. WebP - это новый формат изображений, который
			продвигается корпорацией Google и в настоящее время поддерживается основными браузерами (79.96% трафика в
			настоящий момент). Ключевой особенностью данного формата является значительное - до 30-50% - уменьшение
			размера файла по сравнению с JPG при этом без видимых изменений в качестве. Поскольку этот формат пока не
			поддерживается в 100% случаев, он может использоваться только как дополнение к формату JPG.
		</li>
		<li>
			Выполнен огромный пласт работы по улучшению плеера KVS:<br/>
			- Реализована полная поддержка спецификации VAST 3.0 (кроме industry icons, т.к. мы ни разу не видели чтобы
			  это реально использовалось среди наших клиентов). В частности, это означает возможность использования
			  wrapper-ов и улучшенных техник загрузки рекламы.<br/>
			- Реализована полная поддержка спецификации VPAID 2.0.<br/>
			- Мы изменили логику подгрузки VAST в плеере. Раньше наш плеер подгружал VAST во время инициализации, чтобы
			  не добавлять лишнюю задержку во время клика пользователя по плееру. Эта схема работала некорректно при
			  использовании разных сторонних попандеров, т.к. при их работе страница с плеером открывалась несколько
			  раз для одного и того же пользователя, а у плеера не было никакой возможности отследить это. Новая схема
			  подгрузки VAST теперь работает по аналогии с другими плеерами и будет запрашивать рекламу только при
			  попадании клика на плеер. Это должно повысить конвертацию.<br/>
			- Мобильные устройства теперь будут подгружать основное видео в фоне во время показа pre-roll рекламы. Это
			  приведет к меньшему времени ожидания после завершения рекламы, т.к. в большинстве случаев видео успеет
			  подгрузиться в буфер к этому времени.<br/>
			- Мы также изменили поведение контролбара на устройствах с тач скриншом при показе pre-roll / post-roll
			  рекламы. Ранее контролбар всегда прятался и отображался только при первом таче, что могло приводить к
			  понижению кликов и меньшему CTR. После обновления контролбар будет всегда отображаться для тач устройств
			  во время рекламы.<br/>
			- Кнопка громкости во время рекламы теперь будет позволять не только выключить звук, но и настроить его
			  громкость (для устройств, которые позволяют управление громкостью). Ранее кнопка громкости работала
			  только в режиме включения / выключения звука.<br/>
			- Мы добавили поддержку статистики плеера в KVS и в аналитике Google. В настройках статистики вы можете
			  включить сбор статистики по плееру и настроить метод сбора.<br/>
			- Кроме того в настройках статистики появилась отдельная возможность включить сбор события начала
			  проигрывания для каждого видео. По умолчанию KVS считает за "показ" видео факт открытия страницы с
			  плеером. Теперь вы сможете дополнительно включить сбор кол-ва проигрываний в плеере как отдельный
			  показатель.<br/>
			- <b>ВАЖНО!</b> В связи со всеми описанными улучшениями плеера изменились их скины. Если вы используете
			  свой кастомный скин для плеера, вам необходимо обновить его, поскольку во время обновления KVS не
			  происходит обновления кастомных скинов.
		</li>
		<li>
			Adspyglass.com стал доступным среди бесплатных поставщиков VAST, которые не требуют платной VAST подписки!
			Adspyglass.com поддерживает более 30 наиболее популярных рекламодателей и позволяет значительно поднять
			доход с VAST рекламы путем автоматического подбора наиболее выгодного рекламного предложения для каждого
			отдельного посетителя исходя из его страны и типа устройства.
		</li>
		<li>
			Статистика плеера теперь поддерживает гораздо больше данных, чем ранее. Теперь вы можете использовать ее
			для оценки качества трафика из разных источников (при помощи функционала рефереров KVS). Если вы покупаете
			трафик из разных источников, вы можете воспользоваться опциями группировки, чтобы сгруппировать статистику
			по каждому рефереру. Отмечая разницу в цифрах между разными источниками трафика (которая для удобства
			теперь показывается автоматически в скобках), вы сможете легко вычислять источники плохого трафика или
			читеров, т.к. маловероятно что они смогут эмулировать такую же картину поведения, как и реальный трафик на
			вашем сайте.
		</li>
		<li>
			Весь интерфейс статистики по трафику переработан: добавлены новые столбцы с данными и базовые возможности
			аналитики.
		</li>
		<li>
			Теперь KVS позволит создавать анимированные GIF-ки как форматы видео. Появилась возможность задавать GIF
			формат среди остальных форматов видео и создавать GIF анимации на базе исходных видеофайлов с разными
			настройками трейлера и длительности. Так, например, можно будет создавать 5 секундные GIF трейлеры для
			каждого видео.
		</li>
		<li>
			CTR ротатор получил несколько значимых улучшений:<br/>
			- Мы избавились от старого способа калькуляции, который затормаживал расчет CTR. Новый метод будет отражать
			  реальный CTR на момент пересчета и сортировка по CTR будет показывать лучшие видео на данный момент.
			  Таким образом, кэширование сайта теперь никак не будет влиять на расчет CTR.<br/>
			- Теперь в ротаторе можно настраивать примесь при выводе лучшего по CTR видео. Это позволит включать новые
			  случайные видео в ротацию, при этом все еще показывая большинство наиболее кликабельных видео. Такая
			  возможность доступна для каждого списка видео в отдельности и настраивается через параметры блока
			  <b>list_videos</b> (новый параметр <b>randomize_positions</b>).
			- Кроме этого, мы поработали над улучшениями производительности и смогли несколько снизить нагрузку
			  ротатора на базу данных во время пересчета CTR. Мы также добавили опцию расписания в настройках ротатора,
			  которая позволяет повысить интервал между пересчетами для снижения нагрузки, а также дает возможность
			  установить "тихий" период времени, в течение которого работа ротатора будет приглушаться.
		</li>
		<li>
			В настройках создания тэгов теперь можно указать, чтобы все новые тэги создавались неактивными и не
			появлялись на сайте без ручной активации.
		</li>
		<li>
			В персональных настройках вернулась возможность настроить максимальный размер тумб в списках панели
			администрирования, которую мы убрали в обновлении 5.0.
		</li>
		<li>
			В панели администрирования теперь можно будет настроить, чтобы по умолчанию создателем всего нового
			контента являлся анонимный пользователь.
		</li>
		<li>
			На странице старта мы добавили вывод статистики показов ваших embed кодов.
		</li>
		<li>
			В биллингах мы добавили поддержку повтора любого постэка, который обработался с ошибкой. Для того, чтобы
			это стало возможным, мы вернули логгирование email и пароля в логи биллингов (мы убирали это в версии
			4.0.2).
		</li>
		<li>
			В интерфейсе импорта добавились подсказки с примерами данных по всем полям импорта. Также добавилась
			поддержка поля уровня доступа при импорте видео и альбомов.
		</li>
		<li>
			В комментариях в панели администрирования мы изменили способ отбражения длинных комментариев. Ранее
			комментарии с длиной более 200 символов обрезались в конце. Теперь такие комментарии будут обрезаться в
			середине, чтобы оставить видимой и первую, и последнюю части. Кроме того, появился новый столбец списка,
			который позволит отобразить текст комментария целиком без обрезания.
		</li>
		<li>
			Проверка серверов хранения теперь будет посылать реферер для обхода некоторых случаев настройки, которые не
			позволяют иметь доступ к видеофайлам без реферера.
		</li>
		<li>
			Плагин резервного копирования станет использовать более удобное наименование файлов резервных копий.
		</li>
		<li>
			Движок конвертации больше не будет поддерживать создание файлов FLV формата, которые в настоящее время не
			используются в реальной жизни.
		</li>
		<li>
			В блоках редактирования видео (<b>video_edit</b>) и альбомов (<b>album_edit</b>) появилась возможность
			установить опцию уровня доступа при загрузке или редактировании контента.
		</li>
		<li>
			Блоки регистрации (<b>signup</b>) и редактирования профиля (<b>member_profile_edit</b>) при заполнении
			даты рождения теперь будут производить полноценную проверку, чтобы пользователю было полных лет не менее
			чем лимит, заданный в конфигурационном файле <b>setup.php</b> (по умолчанию он выставлен в 18 лет). Ранее
			эта опция использовалась только для ограничения списка доступных годов в селекторе возраста, но KVS никогда
			не проверял выбранную дату на кол-во полных лет.
		</li>
		<li>
			В случае наличия в группе хранения нескольких активных серверов, KVS теперь будет исключать из раздачи
			сервера, по которым автоматической проверкой определена ошибка отдачи.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- <b>[КРИТИЧНО]</b> Обработчик NATS завершал обработку постбэка с ошибкой, если в его настройках не были
			  заданы пакеты доступа (появилась после 5.0).<br/>
			- <b>[СЕРЬЕЗНО]</b> Неполное копирование видеофайла при пересоздании его из самого себя могло приводить к
			  битости видео без возможности восстановления.<br/>
			- <b>[СЕРЬЕЗНО]</b> Функциональность моделей и контент провайдеров приводила к SQL ошибкам в версии MySQL 8.<br/>
			- <b>[СРЕДНЕ]</b> В некоторых случаях при ручном удалении фоновых задач могли оставаться временные исходные
			  файлы видео.<br/>
			- <b>[СРЕДНЕ]</b> Ранжирование моделей и контент провайдеров могло не работать корректно в некоторых версиях
			  MySQL.<br/>
			- <b>[МЕЛОЧЬ]</b> Фиды импорта неправильно отображали кол-во удаленных видео (появилась после 5.0).<br/>
			- <b>[МЕЛОЧЬ]</b> Плагин автоподбора категорий неправильно учитывал тэги в случае разницы в регистре
			  написания.<br/>
			- <b>[МЕЛОЧЬ]</b> Функционал определения битых скриншотов работал некорректно в некоторых случаях и мог
			  приводить к значительному замедлению создания скриншотов по видео.<br/>
			- <b>[МЕЛОЧЬ]</b> В некоторых случаях плеер мог отобразить на 1 таймайновый скриншот больше, чем
			  требовалось, что приводило к появлению 404 ошибок по таймлайновым скриншотам.<br/>
			- <b>[МЕЛОЧЬ]</b> Плагин FTP загрузки контента позволял создавать премиум видео даже при отсутствии
			  форматов премиум видео.<br/>
			- <b>[МЕЛОЧЬ]</b> Комментарии могли быть сдвинуты на дальнее будущее при смещении даты публикации видео или
			  альбома вперед.
		</li>
	</ul>
	<h2 id="section_whats_new_5_0">KVS v5.0</h2>
	<h3 id="section_whats_new_5_0_1">KVS v5.0.1 [17.04.2019]</h3>
	<ul>
		<li>
			Появилась возможность обновления проектов 4.x на 5.0 в рамках процедуры бета обновления.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Пустая строка в конце данных импорта приводила к зависанию процедуры проверки импорта.<br/>
			- Невозможность создания групп каналов в панели администрирования.<br/>
			- Некорректно работала процедура изменения пароля администратора на сателлитах.<br/>
			- Фиды импорта не обрабатывали некоторые видео галереи.
		</li>
	</ul>
	<h3 id="section_whats_new_5_0_0">KVS v5.0.0 [24.03.2019]</h3>
	<p>
		<b>KVS исполнилось 10 лет! 10 лет назад в феврале 2009 года мы анонсировали первую публичную версию KVS. С тех
		пор мы выпустили почти 60 новых версий и реализовали почти 1000 улучшений. С годовщиной, KVS, и вперед к новым высотам!</b>
	</p>
	<p>
		Эта версия изначально планировалась как 4.1, однако ввиду миграции на PHP7 она вылилась в огромное кол-во
		изменений и несовместимостей, что мы решили изменить наименование на 5.0 и начать новую ветку.
	</p>
	<ul>
		<li>
			Реализована поддержка PHP 7. Это принесло много изменений в исходный код KVS, и теперь большинство кастомных
			изменений в системных файлах KVS может стать неработоспособным и будет требовать переработок. Особенно это касается
			кастомных блоков сайта, которые создавались как копии системных блоков. Все это не касается любых кастомизаций темы,
			которые не затрагивают PHP код. Получить список кастомизаций системных файлов, и список добавленных сторонних PHP
			скриптов можно через плагин аудита системы - необходимо запустить проверки инсталляции и критериев безопасности.
		</li>
		<li>
			Полностью переписан API биллингов и все поддерживаемые биллинги. Теперь добавление нового процессора оплаты
			максимально упрощено и не требует знаний структуры данных KVS. Во всех процессорах, где предоставляется на уровне
			биллинга, добавлена поддержка триалов. Триалы в KVS могут быть настроены по-разному: они могут давать как премиум
			доступ, так и стандартный доступ с некоторым кол-вом токенов. Это позволяет разграничить уровни доступа для триальных и
			полноценных премиум пользователей, а токены могут использоваться для установления жесткого лимита на кол-во
			просмотренного контента. Новый API биллингов позволит нам быстро вносить улучшения в эту сферу, что мы начнем делать
			уже в следующих обновлениях.
		</li>
		<li>
			Во всех объектах категоризации добавлено поле статуса и возможность деактивировать любые объекты категоризации, при
			этом не удаляя их. Неактивные объекты пропадут из списков по всему сайту, но при этом останутся доступными по прямым
			ссылкам. Кроме того, теперь для каждого сателлита через локализацию данных можно будет детально настраивать какие
			объекты категоризации доступны на данном конкретном сателлите. Ранее такая возможность была только у основного контента
			(видео и альбомы).
		</li>
		<li>
			В настройках контента появился раздел настройки категоризации с большим кол-вом новых опций по управлению
			динамическим созданием тэгов. Тэги, в отличие от всех других объектов категоризации, создаются динамически импортом,
			грабберами и даже пользователями сайта. Теперь можно настроить правила создания тэгов и, тем самым, несколько
			ограничить их: не создавать слишком короткие или длинные тэги, не создавать тэги которые являются просто словами языка
			или которые содержат спец. символы. Эти правила будут влиять на все места динамического создания тэгов, кроме
			непосредственно страницы тэгов в панели администрирования.
		</li>
		<li>
			Альбомы теперь поддерживают фотографии в форматах PNG и GIF, включая анимированные GIF. Поддержка сделана частично -
			все уменьшенные тумбы все равно конвертируются в JPG формат (для анимированных GIF берется первый кадр). Тем не менее
			это позволяет просматривать оригиналы загруженных изображений в оригинальных форматах.
		</li>
		<li>
			Полностью изменена концепция поисковых запросов пользователей. В новой версии мы оптимизировали структуру хранения
			поисковых запросов и теперь вывод списка похожих запросов или просто формирование любых списков запросов будет работать
			в десятки раз быстрее на больших базах. Также это позволило сделать функционал для ручного добавления списка запросов в
			панели администрирования для SEO наполнения.
		</li>
		<li>
			Появилась возможность использовать adblock защиту в рекламе совместно с рекламой от Clickaine. Эта функциональность
			поможет снизить вероятность срабатывания adblock плагинов на включенную рекламу и повысить доходность от сайта. В
			дальнейшем мы будем улучшать интеграцию реагированием на нововведения Google и других браузеров. Летом 2019 года Google
			планирует интегрировать собственный блокировщик рекламы в Chrome, что может значительно повлиять на рынок рекламы.
			Начиная с KVS 5.0 мы будем прорабатывать данный вопрос и тестировать различные технологии с целью минимизации влияния
			изменений на наших клиентов.
		</li>
		<li>
			В панели администрирования настройки столбцов для списков видео и альбомов теперь доступны на самих списках (ранее
			опции выбора столбцов находились в персональных настройках). На многих других списках также появилась возможность
			выбирать столбцы для отображения - но пока еще не на всех. Работа по этому вопросу будет завершена в следующих версиях.
			Везде, где имеет смысл, мы добавили возможность отобразить тумбу на списке, а также выбирать файловые столбцы для
			отображения. Также теперь можно задавать порядок отображения столбцов удобным для вас образом.
		</li>
		<li>
			Появилась возможность награждать токенами за привлечение новых пользователей на сайт. Для этого вам необходимо
			настроить параметр партнерки и саму награду в разделе настроек мемберзоны, а для пользователей вывести реф ссылки с их
			ID в параметре партнерки. Рекламируя свои реф ссылки пользователи будут зарабатывать заданное кол-во токенов за каждую
			новую бесплатную регистрацию. Награждать токенами можно также за платные регистрации с использованием кодов доступа - в
			этом случае стоимость награды настраивается в плагине генерации аккаунтов пользователей при создании кодов доступа, она
			может быть разной для кодов доступа разных типов. Таким образом, вы можете продавать коды доступа и награждать токенами
			пользователей, которые привлекают других покупать и использовать ваши платные коды. В дальнейшем токены могут
			выплачиваться или использоваться для повышения привилегий на самом сайте.
		</li>
		<li>
			Переработана проверка файлов на удаленных серверах, в частности добавлена поддержка HTTP/2, что раньше приводило к
			ложным срабатываниям разного рода ошибок.
		</li>
		<li>
			Для моделей добавлена поддержка группировки по аналогии с группами категорий.
		</li>
		<li>
			Изменена логика хранения паролей пользователей и администраторов. Также добавлена возможность кастомизировать
			функцию хэширования паролей, что позволит корректно мигрировать пароли пользователей с любых других проектов независимо
			от функции хэширования, которая ранее использовалась на них. В целях повышения безопасности рекомендуем изменить пароль
			суперадминистратора (можно на тот же самый) в персональных настройках сразу после обновления.
		</li>
		<li>
			Плагины, работающие по расписанию (очистка кэша шаблонов, генерация аватаров категорий, резервное копирование),
			теперь можно настроить на определенный интервал времени, чтобы они срабатывали в разное время, если на сервере
			установлено несколько проектов KVS.
		</li>
		<li>
			Улучшилась работа со стоп-словами. Раньше стоп слова без звездочки (*) работали некорректно. Например, если было
			задано "слово" и автозамена "[удалено]", то при наличии в тексте "словосочетания" это приводило к "[удалено]сочетания",
			то есть "слово" всегда заменялось, даже если было частью другого слова. Теперь замена или удаление будет идти строго по
			границе слов - в новой версии "словосочетание" не будет затрагиваться. Чтобы затрагивались составные слова теперь
			обязательно следует использовать символ звездочки, например "слово*". Также появилась возможность автозамены через
			регулярные выражения - они будут действовать в любом контенте, отправленном пользователями сайта.
		</li>
		<li>
			Улучшилась производительность панели администрирования при работе с большими базами контента. Теперь при медленной
			работе списков выключение столбцов с агрегирующими данными будет снижать нагрузку и ускорять работу списков.
		</li>
		<li>
			В панели администрирования все редакторы категоризации получили поддержку кнопки Сохранить и след. по аналогии с
			редакторами контента.
		</li>
		<li>
			Добавлена поддержка описания у пользователей сайта, а также у администраторов и групп администраторов.
		</li>
		<li>
			В плагине резервного копирования настройки плеера теперь не сохраняются вместе с копией сайта. В новой версии
			плагина настройки плеера сохраняются отдельной опцией вместе с настройками embed плеера и VAST профилями.
		</li>
		<li>
			Настройки прокси в плагине грабберов не использовались повсеместно, а использовались только при работе youtube-dl,
			в то время как грабберы могли делать дополнительные запросы без использования youtube-dl. Теперь одинаковый прокси
			сервер будет использоваться для всех запросов при граббинге одного видео. Также в настройках отдельных грабберов
			появилась возможность прописать данные логина, если сайт требует активного профиля для доступа к видео.
		</li>
		<li>
			В грабберах добавлен фильтр по терминологии, который позволяет не импортировать контент с определенными словами.
		</li>
		<li>
			Страны в панели администрирования теперь могут быть сгруппированы по континентам для удобства выбора.
		</li>
		<li>
			Изменена концепция кэширования <b>xxx_view</b> и <b>xxx_comments</b> блоков для залогиненных пользователей. Это должно уменьшить
			кол-во мусорных файлов кэша и в целом сократить размер файлового кэша без заметного увеличения нагрузки на базу данных.
		</li>
		<li>
			Блоки сайта перегруппированы по критериям функциональности и типам. Для всех блоков завершена группировка параметров
			по логическим группам и связям. Завершена переработка документации и шаблонов по умолчанию для 45 из 60 блоков.
			Переработанные шаблоны сделаны таким образом, что выводят максимально возможное кол-во данных и опций в полностью
			рабочем виде, что позволяет в случае необходимости оттолкнуться от базового шаблона и добавить исключительно дизайн и
			стилизацию. Работа над оставшимися 15 блоками будет завершена в ближайших обновлениях.
		</li>
		<li>
			При включении расширенной фильтрации на сателлитах видео и альбомы теперь будут отфильтровываться не только на
			списках, но также и их прямые URL-ы будут отдавать 404 ошибки. Расширенная фильтрация используется на сателлитах для
			ограничения объема контента, который отображается на них.
		</li>
		<li>
			Добавлена возможность пользователям создавать записи через блок <b>post_edit</b>.
		</li>
		<li>
			В блоках комментариев появилась возможность сортировки по рейтингу (лайкам). Теперь можно вывести топовый
			комментарий отдельно от всех остальных через подключения отдельного блока комментариев с параметрами <b>items_per_page=1</b> и
			<b>sort_by=rating</b>.
		</li>
		<li>
			Вход в мемберзону теперь работает не только по имени пользователя, но и в том числе по email.
		</li>
		<li>
			В блоке <b>search_results</b> при выводе похожих поисковых запросов теперь можно настроить механику критерия похожести в
			параметре - <b>search_method</b>: или по полнотекстовому индексу, или по совпадению отдельных слов, или по совпадению с
			запросом целиком.
		</li>
		<li>
			В блоках <b>video_view</b> и <b>album_view</b> ограничение просмотра по кол-ву контента (не более N видео за M минут) было
			переведено на IP адреса. Ранее эта функциональность работала через cookies, что с одной стороны позволяло снизить
			нагрузку, но с другой стороны позволяло удалить cookies и снова смотреть контент без срабатывания ограничения. Мы
			изменили поведение в угоду более надежной работе, но за счет потери производительности. Если у вас используются данные
			ограничения, обновление может привести к росту нагрузки на базу данных.
		</li>
		<li>
			Исправлены следующие баги:<br>
			- При создании или удалении формата таймлайновых скриншотов движок конвертации проходился по всем видео, даже по тем, у
			  которых не было таймлайновых скриншотов, что приводило к очень медленной скорости обработки данных типов задач.<br>
			- Перезапуск ошибочных задач новых видео или альбомов мог приводить к появлению мусорных файлов на серверах хранения
			  из-за того, что при новом запуске выбиралась новая группа серверов.<br>
			- Исправлена проблема с переходом на полный экран в плеере в iPad на новых версиях iOS (эта поправка была ранее
			  анонсирована на форуме как патч плеера после версии 4.0.4).<br>
			- Селекторы категорий и моделей в панели администрирования не работали корректно при вставке сложносоставного списка
			  категорий или моделей, а также могли приводить к созданию категорий или моделей с разным регистром.<br>
			- В плеере для мобильных браузеров UCBrowser выключена VAST реклама из-за отсутствия возможности пропускать ее. В
			  настоящее время все плееры на рынке работают некорректно в UC Browser.
		</li>
	</ul>
	<h2 id="section_whats_new_4_0">KVS v4.0</h2>
	<h3 id="section_whats_new_4_0_4">KVS v4.0.4 [12.10.2018]</h3>
	<ul>
		<li>
			1) Исправлены следующие баги:<br/>
			- Плеер не работал на новых устройствах с Android 9.<br/>
			- В плагине push сообщений обновлен JS файл в связи с изменениями в требованиях рекламодателя.<br/>
			- Плагин грабберов теперь будет корректно показывать индикатор прогресса при попытке обработать URL списка
			  с большим кол-вом контента на нем.<br/>
			- Фоновые задачи, которые удаляли формат видео или таймлайновые скриншоты, проходились по всем видео в базе
			  и могли занимать длительное время в случае медленного соединения с серверами хранения.<br/>
			- При настройке балансировки отдачи контента по странам убрано ограничение на 200 символов, которое ранее
			  не позволяло задать большое кол-во стран.
		</li>
	</ul>
	<h3 id="section_whats_new_4_0_3">KVS v4.0.3 [04.09.2018]</h3>
	<ul>
		<li>
			Большой комплекс улучшений плеера:<br/>
			- Логотип плеера теперь можно задать не только изображением, но и текстом.<br/>
			- Мобильные версии плеера теперь будут показывать таймлайновые скриншоты при тач нажатиях на таймлайне.<br/>
			- Изменено поведение попандера. Попандер будет по умолчанию устанавливаться на всех устройствах (ранее он
			  устанавливался только на устройствах с поддержкой автопроигрывания). Для возврата к старому поведению
			  доступна новая опция в настройках попандера.<br/>
			- Звук видео рекламы теперь будет устанавливаться аналогично звуку основного видео: исходя из предыдущих
			  настроек пользователя или на основе значения по умолчанию в настройках плеера.<br/>
			- Опцию повтора pre-roll рекламы теперь можно привязать не только к кол-ву просмотренных видео, но и к
			  интервалу времени.<br/>
			- Post-roll рекламу теперь можно использовать в режиме после паузы, что позволит значительно увеличить
			  кол-во ее срабатываний. Кроме того в post-roll рекламе теперь можно использовать сторонних VAST
			  провайдеров по подписке.<br/>
			- Для pre-roll и post-roll рекламы добавлена поддержка альтернативных провайдеров, которые будут
			  устанавливаться в случаях, когда основные провайдеры возвращают пустую рекламу.<br/>
			- Выполнены некоторые улучшения по реализации спецификации VAST, добавлена поддержка типовых макросов в
			  VAST конфигурациях.<br/>
			- Для pre-roll VAST рекламы теперь можно включить специальный режим, при котором логотип плеера будет
			  браться из VAST рекламы, что может являться требованием некоторых VAST провайдеров.<br/>
			- Автопроигрывание теперь будет влиять и на pre-roll рекламу - на десктопах плеер будет начинать
			  автопроигрывание pre-roll рекламы, если она задана, в том числе VAST.<br/>
			- Исправлена проблема при которой могла не показываться реклама при инициализации плеера при отказе VAST
			  провайдера устанавливать pre-roll рекламу.<br/>
			- Исправлена проблема, когда при установке попандера также устанавливалась и pre-roll реклама (VAST).<br/>
			- Исправлена проблема с автопроигрыванием в Chrome на десктопах.<br/>
			- Исправлена проблема с нерабочими динамическими HTTP переменными в HTML рекламе плеера.<br/>
			- Исправлена проблема с отсутствием похожих видео при использовании VAST рекламы.<br/>
		</li>
		<li>
			Добавлены профили VAST, которые позволяют построить свою схему подключения VAST провайдеров с учетом
			разброса по странам и последовательности использования. Профили VAST предоставят возможность
			максимизировать доход от VAST рекламы за счет использования различных провайдеров, таргетированных под
			разные страны, а также параллельного использования нескольких разных провайдеров одного за другим.
		</li>
		<li>
			Набор улучшений в грабберах:<br/>
			- Большинство грабберов переведено на youtube-dl, это позволит использовать для данных грабберов
			  мультипоточные загрузчики файлов (например, aria2) и значительно ускорить скачивание видеофайлов без
			  каких-либо ограничений по скорости. Также для многих грабберов добавилась поддержка данных о контент
			  провайдере.<br/>
			- Грабберы теперь могут поддерживать доп. поля, а грабберы видео будут поддерживать импорт данных о канале,
			  для тех грабберов, где есть поддержка данных о контент провайдере. Название канала будет то же самое, что
			  и название контент провайдера, но в зависимости от структуры вашей категоризации вы можете захотеть
			  импортировать его как контент провайдер или как канал.<br/>
			- В грабберах теперь можно задать фильтр по кол-ву просмотров. Такой фильтр имеет смысл использовать
			  совместно с фильтром по рейтингу, чтобы при импорте наиболее рейтингового контента не импортировать
			  контент у которого лишь несколько десятков просмотров - в данном случае информацию по рейтингу еще может
			  быть необъективной.<br/>
		</li>
		<li>
			Добавлен плагин интеграции с сервисом push сообщений, что позволит использовать еще один дополнительный
			канал монетизации сайта.
		</li>
		<li>
			В настройках форматов видео добавлена возможность привязать смещения с начала и с конца к доп. полям
			контент провайдеров. Данная функциональность может использоваться для срезания рекламного фрагмента с
			начала или с конца видео с разными смещениями для разных источников контента.
		</li>
		<li>
			В настройках мемберзоны появилась возможность настроить начисление токенов за просмотры embed кодов видео,
			загруженных пользователем. Данная функциональность работает по аналогии с начислением токенов за просмотры
			видео, однако учитывает только показы видео в embed кодах (то есть не учитывает показы видео у вас на
			сайте).
		</li>
		<li>
			В рассылках появилась дополнительная опция сделать экспорт email-ов пользователей, вместо непосредственного
			осуществления рассылки. Таким образом вы легко сможете использовать сторонний функционал рассылок в любой
			момент.
		</li>
		<li>
			В настройках ограниченного доступа в панель администрирования теперь возможно расширение групповых
			привилегий для отдельных администраторов. Ранее, если администратору была назначена группа привилегий, он
			наследовал все свои привилегии из настроек группы. Теперь же кроме привилегий группы для него можно задать
			индивидуальные дополнительные привилегии.
		</li>
		<li>
			Оптимизирована работа плагина очистки кэша с файловой системой, что позволило несколько снизить нагрузку на
			диски, которую производил плагин.
		</li>
		<li>
			Улучшены селекторы категоризации в панели администрирования. Так, в них добавилась опция сортировки и
			возможность отмены разбиения на группы.
		</li>
		<li>
			В экспорте видео добавлена возможность экспортировать данные о размере, длительности и весе любого 
			формата видео.
		</li>
		<li>
			В фидах импорта появилась возможность установить определенный канал для всех видео из фида.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- В моделях не было проверки на уникальность названия.<br/>
			- В грабберах альбомов некорректно работали некоторые фильтры.<br/>
			- В истории изменений шаблонов файлы, которые имели размер больше чем 64 KB, обрезались, тем самым не
			  позволяя сохранять их целостность в истории изменений.<br/>
			- При удалении видео или альбомов, которые находились в процессе обработки и задачи которых уже были
			  скопированы на сервера конвертации, данные задачи не удалялись и могли приводить к долгому залипанию
			  серверов конвертации.<br/>
			- Была улучшена безопасность отображения панели администрирования для ограниченных администраторов. Теперь
			  они не смогут видеть списки других администраторов, а также данные по LA системы и свободному дисковому
			  пространству.<br/>
		</li>
	</ul>
	<h3 id="section_whats_new_4_0_2">KVS v4.0.2 [17.05.2018]</h3>
	<ul>
		<li>
			Добавлена поддержка интеграции с Google ReCAPTCHA. Для корректной работы плагина необходимо вносить
			массивные изменения в шаблоны темы. Информация о необходимых изменения будет доступна на форуме.
		</li>
		<li>
			Добавлена поддержка отдельного процессора ccbill для динамических цен (CCBill Dynamic Pricing).
		</li>
		<li>
			В настройках платных пакетов доступа добавлена поддержка фильтрации по странам, чтобы определенные пакеты
			можно было показывать только для определенных стран. Это позволит прописывать пакеты доступа в разных
			валютах, а также делать уникальные предложения для разных сегментов рынка.
		</li>
		<li>
			В серверах конвертации теперь можно изменять настройки библиотек прямо из панели администрирования. Ранее
			это было возможно только напрямую на файловой системе.
		</li>
		<li>
			Для моделей в дополнении к дате рождения добавлено поле даты смерти.
		</li>
		<li>
			В грабберах изменено заполнение временной части даты публикации при импорте контента. Ранее дата публикации
			могла опционально браться из данных граббера, а время всегда ставилось случайным в диапазоне от 00:00 до
			23:59. Сейчас появилась дополнительная опция, которая позволяет включить случайное распределение времени -
			если эта опция не включена, то по умолчанию контент будет добавляться по текущему серверному времени.
		</li>
		<li>
			Быстрый просмотр видео в панели администрирования больше не будет открывать отдельное окно браузера, а
			будет показывать плеер поверх текущего окна.
		</li>
		<li>
			Список страниц сайта при отображении глобальных блоков из компонентов больше не будет отображать все
			глобальные блоки на каждой странице сайта (такое происходило когда, например, в шапке сайта было подключено
			несколько глобальных блоков. Вместо этого будет отображаться только 1 строка с указанием кол-ва глобальных
			блоков на странице, которую при необходимости можно будет развернуть для получения полного списка.
		</li>
		<li>
			Мы начали работу над глобальной переработкой параметров блоков и их документации. Параметры блоков будут
			сгруппированы по логическим группам для более простого их понимания. Документация блоков будет переписана
			исходя из современных реалий работы блоков, а также шаблоны блоков по умолчанию будут изменены на вывод
			всех возможных данных (для блоков форм на ввод всех возможных полей), что позволит при необходимости вывести
			любые данные в блоке просто скопировав код вывода из шаблона по умолчанию. Учитывая большое кол-во блоков в
			KVS данная работа займет длительное время.
		</li>
		<li>
			В рамках принятия Евросоюзом GDPR мы пересмотрели наборы данных, которые KVS хранит по зарегистрированным
			пользователям, и внесли необходимые поправки для полного удаления любых данных, связанных с пользователем
			при удалении его профиля. Ранее KVS сохранял логи платных транзакций и логи всех логинов даже при удалении
			профиля. Мы также предоставим на нашем форуме информацию о том, какие данные KVS обрабатывает и хранит по
			зарегистрированным пользователям.
		</li>
		<li>
			В блоках списка моделей (<b>list_models</b>) и списка категорий (<b>list_categories</b>) добавилась
			поддержка режима похожих моделей (категорий) по видео и альбомам. Эти режимы позволяют вывести моделей
			(категории), которые проставлены в тех же видео / альбомах, что и текущая модель (категория).
		</li>
		<li>
			В блоке регистрации (<b>signup</b>) появилась возможность настроить, чтобы поле ввода кода доступа было
			обязательным. Тем самым регистрация через данный блок будет допустима только при наличии кода доступа.
		</li>
		<li>
			В блоке логина (<b>logon</b>) появилась возможность ограничить вход только для пользователей со статусом
			вебмастера. Это может быть полезно, если вы хотите разделить мемберку на пользователей и вебмастеров, для
			которых доступна разная функциональность.
		</li>
		<li>
			В блоке логина (<b>logon</b>) появилась возможность настроить логгирование всех входов на сторонний скрипт.
			В частности NATS позволяет логгировать входы на свой скрипт для их последующего анализа.
		</li>
		<li>
			В блоке списка сообщений внутренней почты (<b>list_messages</b>) появилась возможность массово подтвердить
			или отклонить все приглашение к дружбе.
		</li>
		<li>
			В блоке миксового контента (<b>list_content</b>) добавили несколько режимов отображения, которые
			предусмотрены для отдельных списков видео или альбомов.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Exoclick теперь должен корректно учитывать статистику по VAST, приходящую от плеера KVS.<br/>
			- В плеере при включении одновременно VAST и рекламы при инициализации, реклама при инициализации была
			  некликабельна.<br/>
			- Опция пропуска прерол рекламы через N видео приводила к искажению статистики у рекламодателей VAST,
			  поскольку плеер в некоторых случаях запрашивал VAST тэг, но не показывал рекламу. Сейчас плеер будет
			  запрашивать VAST тэг только в случае 100% показа рекламы.<br/>
			- Некорректная обработка вертикальных видео на новых версиях ffmpeg.<br/>
			- Исправлена утечка памяти при большом кол-ве видео в массовом редактировании и плагине статистики
			  контента.<br/>
			- При активации половинной обработки видео приоритеты вторичных задач не совпадали с приоритетом основной
			  задачи.<br/>
			- В некоторых случаях задачи загрузки новых фотографий в альбомы могли завершаться ошибкой без причины.<br/>
			- В блоке списка группы категорий (list_categories_groups) не выводились аватары для групп.<br/>
			- При изменении тэга не всегда корректно происходило обновление его директории.<br/>
			- Плагин автоподбора моделей не учитывал моделей с цифрами в названии.<br/>
			- При загрузке ZIP архива, закрытого на пароль, KVS не показывал адекватного сообщения с ошибкой.<br/>
			- Грабберы больше не будут маскироваться под GoogleBot, это позволяет некоторым сайтам проводить проверку и
			  блокировать подобные запросы.<br/>
			- Плагин генерации аватаров категорий и доп. выборки видео по каждой категории не учитывали статистику
			  ротации по категориям при сортировке по CTR. Это приводило к несоответствию картинки на категории и
			  первому видео из этой категории по CTR.<br/>
			- При переключении аплода файлов на сабдомен не работала загрузка файлов в случае включения ограничения
			  доступа к загрузчику файлов, которые добавились в 4.0.1.
		</li>
	</ul>
	<h3 id="section_whats_new_4_0_1">KVS v4.0.1 [16.02.2018]</h3>
	<p>
		Несколько улучшений по плееру:<br/>
		- Появилась возможность использования сторонних VAST провайдеров через подписку. В настоящее время подписка
		  будет бесплатной в рамках бета тестирования.<br/>
		- Реклама теперь не будет исчезать после клика по ней.<br/>
		- Улучшена работа анти-adblock модуля, теперь можно задать интервал в секундах, который смогут проиграть
		  пользователи с adblock после чего плеер сымитирует поломку и покажет настроенный HTML код вместо видео.<br/>
		- Добавлена поддержка inline проигрывания на Iphone, это позволит показывать прерол рекламу также и на этих
		  устройствах.<br/>
		- Исправлено поведение индикатора звука на мобильных устройствах - теперь он будет отображаться в режиме
		  кнопки, что позволит выключить \ включить звук. Ранее на мобильных устройствах индикатор звука не
		  отображался.
	</p>
	<p>
		В экспорте видео и фидах экспорта добавилась поддержка форматирования длительности в виде HH:MM:SS формата.
	</p>
	<p>
		В блоке списка комментариев (<b>list_comments</b>) добавлен режим вывода комментариев ко всему контенту
		пользователя.
	</p>
	<p>
		В блоке списка каналов (<b>list_dvds</b>) появился режим, позволяющий вывести каналы, доступные для загрузки
		исходя из их настроек приватности.
	</p>
	<p>
		В блоке миксового контента видео и альбомов (<b>list_content</b>) появились режимы для вывода списка контента
		загруженного пользователем, купленного пользователем и из подписок пользователя.
	</p>
	<p>
		Исправлены следующие баги:<br/>
		- В некоторых случаях не накладывался движущийся watermark на видео.
	</p>
	<h3 id="section_whats_new_4_0_0">KVS v4.0.0 [15.01.2018]</h3>
	<p>
		Начиная с 4 ветки мы хотим глобально изменить подход к версионности KVS, а также к политике обновлений. Ранее у
		KVS были основные ветки (1.x, 2.x, 3.x), доступ ко всем обновлениям в рамках каждой ветки был бесплатным, но
		переход на новую ветку был платным и стоил 25% от стоимости полной лицензии за каждую отдельную лицензию. За
		долгие годы у нас сформировалась большая база клиентов с большим кол-вом лицензий, обновление всех их лицензий
		на 4 ветку будет стоить им очень дорого.
	</p>
	<p>
		В результате мы пришли к более взвешенной политике:
	</p>
	<ul>
		<li>
			- С точки зрения новых версий мы отходим от понятия ветки, версии будут делиться на 2 типа: реализация
			  нового функционала (основная версия - 4.1, 4.2 и т.д.) и версии с исправлениями багов (4.0.1, 4.0.2).
			  Версии с исправлениями багов будут анонсироваться, но при отсутствии критичных багов предоставляться
			  только по запросу. Это позволит нам не затягивать с исправлениями багов в ожидании завершения новых фич,
			  а, при необходимости, быстро выпустить новое обновление без привязки к каким-либо планам.
		</li>
		<li>
			- Доступ к обновлениям стоит $100 в год независимо от кол-ва лицензий у клиента. Покупка любой новой
			  Ultimate лицензии автоматически продляет доступ к обновлениям на год с момента покупки, покупка любой
			  другой лицензии продляет доступ к обновлениям на полгода.
		</li>
		<li>
			- Доступ к обновлению 4.0 бесплатный для всех клиентов, купивших Ultimate лицензию после 15.01.2017 или же
			  любую другую лицензию после 15.07.2017. Для удобства кабинет клиента в ближайшем будущем отобразит
			  информацию о доступе к обновлениям.
		</li>
		<li>
			- Купленные лицензии, которые еще не были использованы получат последнюю версию в любое время без привязки
			  к датам.
		</li>
	</ul>
	<h3>Что нового в версии 4.0.0</h3>
	<ul>
		<li>
			Глобальные изменения в рекламном модуле:<br/>
			- Возможность ограничивать отдельную рекламу по типу устройств, браузеров и по статусу пользователей.<br/>
			- Возможность ограничивать отдельную рекламу по времени суток (например, с 22:00 до 02:00).<br/>
			- Возможность установить дату и время показа рекламы с точностью до минуты.<br/>
			- Возможность исключить рекламу из показа для заданных категорий.<br/>
			- Рекламные споты теперь позволяют задавать оберточный HTML, что позволит не показывать рекламный блок
			  целиком, если в нем нет рекламы для показа.<br/>
			- HTML реклама в плеере может быть теперь привязана к рекламным спотам - это даст простую возможность
			  воспользоваться всей функциональностью рекламного модуля для рекламы внутри плеера.<br/>
			- Adblock плагин больше не должен мешать работе с рекламой в KVS.
		</li>
		<li>
			Серьезные улучшения в работе движка конвертации:<br/>
			- Оптимизация создания видео трейлеров, теперь они будут создаваться гораздо быстрее и с меньшей потерей
			  качества.<br/>
			- Возможность сделать плавные переходы с одного фрагмента трейлера на следующий.<br/>
			- Поддержка движущихся watermark изображений с возможностью задать скорость, направление и любое кол-во
			  позиций как в секундах, так и в процентах.<br/>
			- Возможность конвертации видео в 2 этапа: на первом этапе создаются обязательные форматы и скриншоты, на
			  втором этапе досоздаются форматы более высоких разрешений. Это позволяет сделать видео доступным после
			  загрузки гораздо быстрее, а не ждать пока обработаются все форматы.<br/>
			- Появилась возможность включить использование настроек кропа скриншотов даже при загрузке их вручную.
			  Ранее для загруженных скриншотов кроп не использовался.<br/>
			- Значительно расширено логгирование фоновых задач конвертации. Теперь в логе фоновых задач можно
			  просмотреть все фазы работы движка над конкретной задачей, а также затраты времени на выполнение
			  конкретных операций.<br/>
			- Появилась поддержка кастомного скрипта, которым можно настроить индивидуальные параметры кропа, поворота
			  или зеркалирования исходного видеофайла для каждого загружаемого видео. Данные опции не вынесены в
			  публичные настройки, поскольку являются слишком специфическими для простых пользователей.<br/>
			- Появилась возможность грузить аудиофайлы напрямую в MP3 формат. Для корректной работы этой
			  функциональности необходимо внести mp3 формат в список разрешенных в файле
			  <b>/admin/include/setup.php</b>, а при создании видео обязательно загружать скриншоты.
		</li>
		<li>
			Большой пакет улучшений и поправок в видеоплеере KVS:<br/>
			- Возможность настроить автоматическую предзагрузку видео, что даст команду устройствам начать буферизацию
			  видео еще до начала проигрывания.<br/>
			- Возможность включить отображение похожих видео на паузе (при отсутствии рекламы).<br/>
			- Возможность включить отображение глобальной длительности видео в плеере, вместо длительности текущего
			  формата. Это может быть востребовано на сайтах с платным доступом, когда незалогиненному посетителю
			  показывается урезанный трейлер, а не полное видео.<br/>
			- Интеграция всей HTML рекламы в плеере с рекламным модулем KVS.<br/>
			- Для пре-ролл и пост-ролл рекламы в обновленных скинах плеера показывается бегунок длительности рекламы.<br/>
			- Для пре-ролл и пост-ролл рекламы теперь можно включить VAST рекламу от нескольких провайдеров.<br/>
			- Для пре-ролл рекламы можно настроить, чтобы она не показывалась на каждом видео, а только через N
			  просмотренных видео.<br/>
			- В настройках embed плеера теперь можно установить длительность кэширования, до этого embed коды всегда
			  кэшировались на сутки автоматически.<br/>
			- Исправлено некорректное поведение индикатора буферизации при перемотке или выборе другого формата.<br/>
			- Исправлена проблема с отображением таймлайновых скриншотов на полном экране.<br/>
			- Исправлена проблема с полноэкранным режимом в десктопном сафари.
		</li>
		<li>
			Несколько важных улучшений в системе хранения контента:<br/>
			- Появилась возможность запустить задачу синхронизации одного сервера хранения от другого, если они
			  находятся в одной группе серверов. Эта задача необходима при перемещении контента с одного сервера на
			  другой - ранее такую синхронизацию можно было сделать только вручную, теперь ее может сделать сам KVS.<br/>
			- В скрипте интеграции CDN был расширен API инвалидации - теперь в него передается дополнительный параметр,
			  который указывает на тип совершенной операции (добавление, изменение, удаление). Также теперь API
			  инвалидации вызывается и при добавлении новых файлов в систему хранения.<br/>
			- Появилась возможность деактивировать целые группы хранения, чтобы они не участвовали в автоматическом
			  распределении нового контента.<br/>
			- В настройках защиты видео от хотлинка белый список IP теперь позволяет полностью разблокировать доступ к
			  контенту для заданных IP. Ранее этот список IP влиял только на один тип защиты, теперь же он влияет на
			  всю защиту.
		</li>
		<li>
			Пакет улучшений по грабберам:<br/>
			- Возможность указать путь командной строки к библиотеке youtube-dl со всеми поддерживаемыми опциями для
			  тонкой настройки.<br/>
			- Для грабберов, созданных на базе youtube-dl, скачивание видеофайлов будет производиться напрямую через
			  youtube-dl, что позволит использовать библиотеку aria2 для мультипоточного скачивания без лимита
			  скорости.<br/>
			- Для грабберов, созданных на базе youtube-dl, появилась возможность задавать прокси сервера, чтобы обойти
			  блокировку IP.<br/>
			- Все существующие грабберы со временем будут переведы на youtube-dl.
		</li>
		<li>
			Несколько улучшений в плагине загрузки контента по FTP:<br/>
			- Возможность указывать описание видео (альбома) в TXT файле.<br/>
			- Возможность рандомизации порядка добавления контента.<br/>
			- Вывод информации о дубликатах контента, если таковые были найдены.
		</li>
		<li>
			Расширены настройки размеров изображений категоризации, а также для категорий и пользователей добавлены
			вторые размеры. Это можно использовать, например, для загрузки кавера или фона для страницы профиля или
			категории. Для любого размера теперь можно задать опцию ресайза, что позволит создавать изображения с
			динамическими размерами (ранее размеры были фиксированы). Из-за введения второго размера для категорий
			после обновления аудит покажет ошибку KVS #10, т.к. необходимо также внести поправки в шаблоны. Увидев эту
			ошибку вам следует обратиться в службу поддержки для исправления шаблона, указать обновленный проект(ы) и
			включить на них доступ поддержке.
		</li>
		<li>
			Появилась поддержка внутренних подписок за токены на других пользователей и каналы. При покупке подписки
			пользователь получит ограниченный по времени (или неограниченный) доступ ко всему контенту из подписки, в
			том числе и будущему. Платные подписки продляются автоматически по истечению периода действия, если на
			счету у пользователя достаточно токенов для продления. В противном случае пользователь теряет доступ и, при
			необходимости, может купить повторно. Как и с покупкой отдельных единиц контента, платные подписки могут
			отдавать часть заработанных токенов авторам, тем самым предоставляя им возможность заработать на продаже
			подписок к своим профилям или каналам. В блоках редактирования профиля и канала теперь можно указывать
			стоимость доступа в текстовом поле tokens_required.
		</li>
		<li>
			Для пакетов платного доступа теперь можно выбрать в каких местах они будут доступны: для новых
			пользователей в блоке регистрации, или для залогиненных пользователей в блоке апгрейда, или в обоих. Это
			ограничение можно использовать, например, чтобы предложить скидки пользователям, у которых истекла премиум
			подписка (и которые уже имеют доступ).
		</li>
		<li>
			Премиум доступ теперь можно покупать за токены. Для этого создан отдельный процессор оплаты:
			<b>Internal Tokens</b>. Например, пользователи могут зарабатывать токены за свою активность на вашем сайте,
			а затем при накоплении необходимого кол-ва токенов купить премиум доступ на месяц.
		</li>
		<li>
			Для возможности приема оплаты разными типами платежей теперь в блоках регистрации и апгрейда можно выводить
			пакеты доступа из всех активных процессоров оплат, а не только из того, который по умолчанию. Это позволит
			использовать несколько разных биллингов одновременно и дать пользователям возможность выбрать, каким
			биллингом воспользоваться.
		</li>
		<li>
			Пользователи теперь могут получать награды токенами за входы в мемберзону. Это можно использовать для
			стимулирования активности пользователей у вас на сайте.
		</li>
		<li>
			В настройках форматов видео при включении возможности скачивания теперь можно указывать сортировку данного
			формата по отношению к другим форматам, для которых также разрешено скачивание. Ранее форматы для скачивания
			сортировались в случайном порядке.
		</li>
		<li>
			В настройках форматов видео теперь можно установить ограничение скорости отдачи формата при просмотре в
			embed кодах. Это позволит сэкономить на трафике из embed кодов, при этом оставив их доступными.
		</li>
		<li>
			В плагинах автоподбора категорий и тэгов добавлена возможность включить поиск неполного соответствия для
			сложно-составных категорий и тэгов. Это позволит более удобно работать с русским языком, где измененное
			окончание может не позволить плагину подобрать правильную категорию. Также это дает больше простора для
			манипуляций автоподбором.
		</li>
		<li>
			Появилась возможность настроить ранжирование моделей и контент провайдеров по определенному критерию
			(сортировке). Теперь вы сможете вывести на сайте ранг объекта, а также показать изменение за сутки по
			сравнению со вчерашним рангом.
		</li>
		<li>
			В массовом редактировании видео теперь будет возможность пересоздать сразу несколько форматов видео (ранее
			можно было только 1 за раз). Также в массовом редактировании добавлена поддержка изменения поля уровня
			доступа.
		</li>
		<li>
			Появился новый интерфейс для массовой работы с видео и альбомами - массовая выборка. Используя массовую
			выборку вы можете по списку ID или URL-ов отфильтровать объекты в списке, удалить их или запустить для них
			массовое редактирование.
		</li>
		<li>
			При использовании пометить видео или альбомы как удаленные теперь можно отправить письмо со списком
			удаленных страниц. Этот интерфейс часто используется при обработке DMCA запросов.
		</li>
		<li>
			При редактировании отдельных видео или альбомов теперь можно запускать плагины автоподбора моделей,
			категорий и тэгов. Ранее возможность запуска этих плагинов была доступна только через массовое
			редактирование.
		</li>
		<li>
			В фидах экспорта появился фильтр по HD видео. Также в фидах экспорта теперь можно запросить ссылку на файл
			лучшего или хучшего качества, независимо от того, какие форматы есть у видео.
		</li>
		<li>
			В панели администрирования в интерфейсе поиска добавлена возможность поиска по локализации во всех
			объектах, которые поддерживают локализацию.
		</li>
		<li>
			В UI сайта появилась фунциональность контроля версий, которая следит за всеми изменениями шаблонов, стилей
			и JS файлов и сохраняет под разными версиями. Это позволит в любой момент откатить изменения, внесенные в
			шаблон, либо восстановить иначальную версию шаблона.
		</li>
		<li>
			В настройках сайта теперь можно установить, чтобы контент, который еще находится в стадии конвертации или
			ошибки конвертации был доступен на сайте. Таким образом добавленное видео можно будет тут же открыть и
			получить по нему ссылку или embed код. Для корректного отображения таких случаев необходимо вносить
			поправки в шаблоны, иначе в большинстве случаев шаблон покажет ошибку отсутствия доступа к видео.
		</li>
		<li>
			В настройках статистики для статистики по поиску появилась возможность настроить максимальную длину
			запросов, которые будут попадать в статистику, а также указать список символов, запросы с которыми не будут
			попадать в статистику. Это необходимо для фильтрации статистики поиска, которая в основном используется для
			расширения SEO.
		</li>
		<li>
			В движке сайта появилась поддержка минификации HTML, но она не вынесена в публичные настройки и может быть
			включена только через <b>/admin/include/setup.php</b>. Минификация HTML позволяет удалить все переносы
			строк, однако при этом перестанут работать многострочные поля описаний (при выводе они будут выводиться в
			одну строку), а также могут возникнуть проблемы с любым inline JavaScript или CSS кодом, если на какой-либо
			строке не выставлена точка с запятой. Используйте на свой страх и риск.
		</li>
		<li>
			В настройках сайта для динамических HTTP параметров теперь появилась возможность установить время их жизни
			в куках посетителей. Ранее длительность фиксировалась на 1 год. Эти параметры часто используются для
			передачи партнерских рефов на сайты.
		</li>
		<li>
			В настройках контента теперь можно установить уровни доступа к загрузчикам файлов с диска и по удаленным
			ссылкам. Ранее загрузка файлов была доступна публично, теперь ее можно закрыть либо для залогиненных
			пользователей, либо только для администраторов. Также для файлов, которые загружаются по удаленным ссылкам
			можно задать максимальное ограничение по размеру.
		</li>
		<li>
			Изменился интерфейс добавления тэгов - если раньше тэги можно было добавить только плоским списком, то
			теперь в новом интерфейсе можно добавить сразу тэги и их синонимы, а также добавить новые синонимы к уже
			существующим тэгам.
		</li>
		<li>
			При отображении плеера в редакторе видео в панели администрирования теперь будет возможность переключения
			между форматами видео, если их несколько.
		</li>
		<li>
			Важное изменение в логике уровня доступа к контенту. Вебмастера больше не имеют такого же уровня доступа,
			как премиум пользователи. Теперь вебмастера имеют такой же уровень доступа, как и обычные пользователи.
		</li>
		<li>
			При срабатывании защиты от перегрузки движок будет возвращать 503 статус и содержимое файла
			<b>overload.html</b>, а не редирект как раньше.
		</li>
		<li>
			Изменилось поведение обработки результатов поиска по строке (видео, альбомов и др). Ранее в случае только 1
			найденного объекта происходил автоматический редирект на его страницу. Это поведение было поведением по
			умолчанию. Теперь же редиректа по умолчанию не будет. Для его включения в каждом блоке, где поддерживается
			поиск по строке, добавлен параметр <b>search_redirect_enabled</b>.
		</li>
		<li>
			Блоки тэгов <b>list_tags</b> и <b>tags_cloud</b> теперь поддерживают вывод тэгов по любым объектам, а не
			только по видео и альбомам. В KVS тэги также поддерживаются в моделях, контент провайдерах, постах, каналах
			и плэйлистах.
		</li>
		<li>
			В блоках просмотра видео (<b>video_view</b>) и альбома (<b>album_view</b>) появился параметр
			<b>show_stats</b>, включение которого заставит данные блоки сделать дополнительную выборку статистики по
			данному видео или альбому. KVS может собирать статистику просмотров контента с разбиением по дням
			(включается в настройках статистики). Данную статистику можно использовать на страницах просмотра видео или
			альбома, чтобы, например, показать график популярности видео за последние 30 дней (период зависит от
			настройки длительности хранения статистики). Данную статистику также можно показать в блоках редактирования
			видео (<b>video_edit</b>) и альбома (<b>album_edit</b>).
		</li>
		<li>
			В блоке списка категорий (<b>list_categories</b>) появилась возможность выводить категории из той же
			группы (похожие категории). Для этого в блок добавлены параметры <b>var_category_id</b> /
			<b>var_category_dir</b>, которые цепляются на переданную в URL-е категорию стандартным образом.
		</li>
		<li>
			В блоке списка поисковых запросов (<b>search_results</b>) теперь можно отобразить поисковые запросы,
			релевантные для указанной категории или тэга. Для этого в блок добавлены параметры <b>var_category_id</b> /
			<b>var_category_dir</b> / <b>var_tag_id</b> / <b>var_tag_dir</b>, которые цепляются на переданные в URL-е
			категорию или тэг стандартным образом.
		</li>
		<li>
			В блоке списка постов (<b>list_posts</b>) теперь возможна фильтрация по доп. полям.
		</li>
		<li>
			Появилась возможность показывать видео и альбомы из будущего, т.е. с датами публикации в будущем. Эту
			функциональность можно включить параметром <b>mode_futures</b> в блоках <b>list_videos</b> и
			<b>list_albums</b>. Использование этой возможности может повысить конвертацию на сайтах с платным доступом.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Исправления в логике плеера и скинов (описаны выше).<br/>
			- В некоторых случаях обработчик Epoch закрывал доступ раньше положенного срока.<br/>
			- Домены, email-ы с которых заблокированы к регистрации не учитывали сабдомены.<br/>
			- Оптимизировано поведение плагина резервного копирования для сателлитов.<br/>
			- Критическая уязвимость, патч для которой был предоставлен 20 ноября.<br/>
			- Редирект на случайное видео / альбом кэшировался на 1 минуту и в течении всей минуты давал одинаковый
			  результат.<br/>
			- При использовании плагина внешнего поиска не возвращалась 404 ошибка по несуществующим страницам.<br/>
			- Множество мелких исправлений и улучшений в стабильности работы.
		</li>
	</ul>
	<h2 id="section_whats_new_3_9">KVS v3.9</h2>
	<h3 id="section_whats_new_3_9_1">KVS v3.9.1 [08.05.2017]</h3>
	<ul>
		<li>
			Улучшения и исправления плеера:<br/>
			- Улучшен скин для touch устройств и устройств с маленьким экраном, часть кнопок была спрятана, а размер
			  оставшихся стал больше.<br/>
			- Добавлен новый скин плеера в стиле youtube.com.<br/>
			- Для iOS устройств разрешена подгрузка метаданных, что позволит ускорить начало проигрывания видео на них
			  (если соотв. опция включена в настройках плеера и поддерживается типом устройства).<br/>
			- На базе таймлайновых скриншотов добавлена поддержка текстовых cuepoint-ов, которые можно задать для
			  любого таймлайнового скриншота в редактировании скриншотов видео - такие точки будут выделяться на
			  таймлайне и текстовки будут выводиться вместе со скриншотами. Это дает удобную возможность зафиксировать
			  ключевые сцены видео.<br/>
			- В настройках пре-рол и пост-рол рекламы теперь можно включить встроенную кнопку пропуска рекламы и
			  настроить, через какое время ею можно воспользоваться. Кроме того, интерфейс такой рекламы был
			  значительно улучшен - теперь вместе с ней можно показать сообщение о длительности рекламы, а для
			  видеовставок появилась поддержка паузы и выключения звука.<br/>
			- Добавлена иконка повтора видео после его завершения вместо иконки начала проигрывания.<br/>
			- В настройках плеера появилась возможность задать первоначальный уровень звука, а также исправлено
			  несколько ошибок с некорректным поведением индикатора звука.<br/>
			- В настройках плеера появилась возможность задать автоповтор для видео, которые меньше заданного порога
			  длительности.<br/>
			- Исправлено несколько проблем с отображением постера: раньше он не отображался до полной инициализации
			  плеера, а также отображался даже в случае запрограммированного автопроигрывания.<br/>
			- Исправлена проблема с отображением контекстного меню при попытке скопировать embed код.<br/>
			- Исправлено несколько ошибок с некорректным отображением таймлайн скриншотов: их размер был жестко
			  фиксирован, а также они могли позиционироваться некорректно в случае кастомизации скина.<br/>
			- Исправлено отображение вертикальных видео на сайте - теперь они не растягиваются по высоте.<br/>
			- Исправлена проблема с кэшированием редиректов на удаленные сервера хранения. В новой версии плеер
			  позволяет кэшировать редирект только в течение часа.<br/>
		</li>
		<li>
			Пересмотрены настройки блокировки доступа к видео по макс. запросам с одного IP адреса. Ввиду добавления
			шифрования ссылок на видеофайлы в версии 3.9.0 этот тип защиты потерял актуальность и теперь его можно
			выключить, что позволит несколько снизить нагрузку на диски. Кроме того, этот тип защиты больше не
			учитывает повторные запросы, а значит не зависит от того как часто пользователь осуществляет перемотку по
			видео. <b>ВНИМАНИЕ!</b> После обновления этот тип защиты будет выключен автоматически. Если вы хотите
			продолжать его использовать, вам необходимо включить его в настройках контента.
		</li>
		<li>
			Улучшения грабберов и импорта:<br/>
			- Добавилась возможность импортировать мультиформатное видео для тех источников, которые поддерживают его.
			  Это позволит сэкономить ресурсы на обработке видео, но больше времени уйдет на скачивание нескольких
			  файлов.<br/>
			- Грабберы теперь могут импортировать поле контент провайдера отдельно по каждому объекту. Это не
			  используется в грабберах, которые мы сейчас предоставляем, но может быть использовано при написании своих
			  грабберов.<br/>
			- При импорте контента через грабберы добавлена возможность пропустить контент с существующими
			  названиями.<br/>
			- Появилась возможность ограничить описание по кол-ву символов или слов.<br/>
			- Для некоторых грабберов появилась поддержка проверки контента, удаленного на источниках. Это
			  дополнительная опция в настройках граббера, которую необходимо включить, чтобы контент, удаленный на
			  источниках также удалялся и из вашей базы.<br/>
			- При использовании режима embed кодов или псевдо-видео теперь для каждого граббера можно указать постфикс
			  с вашим рефом, который будет добавляться ко всем embed кодам и ссылкам на страницы с видео.<br/>
			- Добавилась поддержка библиотеки youtube-dl, что в будущем позволит легче добавлять новые грабберы.<br/>
			- Улучшение импорта позволит еще на этапе импорта отфильтровывать контент, файлы которого не смогли
			  скачаться по каким-либо причинам, например, если сработала блокировка на источнике. Ранее такой контент
			  добавлялся в базу и уходил в ошибки на этапе конвертации, что не позволяло попробовать добавить его
			  повторно из-за проверки на дубликаты.<br/>
		</li>
		<li>
			Для таймлайновых скриншотов теперь можно настроить не только их интервал снятия, но и желаемое кол-во. С
			учетом этого интервал может быть разным для видео разной длительности. С одной стороны это сделает
			навигацию по видео не совсем точной, но с другой стороны позволит не создавать по 200-500 скриншотов на
			длинные видео. Ключевая особенность здесь в том, что минимальный интервал снятия равен 10 секундам, и все
			другие интервалы будут выбираться кратно 10 секундам. Например, если вы установите кол-во скриншотов = 100,
			то для коротких видео KVS создаст скриншоты с интервалом в 10 секунд - сколько их получится зависит от
			длительности видео. Но как только длительность видео станет больше чем 10*100=1000 секунд, скриншоты будут
			сниматься с интервалом в 20 секунд, и т.д. Если у вас уже используются таймлайновые скриншоты на базе
			фиксированного интервала, то вы можете просто изменить настройку на новую и для новых видео будет
			использоваться новый подход, а для старых видео ничего не изменится.
		</li>
		<li>
			Ввиду изменения опций создания таймлайновых скриншотов и ради будущих изменений в этой сфере, теперь после
			каждого обновления KVS будет автоматически обновлять API для всех серверов конвертации. При этом вы должны
			понимать, что любые кастомные изменения в скрипте <b>remote_cron.php</b> на серверах конвертации будут
			затерты. KVS постарается сделать бэкап старой версии этого файла рядом. Движок больше не будет использовать
			сервера конвертации с устаревшей версией API.
		</li>
		<li>
			Добавлена интеграция биллингов со скриптом партнерки MPA3.
		</li>
		<li>
			Порядок выполнения фоновых задач разных типов несколько изменен. Раньше при большом кол-ве второстепенных
			задач конвертация нового контента как бы приостанавливалась до тех пор, пока не выполнятся все
			второстепенные задачи или вручную не поднимется приоритет у задач нового контента. После обновления
			поднимать приоритет вручную больше не потребуется - обработка нового контента всегда будет идти раньше
			других задач, даже при одинаковом приоритете. Более того, теперь появилась возможность настроить приоритеты
			обработки нового контента от разных типов пользователей, для кого-то сделать пониже, а для кого-то повыше.
			Также появилась возможность вручную повысить приоритет задач прямо на списке видео или альбомов (раньше это
			действие было доступно только на списке задач).
		</li>
		<li>
			Появилась, наконец, возможность делать мягкое удаление контента. Теперь можно помечать контент как
			удаленный и указывать причину (как правило нарушение авторских прав). Все файлы такого контента будут
			удалены, включая все видеофайлы, скриншоты, форматы, но сами данные по контенту будут оставаться в базе.
			Такой контент пропадет с публичных списков сайта и будет оставаться доступным по прямым ссылкам с полным
			сохранением всей информации и комментариев. Для корректного отображения такого контента на сайте необходимо
			поправить шаблоны - это описано на форуме.
		</li>
		<li>
			В плагине генерации пользователей, который мы добавили в 3.9.0, появилась возможность вместо аккаунтов
			генерировать коды доступа, которые можно использовать при регистрации или апгрейде профиля для получения
			токенов или премиум доступа. Такие коды вы сможете продавать в любых цифровых магазинах как цифровые товары
			и не использовать традиционную схему биллингов KVS. Коды доступа во многом удобнее аккаунтов, поскольку они
			могут использоваться уже зарегистрированными пользователями с возможность сохранения своего существующего
			профиля.
		</li>
		<li>
			Для хотлинкованных видео появилась возможность полного пересоздания скриншотов. Для этого KVS придется
			заново временно скачать хотлинкованный видеофайл, чтобы создать скриншоты.
		</li>
		<li>
			Появилась возможность начисления токенов пользователям не только за загрузку каждого видео или альбома, но
			еще и за уникальный трафик на них на вашем сайте (embed коды здесь не учитываются). Вы можете задать кол-во
			токенов, которое будет выплачиваться за каждые N уникальных показов контента (под уникальным показом
			понимается уникальный IP в течение 24 часов). Особенность расчета заключается в том, что каждому отдельному
			видео или альбому необходимо набрать заданное число просмотров, чтобы была начислена награда. Данная
			функциональность может привлечь больше ссылок на ваш проект, если вы заинтересуете пользователей ссылаться
			на свои загруженные видео. Заработанные токены при необходимости можно выплачивать реальными деньгами через
			интерфейс выплат.
		</li>
		<li>
			В новой версии мы расширили функциональность уровней доступа к контенту возможностью настроить уровень
			доступа к публичному контенту (ранее такая возможность была только для личного и премиум контента). А также
			теперь появилась возможность индивидуально для каждого видео или альбома перекрыть уровень доступа, который
			по умолчанию берется из типа видео или альбома. Это поможет в какой-то мере преодолеть архитектурную
			особенность KVS, которая не позволяет из публичного видео сделать премиум и наоборот. Теперь, если вы
			захотите закрыть от публичного доступа любое публичное видео это можно сделать без изменения типа видео.
		</li>
		<li>
			В админ панели улучшена верстка скриншотов и фотографий альбомов - теперь она будет адаптивной под размер
			окна браузера. Также мы сделали подсветку полей, по которым возникли ошибки во время сохранения форм.
		</li>
		<li>
			На основной странице редактирования видео теперь возможно удаление скриншотов в случае их отображения
			(раньше была возможность только изменения главного).
		</li>
		<li>
			Пакет улучшений и исправлений по импорту и экспорту данных:<br/>
			- Появилась возможность отфильтровать данные экспорта по флагу проверки.<br/>
			- Появилась возможность экспорта исходных файлов видео для тех видео, у которых они хранятся.<br/>
			- Добавилась поддержка экспорта рейтинга в виде процента (0-100%), а также на импорте и экспорте
			  добавилась поддержка кол-ва голосов рейтинга.<br/>
			- Исправлена проблема с импортом и экспортом моделей, в именах которых есть запятые.<br/>
			- Исправлена проблема с некорректной сортировкой данных экспорта по рейтингу.<br/>
			- Оптимизировано использование памяти при экспорте данных.<br/>
			- В фидах экспорта появилась возможность делать фильтрацию поиском по строке. Для возможности ее
			  использания необходимо разрешить эту опцию в настройках фида, т.к. она может повлиять на
			  производительность базы данных. <br/>
			- В фидах экспорта исправлена проблема с некорректным выводом размеров embed кода для некоторых типов
			  видео.<br/>
		</li>
		<li>
			Плагин автоподбора моделей теперь будет учитывать и тэги контента при поиске имен моделей. До этого он
			учитывал только названия и описания.
		</li>
		<li>
			Появилась возможность ручной сортировки моделей для вывода на сайте в необходимом порядке.
		</li>
		<li>
			В блоке списка моделей (<b>list_models</b>) появилась возможность вывода похожих моделей по большому кол-ву
			доступных критериев (страна, город, возраст, пол, рост, вес, цвет глаз, цвет волос и др.).
		</li>
		<li>
			В блоке загрузки видео (<b>video_edit</b>) появилась возможность настроить, чтобы загруженный файл
			обрабатывался как файл формата, а не как исходный файл, чтобы исключить его обработку. Эта возможность
			требуется в особых случаях, когда для проекта важна необходимость быстрой загрузки множества видео в
			готовом формате. Это также может использоваться для создания отдельной страницы загрузки видео для
			вебмастеров, которые гарантированно будут грузить видео в нужном формате. В подавляющем большинстве случаев
			правильным будет стандартное поведение.
		</li>
		<li>
			В блоках редактирования видео, альбома и плэйлиста (<b>video_edit</b>, <b>album_edit</b>,
			<b>playlist_edit</b>) появилась отдельная опция для настройки деактивации контента при его изменении. Дело
			в том, что изначально в KVS была только одна опция (<b>force_inactive</b>), которая влияла как на новый
			контент, так и на измененный контент. Это приводило к тому, что любое изменение контента на сайте приводило
			к его деактивации (если, конечно же, эта опция была включена). Мы решили отказаться от этого подхода и
			добавить отдельную опцию настройки поведения на случай изменения контента (<b>force_inactive_on_edit</b>).
			После обновления новая опция будет выключена, это значит что изменение контента больше не будет приводить к
			его деактивации. Если для вас это критично, то после обновления вам необходимо включить новую опцию, чтобы
			измененный контент деактивировался.
		</li>
		<li>
			В блоке глобальной статистики сайта (<b>global_stats</b>) теперь можно выводить статистику по посещениям за
			день, неделю и месяц.
		</li>
		<li>
			При флаггировании контента вместе с сообщением теперь сохраняются дополнительные данные (IP, страна,
			браузер, адрес страницы).
		</li>
		<li>
			На списке пользователей, с которыми была переписка по месенджеру (режим <b>mode_conversations</b> блока
			<b>list_members</b>) теперь можно массово удалить переписки с несколькими пользователями, а также вывести
			последнее собщение из каждой переписки.
		</li>
		<li>
			Добавлен возможность вывода длительности видео в стандартном формате: HH:MM:SS. Исторически KVS выводил
			длительность в виде MM:SS, что для длинных видео могло приводить к виду MMM:SS. Для использования нового
			формата необходимо исправлять шаблоны сайта - это описано на форуме.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- В импорте контента если по всем строкам импорта возникли ошибки - импорт все равно мог быть запущен с
			  пустым набором данных, который зависал в задачах.<br/>
			- Редирект на случайное видео / альбом не учитывал некоторые настройки сателлитов.<br/>
			- Некритическая XSS уязвимость при использовании динамических HTTP параметров в настройках сайта.<br/>
			- При определении SAR параметра исходного видеофайла в некоторых случаях производилась бессмысленная
			  дополнительная его переконвертация с целью нормализации. Также исправилась логика нормализации для
			  увеличения производительности и снижения потери качества.<br/>
			- При использовании списка стоп-слов поиск контента мог приводить к пустому запросу (если запрос это и есть
			  стоп-слово) и по такому поиску выдавались все видео из базы.<br/>
			- При установленной опции open_basedir в конфиге PHP некорректно работали функции cURL.<br/>
		</li>
	</ul>
	<h3 id="section_whats_new_3_9_0">KVS v3.9.0 [24.11.2016]</h3>
	<ul>
		<li>
			Полностью новый HTML5 плеер заменяет старый флешевый плеер KVS. В новом плеере основным режимом является
			HTML5, флешевый компонент активизируется только в случае невозможности проигрывания текущего видео в HTML5
			режиме в браузере клиента (это либо устаревшие браузеры до IE9, либо использование вами FLV формата). Мы
			постарались максимально сохранить интерфейс плеера и все его старые возможности на месте, а также добавить
			новые.
		</li>
		<li>
			Новые возможности плеера:<br/>
			- Полный контроль над скином плеера через CSS3 и возможность подключать свои скины.<br/>
			- Поддержка предзагрузки метаданных видео (кроме мобильных телефонов) позволит ускорить начало проигрывание
			  для MP4 файлов.<br/>
			- Переключатель форматов теперь выглядит как иконка с возможным наложением HD для индикации HD форматов.<br/>
			- Добавлена поддержка попандера, который работает не через открытия нового окна браузера (что часто
			  блокируется плагинами-блокировщиками), а открывает рекламную страницу в исходной странице вашего сайта, в
			  то время как страница с плеером открывается повторно в новом окне и запускает автоматическое
			  проигрывание. Это даст прирост нагрузки, но увеличит конвертацию с попандерной рекламы.<br/>
			- Поддержка похожих видео в виде HTML с возможностью кастомизации верстки. Для работы похожих видео
			  необходимо вносить изменения в шаблоны сайта. Они не активируются автоматически с обновлением. Информация
			  о необходимых изменениях будет добавлена в FAQ.<br/>
			- Оптимизирована подстановка в плеер таймлайновых скриншотов, что позволит сэкономить лишний запрос на
			  Apache и снизить нагрузку.<br/>
		</li>
		<li>
			Старые возможности плеера, которые больше не будут поддерживаться:<br/>
			- Положение логотипа полосой снизу или сверху: эти опции невозможно воспроизвести для всех устройств.<br/>
			- Перемотка FLV файлов: мы не рекомендуем больше использовать FLV формат и рекомендуем полностью переходить
			  на MP4.<br/>
			- Реклама при наведении мыши: не имеет смысл для мобильных устройств.<br/>
			- Старый Javascript API плеера, который использовал отдельные функции со спец. названиями. Это может
			  привести к тому, что после обновления у вас перестанет работать ваша кастомизация плеера. Для
			  восстановления работоспособности ее необходимо переписать на новый API, который будет описан в FAQ.<br/>
			- Интеграция с рекламной сетью teasernet, в будущем она будет заменена на поддержку VAST.<br/>
			- Любые embed коды через flash больше не будут работать.<br/>
			- Если вы заменили плеер KVS на JW player, то в нем перестанут работать таймлайновые скриншоты.<br/>
		</li>
		<li>
			Добавлен новый тип защиты от хотлинка - защита по IP со 100% гарантией невозможности хотлинкования. Эта
			защита также не позволяет пользователям делиться прямыми ссылками на видеофайлы, т.к. ссылки будут работать
			только для того IP, с которого они получены. Минусом является то, что вы сами больше не сможете
			хотлинковать видеофайлы на других проектах, или если вы уже хотлинкуете - то не сможете использовать этот
			тип защиты. Старый тип защиты по рефереру сохранен, однако его надежность не очень высокая. После
			обновления защита останется работать по старому типу, чтобы перейти на новый тип защиты необходимо
			переключить опцию в настройках контента.
		</li>
		<li>
			Добавлена возможность шифрования ссылок в плеере, что позволит вам защититься от сторонних грабберов
			контента практически на 100%. Однако эта защита не будет распространяться на ссылки для скачивания, если вы
			позволяете пользователям скачивать видео - эти ссылки не используют плеер и поэтому не могут быть
			зашифрованы. Включить шифрование ссылок в плеере можно в настройках контента в разделе защиты видео.
		</li>
		<li>
			У видео появился HD флаг, который устанавливается автоматически при наличии у видео HD файлов. Благодаря
			ему на списках можно будет показывать HD индикатор, а также отфильтровывать только HD или наоборот только
			не-HD видео. После обновления у вас запустится фоновая задача на установку этого флага для всех видео.
		</li>
		<li>
			Для ротатора видео теперь можно включить собирание отдельной статистики по категориям и тэгам, что позволит
			одному и тому же видео иметь разные CTR в разных категориях (тэгах) и тем самым эффективность ротации будет
			выше. Это пока не распространяется на скриншоты; поддержка разных лучших скриншотов в разных категориях
			(тэгах) вероятно будет добавлена в ближайших версиях вместе с другими улучшениями по ротатору.
		</li>
		<li>
			При включенной ротации по каждому видео на странице редактирования можно посмотреть саммари по ротации
			этого видео - показы, клики, общий CTR и ранг, а также CTR отдельно по каждой категории (тэгу).
		</li>
		<li>
			Настройки ZIP архивов и доступа к исходным фотографиям альбомов были вынесены в список форматов альбомов как
			отдельный псевдо-формат. Теперь для исходных фотографий альбомов можно настроить изображение, которое будет
			показываться вместо фотографии при отсутствии у пользователя доступа к ней. Также можно удалить ZIP файлы
			исходных фотографий, если по каким-то причинам они вам больше не нужны.
		</li>
		<li>
			Добавлен плагин генерации пользователей с заранее заданным кол-вом дней премиум доступа или токенами. На
			выходе плагин даст вам список пар вида логин:пароль, которые вы можете продавать как цифровые товары в
			интернет магазинах. Это может быть использовано как альтернатива процессорам оплат для продажи премиум
			доступа.
		</li>
		<li>
			Добавлен плагин кастомной пост-обработки контента, который позволит легко добавить кастомную логику в
			обработку видео или альбомов без модификации движка. Данный плагин не будет установлен автоматически после
			обновления, при необходимости использовать его обратитесь в службу поддержки.
		</li>
		<li>
			В плагине синонимайзера можно установить фильтр на обрабатываемый контент - теперь можно настроить, чтобы
			синонимайзер включался только для видео из фидов или из грабберов, игнорируя остальные видео.
		</li>
		<li>
			На списке фидов импорта добавлена поддержка массовой активации / деактивации.
		</li>
		<li>
			Оптимизирована логика отправки статистики через JavaScript, что позволяет сократить кол-во запросов на
			Apache в среднем на 20-30%. Однако для активации этой поправки необходимо вручную обновлять JS файлы темы.
			Для новой темы это main.min.js, для обновления логики работы в старой теме обратитесь в службу поддержки.
		</li>
		<li>
			Для SEO-сателлитов можно настроить выборку дефолтовых названий объектов наряду с уникальным для сателлита
			названием.
		</li>
		<li>
			В блоках списка постов (<b>list_posts</b>) и просмотра поста (<b>post_view</b>) появилась возможность
			вывести информацию о привязанном к посту видео.
		</li>
		<li>
			В блоках списка видео (<b>list_videos</b>) и альбомов (<b>list_albums</b>) появилась возможность
			отфильтровать список по любому диапазону дат публикации, например видео за январь, видео за февраль и т.д.
			(параметры <b>var_post_date_from</b> и <b>var_post_date_to</b>).
		</li>
		<li>
			В блоке списка пользователей (<b>list_members</b>) добавлены несколько новых режимов: (а) пользователи, на
			которых подписан данный пользователь; (б) подписчики данного пользователя; (в) запросы на добавления в
			друзья для текущего пользователя. Кроме этого доступно несколько новых действий: массово отписаться от
			выбранных пользователей и массово подтвердить все запросы на добавления в друзья.
		</li>
		<li>
			В блоке информации о пользователе (<b>member_profile_view</b>) появилась возможность вывести сведения,
			является ли данный пользователь заблокированным у текущего пользователя, или заблокировал ли он текущего
			пользователя. Кроме этого в блоке появилась поддержка снятия блокировки.
		</li>
		<li>
			В блоке списка моделей (<b>list_models</b>) появилась возможность фильтрации по городу.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Грабберы могли в определенных случаях создавать дубликаты видео.<br/>
			- В плагине просмотра весовых матриц ротатора не отображалась информация по глобальным блокам.<br/>
			- В блоке регистрации при загрузке аватара пользователями в некоторых случаях они не сохранялись.<br/>
			- При загрузке исходных видеофайлов с размером более 4Gb их исходный размер некорректно сохранялся в базу
			  данных.<br/>
			- На некоторых операционных системах не работала многопоточность импорта и грабберов.<br/>
			- В плагине генерации аватаров категорий логика переписана таким образом, чтобы у тумб категорий не
			  оставалось черных полос.<br/>
		</li>
	</ul>
	<h2 id="section_whats_new_3_8">KVS v3.8</h2>
	<h3 id="section_whats_new_3_8_5">KVS v3.8.5 [04.08.2016]</h3>
	<ul>
		<li>
			Добавлен плагин грабберов видео и фото контента и к нему несколько грабберов для популярных
			сайтов-источников. Каждый граббер умеет получать максимально полную информацию о контенте, которая
			представлена на сайте и поддерживается в KVS (категории, модели, тэги, рейтинг, просмотры, дата
			добавления). В настройках граббера вы можете индивидуально для каждого граббера выбрать какие из этих
			данных вы хотите брать с сайта-источника. Также для грабберов видео можно выбрать режим добавления
			контента: скачать, embed код или псевдо-видео. В случае выбора опции скачивания вы сможете также выбрать
			наиболее подходящий формат (720p, 480p и т.д.), если сайт-источник поддерживает несколько форматов
			качества. В дополнение к грабберам конкретных сайтов поддерживаются также грабберы фото и видео по
			умолчанию, которые могут находить контент на любых сайтах, если ссылки на видео и фото контент находятся в
			HTML коде страницы в открытом виде. Функциональность таких грабберов ограничена - они могут только
			определять название, описание и собственно сам контент, т.к. они не привязаны к какой-либо структуре
			верстки. Подобные грабберы раньше использовались в KVS при импорте FHG галерей, теперь данная
			функциональность полностью заменена на использование грабберов.
		</li>
		<li>
			Почти все грабберы поддерживают возможность обрабатывать не только страницы отдельного контента, но и
			списки контента с постраничным переключением. Например, вы хотите добавить 1000 наиболее рейтинговых видео
			с какого-либо сайта-источника, теперь для этого вам нужно просто указать ссылку на первую страницу этого
			списка и цифру 1000 рядом - KVS будет идти по страницам списка до тех пор, пока не соберет 1000 ссылок на
			контент. В плагине грабберов есть отдельный упрощенный интерфейс импорта, где вы можете задавать как ссылки
			на индивидуальный контент, так и ссылки на различные списки контента с указанием требуемого кол-ва. Теперь
			вы сможете добавлять десятки тысяч контента в KVS самым простым образом. Вы можете указывать любые списки:
			по категориям, по поисковым словам, по любым сортировкам, прямо скопировав URL списка из браузера - если
			нужный граббер поддерживает списки - он добавит необходимое кол-во контента по вашим критериям.
		</li>
		<li>
			Плагин грабберов также поддерживает и функцию автопилота, которую вы можете настроить индивидуально для
			каждого граббера. Все то же самое, что можно сделать в ручном импорте - можно настроить на автопилоте. Вы
			можете воспользоваться ручным импортом для импорта первоначальной базы контента, а затем настроить
			автопилот по этим же спискам, чтобы он добавлял новый контент, который появится в них.
		</li>
		<li>
			Функциональность грабберов идет в режиме "бета", мы надеемся на ваше терпение и понимание в этом вопросе.
			Плагин грабберов поддерживает авто-обновление грабберов из нашего репозитория, а также возможность
			использования новых грабберов без обновления KVS - вы сможете использовать новые грабберы буквально сразу,
			как мы их добавим. Просьба обращаться в нашу службу поддержки, если вы хотите, чтобы мы добавили новые
			грабберы, либо если вы хотите, чтобы мы добавили граббер вашего сайта (например, с целью распространения
			своих embed кодов среди других наших клиентов). По этическим соображениям мы не будем добавлять грабберы
			сайтов, работающих на KVS, без запроса со стороны владельца.
		</li>
		<li>
			Полностью переработана система фонового импорта контента. Раньше каждый импорт приводил к запуску фонового
			процесса, который мог обрываться из-за глюка с библиотекой cURL в операционной системе. Сейчас при импорте
			запуски фоновых процессов происходят иначе, KVS контролирует работоспособность каждого процесса и если он
			обвалился, то процесс перезапускается самостоятельно. Кроме того, в настройках импорта вы можете сразу
			указать количество процессов, тем самым настроить параллельный импорт в один клик (в предыдущих версиях
			было необходимо вручную запускать несколько процессов импорта, чтобы они работали параллельно).
		</li>
		<li>
			Информация обо всех импортах (активных, завершенных) теперь доступна в разделе администрирования. Для
			каждого импорта можно посмотреть какие данные указывались при импорте, а также можно запустить импорт с
			такими же опциями в один клик.
		</li>
		<li>
			Добавлена интеграция с процессорами оплаты Yandex.Money, Robokassa и Paypal. Все процессоры поддерживают
			покупку токенов, Paypal также поддерживает триальный доступ.
		</li>
		<li>
			Появилась возможность дарения токенов от одного пользователя другому. Эту функциональность можно
			использовать как поддержку авторов видео посетителями, донэйт.
		</li>
		<li>
			В стоп словах добавилась поддержка маски через *, что позволяет указывать слова с частичным совпадением.
		</li>
		<li>
			В персональных настройках администратора теперь можно установить период отображения дат шедулера (на
			странице старта), а также выбрать сортировку - показывать последние либо ближайшие даты.
		</li>
		<li>
			Селекторы категорий и моделей в панели администрирования при поиске по синонимам больше не подставляют
			синонимы при выборе, подставляются только названия категорий и моделей. Это также позволило активировать
			поиск по синонимам в селекторе тэгов.
		</li>
		<li>
			При проверке нового контента добавилась защита по применению оцпии "также удалить другие непроверенные
			видео / альбомы от этого пользователя". Теперь эту опцию можно применять только максимум для 30 видео /
			альбомов, поскольку при некоторых условиях она может удалить всю базу контента, если он импортировался с
			флагом "требует проверки". Если вы все же захотите повысить лимит защиты - просьба связаться со службой
			поддержки.
		</li>
		<li>
			В фидах экспорта добавился параметр <b>skip</b>, который позволяет пропустить N видео с начала фида.
		</li>
		<li>
			В настройках сайта появилась опция, которая позволяет настраивать поведение неактивного контента при
			открытии его по прямым ссылкам. Ранее в KVS неактивный контент всегда был доступен по прямым ссылкам.
			Сейчас можно настроить, чтобы неактивный контент отдавал 404 ошибки, как будто его не существует.
			<b>ВНИМАНИЕ!</b> Это поведение теперь является поведением по умолчанию в новых инсталляциях.
		</li>
		<li>
			В сообщениях обратной связи теперь сохраняется больше метаданных - информация о браузере / устройстве
			пользователя, а также адрес страницы, с которой он открыл форму обратной связи.
		</li>
		<li>
			В блоке движения токенов по счету (<b>list_members_tokens</b>) добавилась поддержка фильтра по выплатам.
			Теперь пользователю можно показать список проведенных выплат и по каждой выплате вывести выплаченные
			награды. Эта функциональность также позволяет показать награды, которые еще не выплачены.
		</li>
		<li>
			В блоке списка пользователей (<b>list_members</b>) появилась возможность фильтрации по всем доп. полям
			пользователей.
		</li>
		<li>
			В блоках списка моделей (<b>list_models</b>) и контент провайдеров (<b>list_content_sources</b>) появилась
			поддержка сортировки по скриншотам, которая позволяет вывести в начале те объекты, у которых загружены
			скриншоты.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- В новых версиях ffmpeg некорректно определялся SAR исходного файла.<br/>
			- При удалении в админ панели контента, который был куплен пользователями, не происходило автоматического
			  обнуления покупки.<br/>
			- Проблема в сохранении схем импорта могла приводить к затиранию или изменению сохраненных схем.<br/>
			- Проблема в процессоре ccbill при разрешении транзакции после нескольких отказов.
		</li>
	</ul>
	<h3 id="section_whats_new_3_8_4">KVS v3.8.4 [15.05.2016]</h3>
	<ul>
		<li>
			Добавлена поддержка выплат заработанных токенов пользователям (пользователи могут зарабатывать токены
			продавая свой контент или получить их в награду за определенные действия).
		</li>
		<li>
			Добавлен новый блок <b>list_members_tokens</b>, который позволяет вывести движение токенов по счету
			пользователя (сколько было куплено токенов, сколько заработано, сколько потрачено, сколько выплачено). Блок
			поддерживает фильтрацию по датам и по типам записей.
		</li>
		<li>
			При удалении с сайта видео и альбомов, которые были куплены другими пользователями теперь вместо их
			удаления будет происходить деактивация. Также список купленных видео и альбомов теперь будет выводить и
			неактивный контент.
		</li>
		<li>
			Лог наград мемберзоны перенесен в раздел статистики.
		</li>
		<li>
			Упрощено создание серверов конвертации: теперь файл <b>remote_cron.php</b> будет копироваться автоматически,
			и новый сервер конвертации сам активируется как только вы включите крон. Для локальных серверов конвертации
			больше нет необходимости устанавливать крон вручную - это будут делать KVS.
		</li>
		<li>
			В альбомах теперь возможно управление обзорным изображением - загружать или заменять его в любое время.
			Раньше его можно было загружать только при создании альбома. Обзорное изображение используется для создания
			форматов группы просмотра, которые предназначены для списка альбомов.
		</li>
		<li>
			Появилась возможность кастомизировать watermark изображения видео через написание своей PHP логики.
		</li>
		<li>
			Теперь работать с языковыми файлами темы можно через панель администрирования в нескольких вариациях: можно
			работать с текстовыми файлами целиком, можно работать с отдельными записями.
		</li>
		<li>
			В новых инсталляциях KVS добавлена отдельная страница настроек темы, которая позволяет быстро настроить
			основные опции темы, а также получить информацию по настройкам основной функциональности (комментарии,
			загрузка контента, регистрация, логин). Мы надеемся, что эта страница позволит намного быстрее разобраться
			с первоначальной настройкой темы без необходимости разбираться в дебрях движка сайта.
		</li>
		<li>
			Селекторы категорий и моделей в панели администрирования теперь поддерживают отображение синонимов и поиск
			по ним.
		</li>
		<li>
			Проверка отдачи с серверов хранения теперь умеет самостоятельно проверять форматы, доступ к которым закрыт
			от незарегистрированных пользователей.
		</li>
		<li>
			Добавлена поддержка встроенной транслитерации спецсимволов для основных европейских языков при генерации
			директорий объектов. Ранее при включении транслитерации было необходимо вручную задавать правила
			транслитерации. Теперь же их можно оставить пустыми, чтобы работали правила транслитерации по умолчанию.
		</li>
		<li>
			В настройках форматов видео теперь можно ограничить скорость только для определенных стран. По сути это
			можно рассматривать как блокировку определенных стран, сохраняя при этом работоспособность всего сайта.
		</li>
		<li>
			В массэдите видео добавлена возможность массово заменить указанный формат видео на загруженный файл. Замена
			видеофайла на видеофайл-заглушку может использоваться как возможность не удалять видео целиком, если
			поступил такой запрос от правообладателей. В таком случае страница с видео останется рабочей, но
			пользователи будут видеть видеофайл-заглушку вместо оригинала. Создать видеофайл-заглушку можно при помощи
			специального плагина в KVS.
		</li>
		<li>
			В импорте видео и альбомов стало возможным использовать файловые пути вместо ссылок. Например, весь контент
			находится где-то на вашем сервере и чтобы импортировать его, раньше требовалось указывать web-ссылки на эти
			файлы. Теперь можно указывать и пути к файлам в том числе.
		</li>
		<li>
			Фоновые процессы массэдита теперь можно наблюдать в списке фоновых задач.
		</li>
		<li>
			В настройках форматов альбомов появилась возможность выключить применение кропа для определенного формата.
		</li>
		<li>
			Добавлена функциональность для ускорения обработки спама при проверке новых видео и альбомов, загруженных с
			сайта. Так, теперь во время проверки можно сразу удалить видео / альбом и выбрать дополнтельные действия
			анти-спама: заблокировать пользователя, заблокировать его IP или маску IP, заблокировать домен его email-а,
			удалить все другие новые видео / альбомы от этого пользователя. В дополнение к этому теперь можно управлять
			списком заблокированных IP / масок IP и email-ов в разделе настроек мемберзоны.
		</li>
		<li>
			В отладчике сайта стали доступны текстовые данные из языковых файлов.
		</li>
		<li>
			В настройках процессора NATS появилась возможность поддержки триалов как не-премиум пользователей в KVS.
			Это позволит вам настраивать отдельные ограничения для триальных пользователей. Также возможно установить
			назначение токенов триальным пользователям, чтобы можно было ограничить кол-во контента, к которому у них
			есть доступ. В этом случае триальные пользователи смогут получить доступ только к тому контенту, на который
			потратят токены.
		</li>
		<li>
			В настройках плеера при включении защиты от adblock теперь возможно использовать токен <b>%POSTER_URL%</b>,
			который заменится на постер видео.
		</li>
		<li>
			В плагине загрузки контента по FTP появилась возможность указать статус контента после обработки. До этого
			импортируемый контент создавался всегда в неактивном статусе.
		</li>
		<li>
			В экспорте контента добавилась поддержка фильтра по владельцу-администратору.
		</li>
		<li>
			В блоке загрузки видео с сайта теперь стало возможным загружать видео как embed коды. Эта возможность
			включается в настройках блока <b>video_edit</b>, по умолчанию она выключена. Вы также можете указать список
			доменов, с которых разрешено вставлять embed коды.
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> появилась возможность настроить поведение поиска в случае,
			когда ничего не найдено. По умолчанию блоки будут отображать пустые списки. Вы можете использовать новые
			параметры, чтобы настроить отдачу 404 ошибки, либо 302 редиректа на другую страницу.
		</li>
		<li>
			Обновленная версия темы включает поддержку немецкого, французского, итальянского, испанского,
			португальского, турецкого, китайского и японского языков.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- При одновременной работе нескольких фидов по одному источнику могли добавляться дубликаты.<br/>
			- Не происходил логаут пользователя при его удалении из базы. Если пользователь был в этот момент залогинен
			  - то его сессия оставалась рабочей.<br/>
			- В HTML рекламе плеера могла возникать проблема с отображением спец. символов.<br/>
			- В случае запуска задач по созданию условно-обязательных форматов видео на главном сервере скапливались
			  мусорные файлы.<br/>
			- При большом кол-ве задач определенных типов не работала установка приоритета задач.<br/>
			- При использовании кнопки "Сохранить и след." в некоторых ситуациях происходил перескок через один
			  объект.<br/>
			- Владелец контента мог не иметь доступа к файлам своего контента.<br/>
			- Фид импорта в формате smartscripts не поддерживал embed коды.
		</li>
	</ul>
	<h3 id="section_whats_new_3_8_3">KVS v3.8.3 [13.01.2016]</h3>
	<ul>
		<li>
			Экстренная версия с поправками по нейтрализации уязвимости библиотеки ffmpeg в обработке HLS видеофайлов.
			Для лучшей безопасности рекомендуется пересобрать библиотеку ffmpeg с такими опциями:
			<span class="code">
			--disable-demuxer='hls,applehttp'
			--disable-network
			</span>
		</li>
	</ul>
	<h3 id="section_whats_new_3_8_2">KVS v3.8.2 [22.12.2015]</h3>
	<ul>
		<li>
			В панели администрирования переработаны все списки в разделах записей, мемберзоны и каналов / сериалов.
			Теперь на них можно выбирать столбцы для отображения, улучшены наборы фильтров.
		</li>
		<li>
			Изменилась терминология постов: теперь они называются "записи". В разделе записей в боковом меню панели
			администрирования появились отдельные списки для записей разных типов, где каждый список можно настроить
			по-разному. Для того, чтобы эта поправка вступила в силу необходимо в файле <b>/admin/.htaccess</b>
			добавить такое правило:
			<span class="code">
			RewriteRule ^posts_for_(.*)\.php$ posts_for_types.php?post_type_external_id=$1 [L,QSA]
			</span>
		</li>
		<li>
			Изменилась концепция поиска объектов в панели администрирования. Теперь на большинстве списков при поиске
			будет возможность выбрать по каким полям данных должен идти поиск.
		</li>
		<li>
			Добавлена поддержка аггрегатора платежных систем pay2pay.com.
		</li>
		<li>
			В фидах импорта теперь появилась возможность запрещать добавлять видео с названиями, которые уже есть.
			Также для каждого фида теперь можно разрешить добавлять видео, которые были ранее добавлены и затем
			удалены. Ранее фиды импорта никогда повторно не добавляли видео, которые были удалены, и этот вопрос
			решался только изменением префикса дубликатов.
		</li>
		<li>
			Добавлен плагин мигратора данных, который позволяет легко и быстро подключать миграторы для переноса данных
			с других сайтов на KVS. В том числе он может использоваться для миграции категоризации из другого проекта
			на KVS, чего раньше в принципе не было возможности сделать. На текущий момент, написано уже несколько
			миграторов под другие скрипты. Если у вас есть проекты на скриптах, которые больше не поддерживаются и не
			развиваются, мы можем легко добавить мигратор под них и перенести ваш проект на KVS.
		</li>
		<li>
			Изменился подход к формированию сборок для разных пакетов функциональности: теперь для базовых пакетов KVS
			вместо отсутствующих блоков создаются полностью работоспособные блоки-заглушки. Для новых тем это будет
			позволять использовать шаблоны тем без удаления из них части функционала, который не поддерживается текущим
			пакетом KVS, просто выключая этот функционал в настройках темы. Таким образом при апгрейде на старший пакет
			KVS, тема будет иметь полный функционал без каких-либо дополнительных действий.
		</li>
		<li>
			Улучшение рекламных возможностей плеера. Теперь по всей HTML рекламе из настроек плеера собирается
			статистика показов и кликов. Также для HTML рекламы появилась возможность настроить цвет фона подложки
			(раньше всегда был черный), сделать рекламу адаптивной относительно размеров плеера.
		</li>
		<li>
			В настройках плеера появилась возможность не показывать плеер для пользователей с включенным Adblock
			плагином, вместо плеера показывать фиксированный HTML фрагмент с просьбой выключить плагин. Обратите
			внимание, что некоторые сторонние поставщики рекламы (exoclick и т.д.) могут блокироваться автоматически,
			если рекламный код содержит ссылку на их сайт. Рекомендуем проверять это и обращаться в поддержку
			поставщиков рекламы, быть может у вас стоит устаревший рекламный код.
		</li>
		<li>
			В настройках embed плеера появилась возможность задать отдельный шаблон для случая, когда видео еще
			находится в обработке или было удалено. Раньше в этом случае embed код всегда выдавал 404 ошибку.
		</li>
		<li>
			В группы каналов (сериалы) добавлена поддержка доп. полей.
		</li>
		<li>
			В панели администрирования появилась возможность ручной сортировки видео в плэйлистах, серий в сезонах,
			сезонов в сериалах.
		</li>
		<li>
			Для плэйлистов добавлена возможность задать паттерн страницы плэйлиста на сайте.
		</li>
		<li>
			В экспорте видео и альбомов теперь можно экспортировать ZIP архивы для тех форматов скриншотов / альбомов,
			для которых включено их создание.
		</li>
		<li>
			В плагине аудита расширены возможности проверки контента: у видео теперь добавилась проверка
			работоспособности embed кодов (только для тех кодов, где возвращается 404 ошибка) и хотлинкованных файлов,
			появилась проверка наличия всех файлов других объектов (записи, категоризация, пользователи).
		</li>
		<li>
			В плагине резервного копирования появилась возможность не делать копию контента при автоматическом создании
			резервных копий.
		</li>
		<li>
			В мониторинге производительности страниц сайта теперь собирается информация по использованию памяти для
			генерации страницы.
		</li>
		<li>
			В настройках администраторов KVS появилась опция для ограничения их доступа только к неактивному контенту.
		</li>
		<li>
			В ручных транзакциях биллинга теперь можно указывать описание транзакции.
		</li>
		<li>
			Обратная связь теперь поддерживает тему сообщения, которая будет использоваться в теме ответа по email.
		</li>
		<li>
			В блоках просмотра видео (<b>video_view</b>) и альбома (<b>album_view</b>) стало доступно значение флага
			администратора видео или альбома.
		</li>
		<li>
			В блоках просмотра контент провайдера (<b>content_source_view</b>), модели (<b>model_view</b>) и канала /
			сезона сериала (<b>dvd_view</b>) добавлена проверка корректности передаваемой директории и 301 редирект на
			исправленную ссылку, в случае некорректной директории. Также в этих блоках появились параметры для выборки
			предыдущих и следующих объектов.
		</li>
		<li>
			В блоках списка категорий (<b>list_categories</b>) и моделей (<b>list_models</b>) добавились параметры,
			которые позволяют разрешить выборку дубликатов видео и альбомов в случае использования такой выборки для
			каждого элемента категории или модели в списке. Ранее дубликаты всегда исключались, что могло приводить к
			пустым выборкам связанных видео или альбомов для некоторых элементов списка.
		</li>
		<li>
			В блоке списка плэйлистов (<b>list_playlists</b>) появилась возможность выводить список "похожих"
			плэйлистов к текущему видео - по сути список плэйлистов, в которых присутствует данное видео.
		</li>
		<li>
			В блоке подписок пользователя (<b>list_members_subscriptions</b>) появилась возможность отфильтровать
			список по типу подписки: на модели, на контент провайдеры, на пользователей и т.д.
		</li>
		<li>
			В отладчике сайта теперь отображаются и переменные, которые содержат пустое значение. Раньше переменные с
			пустыми значениями не выводились.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Снято ограничение максимальной длительности видео в 4 часа.<br/>
			- В экспорте видео и фидах экспорта в поле описания теперь переносы строк заменяются на пробелы.<br/>
			- После версии 3.8.1 в плагине резервного копирования перестали удаляться старые копии.<br/>
			- В фидах импорта к видео с пустыми категориями могли приписываться категории предыдущего видео.<br/>
			- Длительность видео не обновлялась в некоторых случаях после пересоздания или загрузки файла формата.<br/>
			- Загрузка файлов по ссылке могла не работать с некоторыми сборками библиотеки wget.<br/>
			- В статистике некорректно работали ссылки на детализацию по реферерам.<br/>
			- У записей не обновлялась дата последнего просмотра.<br/>
			- Движок конвертации перестал выдавать ошибку в случае если не удавалось создать формат видео с указанными
			  ограничениями длительности, вместо этого он теперь создает с максимально возможной длительностью.<br/>
			- Ложные ошибки в плагине аудита, если скрипт управления CDN возвращал ссылки без указания протокола.<br/>
			- Не работала комбинация Command+S для сохранения форм на MacOS.<br/>
			- В плеере при включении автопроигрывания панель управления не пряталась сама, пока не навести мышку.<br/>
			- В случае использования полнотекстового поиска по видео и альбомам не работал поиск по доп. полям.
		</li>
	</ul>
	<h3 id="section_whats_new_3_8_1">KVS v3.8.1 [10.08.2015]</h3>
	<ul>
		<li>
			Добавлена возможность платного голосования за флаги. Теперь для каждого флага вы можете настроить сумму в
			токенах, которую пользователь должен потратить, чтобы использовать этот флаг для голосование за видео,
			альбом или другие объекты.
		</li>
		<li>
			Добавлена поддержка 5 доп. текстовых полей для тэгов. Необходимо учитывать, что в случае склейки нескольких
			тэгов путем их переименования, информация из доп. полей одного из тэгов может потеряться.
		</li>
		<li>
			Значительно переработана система внутренних сообщений. Теперь можно вывести список пользователей, с
			которыми текущий пользователь ведет переписку (параметр <b>mode_conversations</b> у блока
			<b>list_members</b> включает данный режим). В этом списке можно вывести также общее число сообщений с
			каждым из пользователей и число непрочитанных. Появилась возможность ставить любых пользователей в игнор,
			тогда сообщения от них не будут показываться. Кроме этого можно сделать внутреннюю переписку платной, чтобы
			пользователям было необходимо потратить токены для отправки сообщения кому-либо.
		</li>
		<li>
			В настройках FTP серверов хранения и конвертации появилась возможность указать таймаут FTP соединения.
			Также проведена оптимизация с целью сокращения кол-ва создаваемых FTP соединений.
		</li>
		<li>
			С этой версии мы начали большой постепенный пересмотр юзабилити панели администрирования. Пока что основные
			изменения коснулись только раздела категоризации, где на всех списках появилась возможность галочками
			выбрать набор отображаемых столбцов, а также улучшилась система фильтров. Так, везде появился фильтр по
			данным, который позволяет отфильтровать объекты с любым пустым или заполненным полем. В новых версиях мы
			распространим похожую систему фильтров и выбора столбцов на все списки.
		</li>
		<li>
			В настройках контента появилась возможность задать лимит оперативной памяти для фоновых системных
			процессов, таких как обработка контента, импорт, фиды.
		</li>
		<li>
			В настройках контента появилась опция, которая позволит вам запретить добавление видео с дубликатами
			исходных файлов. Опция может учитывать не только текущие видео, но также и удаленные видео. Однако эта
			опция начнет работать только с новым контентом, который будет добавлен после обновления.
		</li>
		<li>
			В настройках контента для видео, альбомов и постов добавились опции, которые запрещают сохранение контента
			с дубликатами названия. Эти опции влияют только на работу в панели администрирования.
		</li>
		<li>
			Работа на списках видео и альбомов с утверждением нового контента стала немного легче. Теперь активация
			контента сбрасывает флаг необходимости проверки (до этого сбросить флаг проверки можно было только для
			каждого объекта по отдельности). Также в массовых операциях появились опции массовой активации выбранных с
			удалением остальных неактивных объектов и удаления выбранных с активацией остальных неактивных объектов, по
			аналогии с комментариями. Только теперь удаление неактивных объектов происходит не по всей базе, а их тех,
			которые выводятся в данный момент на странице.
		</li>
		<li>
			На списке пользователей появилась возможность быстро залогиниться под любым пользователем.
		</li>
		<li>
			В настройках защиты отдачи видео появилась возможность указать список белых доменов, с которых разрешен
			хотлинк ваших видеофайлов.
		</li>
		<li>
			Выбор канала видео сменился со стандартного выпадающего списка на компонент выбора по подстроке.
		</li>
		<li>
			В фидах импорта в настройках CSV добавилась возможность указывать канал.
		</li>
		<li>
			Несколько расширен плагин резервного копирования. Во-первых, копия настроек embed плеера теперь создается
			отдельной опцией, а не совместно с копией дизайна сайта. Копия дизайна сайта зачастую используется для
			переноса дизайна между разными проектами и настройки embed плеера там не к месту. Во-вторых, появилась
			возможность делать копию файлов вспомогательного контента, не связанных с видео или альбомами (посты,
			категории, аватары пользователей и др.)
		</li>
		<li>
			Плагин генерации аватаров в целях оптимизации больше не будет перегенерировать аватары для категорий, в
			которых они не изменились с момента прошлой генерации.
		</li>
		<li>
			Плагин автоматической очистки кэша теперь вычисляет максимальный возраст файлов кэша, после которого их
			нужно удалять. До этого всегда удалялись файлы старше 5 дней. Это позволит сократить кол-во мусорных файлов
			кэша.
		</li>
		<li>
			Добавлена поддержка биллинга Verotel.
		</li>
		<li>
			В скриптах редиректа на случайное видео или альбом добавилась возможность передать категорию через ее айди
			или директорию. Кроме этого, в редирект теперь будут добавляться любые дополнительные параметры, переданные
			этим скриптам.
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> добавлен параметр <b>skip_with_admin_flag</b>, который
			позволяет исключить из блока вывод контента с определенным флагом администратора.
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> теперь будет работать фильтрация по пользователю без
			включения режима <b>mode_uploaded</b>.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Не работал просмотр различных изображений в панели администрирования, если расширения загруженных файлов
			  были заданы в большом регистре.<br/>
			- В настройках фидов импорта выбранные доп. поля отображались с пустым названием.<br/>
			- В блоке <b>post_view</b> параметр <b>show_next_and_prev_info</b> не ограничивался типом текущего
			  поста.<br/>
			- В фидах импорта видео для видео с пустым названием генерировалась непустая директория.<br/>
			- В блоке загрузки видео с сайта не было возможности указывать год выпуска.<br/>
			- При переносе контента на другую группу серверов хранения задачи завершались с ошибками, если файлы были
			  заменены вручную на жестком диске.<br/>
			- Попытка восстановления пароля сразу после регистрации приводила к невозможности активации профиля по
			  отправленной ссылке.<br/>
			- В некоторых случаях при перезапуске фоновых задач обработки новых видео повторное выполнение задач было
			  невозможным.<br/>
			- В случае частых проблем с подключением к серверам хранения на серверах конвертации могли скапливаться
			  мусорные папки с видеофайлами.<br/>
			- В папках FTP серверов хранения или конвертации могли скапливаться текстовые файлы вида
			  test-[число].dat.<br/>
			- Отладчик сайта при определенной конфигурации блоков на странице мог постоянно перенаправлять на индекс
			  сайта.<br/>
			- Внесены некоторые логические исправления в обработчики биллингов NATS и EPOCH.
		</li>
	</ul>
	<h3 id="section_whats_new_3_8_0">KVS v3.8.0 [01.05.2015]</h3>
	<ul>
		<li>
			Каналы и группы каналов теперь можно официально переименовать в сериалы и работать с ними более удобно. Для
			этого в файле <b>/admin/include/setup.php</b> необходимо перевести опцию <b>dvds_mode</b> в значение
			<b>series</b>. Это позволит добавлять сезоны прямо во время создания / редактирования сериала, а также в
			редакторе сезонов привязывать серии к ним.
		</li>
		<li>
			Каналы / DVD и их группы, сериалы и сезоны сериалов стали поддерживать полную категоризацию: категории,
			тэги и модели.
		</li>
		<li>
			Модели и контент провайдеры стали поддерживать частичную категоризацию: категории и тэги. При импорте
			контента можно настроить, чтобы категории моделей добавлялись к контенту, так же как это работало для
			контент провайдеров раньше.
		</li>
		<li>
			Добавлена возможность привязать настройки кропа скриншотов и альбомов к доп. полям контент провайдеров.
			Таким образом, можно задать различные настройки кропа для контента из разных источников (обрезать
			ватермарк, например).
		</li>
		<li>
			В настройках форматов скриншотов и альбомов теперь можно включить создание изображений с прогрессивной
			загрузкой, а также указание комментария (копирайта) для хранения в метаданных.
		</li>
		<li>
			Расширены возможности массовой фильтрации контента на списках по каким-то критериям. Поправка позволяет
			отфильтровать из отображения на сайте контент практически по любым критериям путем использования доп.
			флагов. Значения флагов устанавливаются по крону исходя из заданной логики, сайт отфильтровывает контент
			исходя из значения флага. Это особенно актуально для сателлитов, когда несколько сайтов выводят контент из
			одной базы, и на некоторых сайтах выводится только часть контента. Такая фильтрация легко настраивается и
			работает исключительно быстро, в отличие от возможностей, которые были доступны ранее.
		</li>
		<li>
			В импорте и фидах импорта появилась возможность указать ограничение по кол-ву слов или символов в названии,
			по которому будет происходить обрезание.
		</li>
		<li>
			В настройках контента появилась возможность установить критерии, при которых разрешен запуск фоновых задач:
			максимальный LA сервера и временной интервал в сутках. Таким образом, можно настроить чтобы сервер запускал
			фоновые задачи только в моменты минимальной загрузки.
		</li>
		<li>
			В настройках плеера теперь можно включить автоматическое масштабирование импортированных embed кодов до
			нужного размера. Это позволит импортировать embed коды любых размеров, которые будут автоматически
			расширяться до настроенного размера вашего дизайна.
		</li>
		<li>
			В настройках мемберзоны теперь можно разрешить пользователям указывать стоимость загружаемых видео и
			альбомах в токенах. При покупке доступа к таким видео или альбомам другими пользователями, их авторам будет
			начисляться процент от стоимости в виде части токенов. Это позволяет реализовать партнерку среди авторов
			контента.
		</li>
		<li>
			Оптимизация проверки работоспособности базы - теперь проверки не создают никакой нагрузки.
		</li>
		<li>
			В механизм скачивания различных файлов движком добавлено несколько улучшений. Во-первых, после скачивания
			файла проверяется его размер на соответствие размеру в заголовках и при несовпадении происходит повторная
			попытка. Во-вторых, скачивание с локальных ссылок (ссылок на свой же домен) заменяется на копирование
			файлов по файловой системе, что позволяет значительно оптимизировать этот процесс.
		</li>
		<li>
			Фиды импорта теперь можно запускать с минутной частотой. До этого минимальной частотой был 1 час.
		</li>
		<li>
			В импорте видео или альбомов теперь разрешен импорт с частично нерабочими ссылками на скриншоты или
			фотографии. В этом случае при проверке импорта появится предупреждение о частично недоступных файлах (если
			опция проверки не выключена). Такая же поправка реализована в фидах импорта видео.
		</li>
		<li>
			В импорте и фидах импорта появилась возможность запретить создание новых объектов категорий, моделей и
			контент провайдеров на основе данных импорта. Это может быть полезно, если ваши данные импорта содержат
			много мусорной информации по категоризации, которую вы не хотите пропускать.
		</li>
		<li>
			Фидам экспорта теперь можно разрешить вывод еще не опубликованного контента.
		</li>
		<li>
			Появилась возможность привязывать посты к видео. Это можно использовать для привязки различного
			вспомогательного и текстового контента к видео, например, рецензии на фильмы.
		</li>
		<li>
			В списках видео и альбомов в панели администрирования появилась возможность включить отображения флага
			администратора.
		</li>
		<li>
			В массовом редактировании видео и альбомов появилась возможность установить администратора контента
			случайным образом из указанного списка.
		</li>
		<li>
			В embed кодах добавилась возможность указывать автозапуск и скин плеера через параметры embed коду. Embed
			коды с прописанными параметрами можно получить через экспорт видео, а также из фидов экспорта. Для работы
			этой поправки необходимо внести изменения в шаблон embed кодов. Для этого просьба связаться со службой
			поддержки.
		</li>
		<li>
			В плагине резервного копирования создание еженедельной резервной копии перенесено с ВС на ПН.
		</li>
		<li>
			В плагине анализа лога аудита добавился период для прошедшего месяца в привязке к датам начала и конца.
		</li>
		<li>
			При ответе на сообщение обратной связи теперь сохраняется тема ответа и цитируется исходное сообщение.
		</li>
		<li>
			После удаления пользователя теперь все его комментарии переводятся на анонимного, а не удаляются.
		</li>
		<li>
			Значительно оптимизировано отображение списка друзей пользователя.
		</li>
		<li>
			В блоке регистрации появилась возможность выключить каптчу.
		</li>
		<li>
			В блоках <b>list_dvds_groups</b> и <b>list_dvds</b>, которые также используются для вывода сериалов и их
			сезонов, появилась возможность поиска и фильтрации по алфавиту.
		</li>
		<li>
			В различных блоках-списках категоризации добавлено некоторое кол-во новых параметров для улучшенной
			фильтрации. В моделях появилась возможность фильтрации по стране, цвету волос и глаз.
		</li>
		<li>
			Добавилась поддержка сортировки видео и альбомов по доп. полям.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Проверки безопасности позволяли админам заменять скриншоты через ручной граббинг при отсутствии доступа к
			  конкретным видео.<br/>
			- Если в блоках <b>list_videos</b> / <b>list_albums</b>, которые отображали результаты поиска, был выключен
			  параметр <b>var_from</b>, то кол-во найденных результатов не сохранялось для поисковых запросов.<br/>
			- Проверка работоспособности серверов хранения использовала последний добавленный контент (видео или
			  альбом), и в случае использования CDN могла постоянно сообщать об ошибке, т.к. контент еще не успевал
			  загрузиться на сервера CDN.<br/>
			- При загрузке вертикальных видео в новой теме превью скриншот не переворачивался.<br/>
			- Попытка пагинации при псевдо-случайной сортировке приводила к отображению пустого списка.<br/>
			- В новой концепции embed кодов не работала передача партнерских рефов на страницы видео на своем сайте.<br/>
			- В фидах импорта при импорте премиум видео не учитывался формат, если был выбран.<br/>
			- В фидах импорта не совсем корректно работала установка серверного времени для импортированных видео.<br/>
			- В блоке <b>list_videos</b> при использовании плагина внешнего поиска не срабатывали опции
			  <b>show_xxx_info</b>.<br/>
			- Исправления в граббере галерей.
		</li>
	</ul>
	<h2 id="section_whats_new_3_7">KVS v3.7</h2>
	<h3 id="section_whats_new_3_7_0">KVS v3.7.0 [21.01.2015]</h3>
	<ul>
		<li>
			Значительно расширена функциональность плэйлистов. Теперь плэйлистами можно полностью управлять из панели
			администрирования. Со стороны сайта добавлены блоки <b>playlist_view</b> и <b>playlist_comments</b>,
			которые позволяют организовать полноценную страницу просмотра плэйлиста на сайте с рейтингом, флагами,
			популярностью и комментариями. Добавлена поддержка тэгов и категорий в плэйлисты, а также возможность
			подписки на плэйлисты.
		</li>
		<li>
			В настройках UI сайта добавлены настройки доступа к премиум и личным видео. До этого личные видео были
			доступны только для друзей пользователя, а премиум видео были доступны для всех, предполагая, что только
			премиум пользователи могут иметь доступ к "полным" форматам премиум видео. Теперь же это можно настроить и
			сделать, например, чтобы личные видео были доступны для всех залогиненных пользователей, а не для друзей.
		</li>
		<li>
			Добавилась поддержка комментариев к постам.
		</li>
		<li>
			Оптимизирована работа движка конвертации в некоторых случаях, когда исходные видеофайлы загружаются без
			необходимости конвертации и одновременно загружаются скриншоты. Ранее движок создавал форматы скриншотов на
			главном сервере, теперь же он будет создавать их на сервере конвертации, что позволяет значительно снизить
			нагрузку на главный сервер при таком способе загрузки контента.
		</li>
		<li>
			В настройках контента появились опции для настройки смещения с конца видео при создании скриншотов, а также
			номер скриншота, который следует выбрать главным по умолчанию (раньше всегда выбирался 1 скриншот).
		</li>
		<li>
			Возможность задать максимальный % ватермарка добавилась также и в форматы альбомов по аналогии с форматами
			видео.
		</li>
		<li>
			В импорте и массовом редактировании появилась возможность задать диапазон рандомизации времени публикации,
			что полезно если вы хотите заставить контент появляться в определенном интервале времени суток.
		</li>
		<li>
			Плагин генерации аватаров категорий теперь может использовать альбомы для создания аватаров, а также
			поддерживает возможность указать опции кропа.
		</li>
		<li>
			В плагине FTP загрузки добавилась возможность включить удаление обработанных исходных данных, что позволяет
			ускорить процедуру копирования исходных файлов в движок за счет их переименования.
		</li>
		<li>
			Появилась возможность отфильтровать контент, по которому были найдены ошибки при аудите (например,
			отсутствие обязательных файлов).
		</li>
		<li>
			Небольшая смена терминологии в панели администрирования - раздел Пользователи теперь называется Мемберзона.
		</li>
		<li>
			Добавилась поддержка создания комментариев из панели администрирования. Их можно добавлять через
			контекстное меню объектов, которые поддерживают комментарии, а также через контекстное меню самих
			комментариев.
		</li>
		<li>
			Добавилась поддержка биллинга vendo.
		</li>
		<li>
			В фидах экспорта появилась возможность фильтрации по локали, а также получения языковых версий ссылок на
			страницы с учетом сателлитов. Таким образом при использовании локали в фильтрах можно заставить фид
			отдавать только видео с переведенными на этот язык названиями, со всеми переведенными связанными данными, и
			со ссылками на языковой сателлит.
		</li>
		<li>
			В различных блоках сайта оптимизирована выборка видео и альбомов через параметры <b>pull_videos</b> /
			<b>pull_albums</b>.
		</li>
		<li>
			В блоке логина появилась возможность вывести отдельное сообщение об ошибке для пользователя, который был
			деактивирован.
		</li>
		<li>
			В блоках <b>video_view</b> и <b>album_view</b> расширено применение параметра
			<b>show_next_and_previous_info</b>. Этот параметр предназначен для возможности вывести ссылки на следующее
			и предыдущее видео или альбом и раньше всегда работал по дате публикации объекта. Теперь в параметре можно
			настроить, чтобы предыдущий и следующий объекты выбирались с учетом совпадения контент провайдера, а для
			видео - еще и канала.
		</li>
		<li>
			Для видео и альбомов добавлены сортировки по кол-ву покупок за токены, а также эту информацию можно вывести
			в блоках просмотра.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- FTP таймаут снижен до 10 секунд, что позволит избежать долгих зависаний движка конвертации, если
			  произошел обрыв связи.<br/>
			- В фильтрах по датам публикации в панели администрирования дата "до" не включалась в интервал, теперь
			  включается.<br/>
			- При редактировании контента была доступна возможность создавать новые категории и модели, даже если у
			  администратора не было включено данных привилегий.<br/>
			- В ротаторе неправильно считался критерий завершенности, для кликов, которые происходили в блоках с
			  включенной опцией отображения лучших скриншотов.<br/>
			- Проблемы с просмотром embed кодов в панели администрирования.
		</li>
	</ul>
	<h2 id="section_whats_new_3_6">KVS v3.6</h2>
	<h3 id="section_whats_new_3_6_0">KVS v3.6.0 [22.09.2014]</h3>
	<ul>
		<li>
			Протестирована работа KVS под HTTPS и внесены необходимые поправки. Рекомендуем рассмотреть возможность
			запуска новых проектов полностью под HTTPS, что может улучшить позиционирование в поисковых системах.
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> сделаны значительные доработки:<br/>
			- Переписана логика динамических фильтров (по категории, по тэгу и т.д.), что позволило значительно
			  увеличить скорость их работы. Разница в скорости особенно будет заметна на проектах с большим кол-вом
			  контента (от 50 тыс и выше).<br/>
			- Добавлена поддержка динамических фильтров по списку тэгов, моделей, контент провайдеров и др., как это
			  было ранее доступно только по списку категорий. За это отвечают новые параметры <b>var_tag_ids</b>,
			  <b>var_model_ids</b>, <b>var_content_source_ids</b> и др.<br/>
			- Добавлена возможность показать похожие видео или альбомы по пользователю, т.е. вывести другие видео или
			  альбомы, созданные пользователем текущего видео или альбома.<br/>
			- Добавлена возможность показать только видео или альбомы от определенных пользователей или моделей, либо
			  наоборот, исключить видео или альбомы от определенных пользователей или моделей.<br/>
			- Добавлена поддержка динамической сортировки результатов поиска по всем поддерживаемым сортировкам. Ранее
			  в случае использования метода поиска по полнотекстовому индексу сортировка всегда форсировалась по
			  релевантности.
		</li>
		<li>
			В конфиге языковых сателлитов теперь можно включить фильтрацию по переведенному контенту. Это позволит
			выводить только те видео и альбомы, которые имеют перевод названия для текущей локали (наличие или
			отсутствие перевода описания игнорируется).
		</li>
		<li>
			В конфиге языковых сателлитов теперь можно также включить выборку директорий для всех языков. Это требуется
			чтобы корректно перелинковать страницы на разных языках между собой в случае, если в настройках языков
			включена генерация отдельных директорий. Поскольку директории на разных языках могут быть разными, ссылки
			на одну и ту же страницу на разных языках могут отличаться.
		</li>
		<li>
			По завершенным фоновым задачам теперь собирается информация о реальном времени их выполнения движком. Ранее
			время выполнение рассчитывалось как разница между временем начала и завершения задачи, однако это не давало
			реальной оценки времени, т.к. задача могла висеть длительное время в ожидании. Теперь движок учитывает
			только реальное время, потраченное на выполнение задачи на главном сервере (копирование задачи на сервер
			конвертации + обработка результатов выполнения) плюс время потраченное на сервере конвертации.
		</li>
		<li>
			Загрузка файлов переведена на HTML5 File API, что позволяет не использовать отдельный модуль прогрессбара
			для nginx. Также улучшен механизм отображения ошибок, связанных с лимитом по размеру загружаемых файлов.
		</li>
		<li>
			При использовании CDN сервера хранения, настроенного на локальную директорию KVS теперь отображает
			показатели дискового пространства. Ранее для CDN серверов эти показатели не учитывались.
		</li>
		<li>
			Если embed код в данных импорта или фидах импорта указан в виде ссылки, то он автоматически будет
			оборачиваться в iframe.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Если указанное в настройках кол-во скриншотов было больше длительности видео, то создавались одинаковые
			  скриншоты.<br/>
			- При отображении рекламы с заданными ограничениями по категориям, такая реклама показывалась даже в тех
			  случаях, когда в контексте страницы не было информации о категориях. Теперь в таких случаях реклама с
			  ограничениями по категориям не будет отображаться.<br/>
			- Фиды импорта могли добавлять дубликаты категорий и моделей во время параллельной работы нескольких
			  фидов.<br/>
			- Если при импорте была выключена рандомизация даты и времени публикации, то объекты добавлялись с текущей
			  датой и временем 00:00:00, вместо текущего серверного времени.<br/>
			- Плеер не отображался корректно при просмотре видео с маленькой шириной в панели администрирования.<br/>
			- Комментарии не отображались при включенном параметре <b>match_locale</b> в блоке комментариев.
		</li>
	</ul>
	<h2 id="section_whats_new_3_5">KVS v3.5</h2>
	<h3 id="section_whats_new_3_5_2">KVS v3.5.2 [29.08.2014]</h3>
	<ul>
		<li>
			В настройках языков локализации теперь можно указывать, необходимо ли для этого языка создавать отдельные
			значения директорий или нет. Возможность использования отдельных директорий для локализации мы добавили в
			версии 3.5.0. Однако, этот функционал был включен без возможности выключить его, что не всегда
			востребовано. После обновления на версию 3.5.2 опция отдельных директорий будет по умолчанию выключена для
			всех языков. Если для ваших сателлитов необходимы отдельные директории, вам необходимо в настройках языков
			включить эту опцию.
		</li>
		<li>
			В настройках форматов видео теперь можно указывать максимальный % ширины ватермарка относительно ширины
			видео. Это может пригодиться в случаях, когда формат видео не имеет конкретного размера, и ватермарк одного
			и того же размера на видеофайлах разного размера может выглядить коряво.
		</li>
		<li>
			В опциях импорта появилась опция проверки дубликатов embed кодов.
		</li>
		<li>
			При редактировании объектов, которые поддерживают директории, теперь можно указывать любое значение
			директории, которое будет сохраняться "как есть". Ранее директории всегда проходили через процедуру
			проверки и транслитерации.
		</li>
		<li>
			В тэгах появилась возможность изменять значение директории. Теперь при изменении названия тэга его
			директория не изменяется автоматически; для изменения директории ее нужно либо очистить, либо изменить
			вручную.
		</li>
		<li>
			В фидах импорта появилась возможность указать разделитель для полей-списков, где ранее всегда ожидалась
			запятая. Сейчас можно выбрать запятую или точку с запятой.
		</li>
		<li>
			В блоке <b>list_albums</b> добавлен параметр <b>show_main_image_info</b>, который позволяет вывести
			информацию о главной фотографии для каждого фотоальбома в списке: любые форматы и текстовое описание.
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> добавлен параметр <b>show_flags_info</b>, который
			позволяет для каждого объекта в списке вывести кол-во проголосовавших за любые флаги объекта.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- При использовании нескольких локалей на одном домене, переключение на локаль по умолчанию не всегда
			  запоминалось в сессии пользователя.
		</li>
	</ul>
	<h3 id="section_whats_new_3_5_1">KVS v3.5.1 [21.07.2014]</h3>
	<ul>
		<li>
			При массовом пересоздании обзорных скриншотов сейчас не обязательно наличие исходных файлов для видео -
			скриншоты могут быть пересозданы на основе файлов форматов.
		</li>
		<li>
			В форматах фотоальбомов добавилась опция ресайза с фиксированной шириной и динамической высотой.
		</li>
		<li>
			В настройках фидов импорта появилась возможность указать кодировку фида, если она отличается от UTF-8.
		</li>
		<li>
			Для CSV фидов импорта список скриншотов теперь может быть разделен не только запятой, но и точкой с запятой.
		</li>
		<li>
			Формализовано понятие активности пользователей и добавлено понятие ранга пользователя по активности. В
			настройках мемберзоны теперь можно задать формулу для расчета индекса активности. В качестве слагаемых в
			формуле могут быть использованы множество критериев, например: кол-во загруженного видео или альбомов,
			кол-во закладок, кол-во комментариев, кол-во входов в мемберзону. Ранг активности показывает позицию
			пользователя на сайте исходя из его активности. Ранг регулярно пересчитывается и в информации о
			пользователе доступно текущее значение ранга и его прошлое значение. Это позволит не только показать ранг
			пользователя, но и изменение этого ранга (вверх или вниз).
		</li>
		<li>
			В блок <b>list_albums</b> добавлены сортировки, позволяющие группировать список фотоальбомов по дате
			добавления и в пределах даты по рейтингу, популярности или кол-ву фотографий. Для видео такая возможность
			уже была сделана ранее.
		</li>
		<li>
			Во всех блоках списков категоризации (список категорий, моделей и т.д.), в параметрах
			<b>show_only_with_xxx</b> появилась возможность указать минимальное кол-во видео или альбомов. Таким
			образом, если раньше можно было вывести скажем, только моделей, у которых есть видео - то сейчас можно
			вывести моделей, у которых есть как минимум N видео.
		</li>
		<li>
			В блоке удаления профиля появилась возможность пользователям указывать причину удаления, а также настроить
			чтобы это поле было обязательным.
		</li>
		<li>
			В блоке регистрации появилась возможность включить автозапоминание пользователя на N дней. Таким образом,
			сразу после регистрации или подтверждения со своего почтового ящика пользователь будет не только залогинен,
			как было раньше, но и запомнен.
		</li>
		<li>
			В блоке профиля пользователя появилась возможность вывести ссылки на следующего и предыдущего пользователей
			в целях улучшенной навигации. Для этого необходимо включить параметр <b>show_next_and_previous_info</b> в
			блоке.
		</li>
		<li>
			В блоке <b>search_results</b> при выводе запросов, похожих на текущий, теперь исключен текущий запрос.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- В импорте фотоальбомов не выбиралась автоматически схема импорта, выбранная по умолчанию.<br/>
			- При импорте фотографий или скриншотов в архиве ранее выдавалась ошибка по архиву, если файлы находились
			  в папке внутри архива. Сейчас это исправлено и такие архивы можно использовать.<br/>
			- При вставке новых блоков в шаблоны страниц через файловую систему (не через панель администрирования)
			  такие блоки не работали через аякс запросы, а также могли возникнуть ошибки в кэшировании страниц.
			  Проблема исправлена; также на списке UI сайта и в плагине аудита по таким страницам появятся ошибки. Для
			  их исправления нужно просто пересохранить страницу в панели администрирования.<br/>
			- В новом iframe embed коде не работало перенаправление на страницу своего сайта с видео.<br/>
			- Несколько небольших проблем, найденных в 3.5.0.
		</li>
	</ul>
	<h3 id="section_whats_new_3_5_0">KVS v3.5.0 [14.06.2014]</h3>
	<ul>
		<li>
			Полностью изменена концепция iframe embed кодов. Раньше iframe embed коды отображались страницей сайта, что
			не позволяло настраивать их доступность и получать статистику. После обновления на версию 3.5.0 iframe
			embed коды можно перевести на новый движок, что дает следующие преимущества:<br/>
			- Появляется возможность настраивать разные профили embed кодов для разных сайтов. Вы можете задать
			  полностью разные настройки шаблона отображения и рекламы для "своих" и "чужих" сайтов. Наборы профилей не
			  ограничены.<br/>
			- Добавляется поддержка мультиформатного видео в embed кодах. Старые embed коды не давали возможность
			  переключать форматы.<br/>
			- Добавляется поддержка таймлайновых скриншотов в embed кодах.<br/>
			- Добавляется поддержка настроек HTML рекламы в embed кодах.
		</li>
		<li>
			Завершена поддержка Flash embed кодов. Старые embed коды останутся рабочими, новые embed коды можно будет
			получить только в iframe виде. Во всех новых инсталляциях начиная с 3.5.0 Flash embed коды работать не
			будут.
		</li>
		<li>
			Появилась возможность привязать HTML рекламу и всплывающую рекламу в плеере к доп. полям контент
			провайдеров, как это было доступно ранее для других типов рекламы.
		</li>
		<li>
			Полностью переработана процедура генерации директорий объектов для SE-оптимизации. Раньше директории
			поддерживали только символы латиницы, соответственно для других языков использовалась транслитерация через
			отдельный скрипт. В версии 3.5.0 мы добавили настройки генерации директорий, где можно указать максимальную
			длину директорий и задать правила транслитерации. В зависимости от правил транслитерации можно разрешить
			существование любых символов, а не только латиницу.
		</li>
		<li>
			Директории стали локализуемыми, как названия и описания. При использовании сателлитов это позволяет иметь
			не только разные названия и описания объектов, но и полностью разные URL-ы без каких-либо совпадений. В
			настройках языков вы сможете задать отдельные правила транслитерации для каждого языка.
		</li>
		<li>
			Новая опция в настройках удаленных серверов хранения позволит включить перекрытие доменного имени основного
			проекта на сателлитах, что даст возможность полностью скрыть связь между основным проектом и сателлитами
			для поисковых систем.
		</li>
		<li>
			Появилась возможность подписки пользователями на контент провайдеры и моделей. Функциональность подписок
			позволяет пользователям следить за обновлениями контента в интересующих их объектах через мемберзону. Кроме
			контент провайдеров и моделей KVS позволяет подписываться на каналы и других пользователей.
		</li>
		<li>
			В контент провайдерах изменился подход к скриншоту. Скриншотов стало 2 (как у моделей), в настройках
			контента можно задать их размеры и опцию дублирования.
		</li>
		<li>
			Добавилась опция, которая позволяет распределять загружаемый контент по 2 зонам сайта: (а) все публичные
			страницы и (б) только мемберзона пользователя. Контент, определенный в мемберзону пользователя будет виден
			только на страницах этого пользователя и не попадет в общие страницы сайта. При необходимости включения
			этой опции просьба обратиться в службу поддержки.
		</li>
		<li>
			Добавлена автоматическая коррекция неправильной ориентации у изображений фотоальбомов.
		</li>
		<li>
			В статистике по контенту появилась возможность запустить массовое редактирование выбранного контента. Это
			может пригодиться для миграции наиболее или наименее популярного контента с одной группы хранения на
			другую.
		</li>
		<li>
			При вызове массового редактирования всего контента будет показываться предупреждение, чтобы избежать
			случайного редактирования всех объектов.
		</li>
		<li>
			В настройках сайта появилась возможность задать поведение для псевдо-видео. Если ранее при открытии
			страницы с псевдо-видео пользователь во всех случаях перенаправлялся на URL выхода, то сейчас можно
			разрешить открывать страницу с видео на вашем сайте и отображать ссылку в шаблоне.
		</li>
		<li>
			В редакторе фотографий альбома появилась возможность выделить все фотографии для удаления, по аналогии со
			скриншотами видео. В персональных настройках теперь можно задать поведение при клике на скриншот видео или
			фотографию альбома: разворачивать просмотрщик либо выделять на удаление.
		</li>
		<li>
			В персональных настройках опция включения WYSIWYS редактора заменена на несколько опций для разных секций
			данных.
		</li>
		<li>
			В списках видео, альбомов и постов в панели администрирования появился фильтр по дате публикации.
		</li>
		<li>
			Добавилась поддержка аватаров пользователей в различных форматах, в том числе и анимированных GIF файлов.
			Для включения поддержки GIF файлов необходимо добавить GIF формат в список допустимых форматов в опции
			<b>$config['image_allowed_ext']</b> в конфиге <b>/admin/include/setup.php</b>.
		</li>
		<li>
			Появилась возможность задавать альтернативные URL-ы отдачи для аватаров категорий для ускорения загрузки
			страницы со списком категорий. Для этого необходимо вносить изменения в шаблон, просьба связываться со
			службой поддержки.
		</li>
		<li>
			В моделях и пользователях добавлены новые варианты в полях цвет глаз, цвет волос, пол, ориентация, семейное
			положение. Для их корректной работы необходимо внесение изменений в шаблоны сайта.
		</li>
		<li>
			В настройках сайта появилась возможность выключить MemCache глобально, оставить только файловый кэш.
		</li>
		<li>
			Появилась возможность написать свой скрипт-обработчик для отправки сообщений почты.
		</li>
		<li>
			Все блоки сайта были переработаны с точки зрения обработки POST запросов форм и асинхронных запросов. Все
			формы теперь можно отправлять асинхронно, в качестве ответов можно получать XML или JSON формат. Всем
			ошибкам назначены уникальные коды. Это позволит в новых дизайнах отказаться от дублирования проверок на
			стороне клиента и сервера, оставить только проверки на стороне сервера. В ближайших обновлениях мы также
			планируем очистить существующий JS код от проверок, перевести все формы на асинхронную отправку и сократить
			кол-во кода до минимума.
		</li>
		<li>
			В блоке <b>signup</b> появилась возможность вывести форму повторной отправки email подтверждения
			регистрации.
		</li>
		<li>
			В блоках <b>signup</b> и <b>member_profile_edit</b> появилась возможность сделать многие поля профиля
			обязательными к заполнению (страна, город, аватар и другие). Обратите внимание, что включение этих опций
			требует внесения изменений в шаблоны блоков.
		</li>
		<li>
			В блоке логина появилась возможность настроить редирект на профиль пользователя после логина.
		</li>
		<li>
			В блоках комментариев появилась возможность указать минимальную длину комментария (параметр
			<b>min_length</b>). Обратите внимание, что включение этой опции требует внесения изменений в шаблон блока.
		</li>
		<li>
			В блоках <b>list_models</b>, <b>list_content_sources</b> и <b>list_tags</b> появилась возможность показать
			только те объекты категоризации, в которых есть видео ИЛИ альбомы (параметр
			<b>show_only_with_albums_or_videos</b>). Ранее такая возможность присутствовала только в блоке
			<b>list_categories</b>.
		</li>
		<li>
			В блоке <b>list_members</b> добавилась поддержка поиска пользователей по городу, отдельно от остальных
			данных (параметр <b>var_city</b>).
		</li>
		<li>
			В блоке <b>list_categories</b> появилась возможность отсортировать категории по CTR видео в них.
		</li>
		<li>
			В блоке <b>list_members</b> можно включить разделение пользователей по языкам или сателлитам (параметр
			<b>match_locale</b>). Это позволит отображать на сателлите только тех пользователей, которые были
			зарегистрированы на данном сателлите. В настоящее время по сателлитам можно разделять комментарии,
			пользователей и события.
		</li>
		<li>
			Добавились новые сортировки в списках пользователей, контент провайдеров, моделей.
		</li>
		<li>
			В блоке <b>list_members_events</b> появилась возможность "вытягивать" данные о каждом объекте события
			(видео, альбом и другие), чтобы показать больше информации в списке событий.
		</li>
		<li>
			В блоках <b>list_videos</b>, <b>list_albums</b>, <b>list_content</b>, <b>list_posts</b> в переменную
			<b>$storage</b> помещается информация о названии и описании первого объекта в списке, чтобы эту информацию
			можно было использовать в мета тэгах страницы.
		</li>
		<li>
			В блоке <b>search_results</b> добавилась сортировка поисковых запросов: по алфавиту, по кол-ву запросов, по
			кол-ву найденных результатов. Также добавилась поддержка вывода похожих запросов. Это можно использовать в
			2 ключах: во-первых, на странице результатов поиска показать список похожих запросов; во-вторых, при вводе
			запроса в поле поиска показать список автозаполнения.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- При копировании файлов на сервера хранения больше не используется функция FTP chmod.<br/>
			- В плеере таймлайновые скриншоты уезжали за границы плеера.<br/>
			- В плеере при клике на область воспроизведения видео рекламная ссылка открывалась каждый раз, теперь
			  только при первом клике.<br/>
			- На сателлитах не запускался крон плагинов.<br/>
			- Блок логина не делал редирект уже залогиненного пользователя при попытке зайти на страницу логина
			  снова.<br/>
			- В некоторых случаях не работала возможность загрузки файлов через URL.
		</li>
	</ul>
	<h2 id="section_whats_new_3_4">KVS v3.4</h2>
	<h3 id="section_whats_new_3_4_2">KVS v3.4.2 [14.03.2014]</h3>
	<ul>
		<li>
			Произведена оптимизация использования памяти в экспорте. Ранее большой экспорт данных мог приводить к
			ошибке нехватки памяти.
		</li>
		<li>
			Поиск видео и альбомов в панели администрирования ищет теперь и по доп. полям кастомизации.
		</li>
		<li>
			На списках видео и альбомов в панели администрирования можно включить отображение доп. полей кастомизации.
		</li>
		<li>
			Появилась возможность управлять приоритетом фоновых задач.
		</li>
		<li>
			В импорте / экспорте, а также в фидах добавилась возможность использовать поле популярности (кол-во
			просмотров).
		</li>
		<li>
			В массовом редактировании появилась возможность сделать разброс популярности в указанном диапазоне для всех
			выбранных объектов.
		</li>
		<li>
			В массовом редактировании появилась возможность установить либо сбросить флаг "требует проверки".
		</li>
		<li>
			В фидах импорта добавилась поддержка пользователя в данных фида.
		</li>
		<li>
			В настройках флагов появилась возможность включить создание событий мемберзоны при голосовании данными
			флагами.
		</li>
		<li>
			Добавилась интеграция с расширенным HTML редактором для описаний и доп. полей, при включении которой
			текстовые области заменяются на HTML редакторы. Для включения данной возможности после обновления
			необходимо связаться со службой поддержки.
		</li>
		<li>
			В экспорте появилась возможность выводить ссылки на страницы просмотра всех сателлитов, привязанных к
			головному проекту. Для корректной работы этого функционала необходимо также обновить сателлиты.
		</li>
		<li>
			Произведена оптимизация движка конвертации в случае, когда в очереди находится много задач.
		</li>
		<li>
			Улучшена работа с фотографиями альбомов в панели администрирования. Добавлен слайдшоу компонент при клике
			на тумбы.
		</li>
		<li>
			Комплекс улучшений по плееру и его настройкам:<br/>
			- Появилась возможность привязывать логотип к контент провайдерам видео и позиционировать его полосой снизу
			  или сверху. Это можно использовать для закрытия ватермарка видеофайла на свой кликабельный логотип.
			  Логотип масштабируется до нужных размеров исходя из масштабирования видеофайла и при переходе на полный
			  экран ведет себя точно так же. Использование таких логотипов поможет повысить монетизацию сайта при
			  рекламе спонсорских видео.<br/>
			- В настройках плеера появилась возможность выключить масштабирование постера.<br/>
			- В настройках плеера появилась возможность выключить масштабирование всплывающей рекламы.<br/>
			- HTML5 версия плеера больше не отрисовывает центральную кнопку проигрывания, рассчитывая на использование
			  встроенных возможностей системы.<br/>
			- Клавиши вперед / назад теперь позволяют перематывать видео.
		</li>
		<li>
			Приведен к общему порядку вывод списков категорий, тэгов и моделей видео и альбомов в панели
			администрирования и на сайте. Теперь информация на сайте выводится в точно таком же порядке, в котором она
			добавлена в панели администрирования.
		</li>
		<li>
			В блоке <b>list_comments</b> добавлена возможность указать сортировку, в частности можно отсортировать по
			лайкам.
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> добавлена возможность указать тип закладок статически
			(аналог параметра <b>var_fav_type</b>). Ранее тип закладок можно было передать только через параметры
			запроса.
		</li>
		<li>
			Для постраничных списков на сайте теперь можно вывести &lt;link rel="next / prev"&gt;, указывающие на
			предыдущую и следующую страницы, в соответствии с рекомендациями Google. Необходимые ссылки содержатся в
			<b>$storage</b> каждого блока списка, для которого включена пагинация.
		</li>
		<li>
			При отображении похожих видео / альбомов по категориям можно указать группу категорий, категории которой
			стоит учитывать при выборке (новый параметр <b>mode_related_category_group_id</b>).
		</li>
		<li>
			В блоке создания фотоальбома появилась возможность указать минимальное кол-во загружаемых фотографий.
			Просьба обратить внимание, что включение данной опции также потребует поправок в шаблоне блока, которые не
			вносятся автоматически при обновлении.
		</li>
		<li>
			В блоке <b>global_stats</b> добавилась переменная для вывода общей длительности видео в часах.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Мобильная версия плеера не работала корректно при включении динамического ограничения по битрейту в
			  настройках форматов видео.<br/>
			- В поиске контента по строке, при включении поиска по названиям категорий, тэгов и моделей, теперь
			  используются все найденные категории, тэги и модели. Ранее использовалась только первая найденная
			  категория, тэг или модель - а их могло быть несколько из-за наличия синонимов.<br/>
			- При ручной нарезке скриншотов настройки кропа использовались дважды - из глобальных настроек и из
			  настроек на самой странице создания скриншотов.<br/>
			- Исправлены некоторые случаи возникновения ошибки с кодом 10 в движке конвертации (невозможность создания
			  скриншотов по видео).<br/>
			- В некоторых случаях не создавались условно-обязательные форматы, если в настройках сервера конвертации
			  было включено копирование контента на сервера хранения.<br/>
			- При загрузке файлов с URL-ов в некоторых случаях обрезались параметры запроса.<br/>
			- В русской локализации панели администрирования дробные числа округлялись при сохранении в базу
			  данных.<br/>
			- Несколько мелких проблем в плеере.
		</li>
	</ul>
	<h3 id="section_whats_new_3_4_1">KVS v3.4.1 [29.01.2014]</h3>
	<ul>
		<li>
			В движок конвертации добавлена очередная оптимизация, призванная уменьшить использование FTP протокола при
			копировании исходных файлов на сервера конвертации. Новая опция позволяет серверам конвертации скачивать
			файлы с главного сервера, что может значительно ускорить работу движка на главном сервере при нескольких
			серверах конвертации, поскольку скачивание исходных файлов будет идти параллельно.
		</li>
		<li>
			Добавлена поддержка вертикальных видео, снятых на мобильные устройства с поворотом в 90°.
		</li>
		<li>
			На списках видео, альбомов и постов в панели администрирования добавлена возможность показать только
			объекты, которые уже появились на сайте либо еще не появились (с учетом статуса и даты публикации).
		</li>
		<li>
			На списке серверов конвертации добавлены массовые операции по удалению, активации и деактивации серверов.
			Также появилась новая операция по автоматическому обновлению API скрипта на серверах на новую версию, если
			таковая существует.
		</li>
		<li>
			В блоке <b>list_videos</b> добавлена сортировка по году выпуска.
		</li>
		<li>
			В блоках <b>video_view</b> и <b>album_view</b> добавлена возможность указать, в какой группе закладок
			находится данное видео или альбом (KVS поддерживает до 10 групп закладок).
		</li>
		<li>
			В блоках <b>video_view</b>, <b>album_view</b> и <b>post_view</b> при выводе категорий можно вывести
			информацию о группе категорий.
		</li>
		<li>
			В сессии пользователя появилась информация о кол-ве видео и альбомов в закладках.
		</li>
		<li>
			Появилась возможность выключать учитывание клика в статистике видео, альбома или поста при открытии страницы с
			контентом. Для этого в параметрах страницы необходимо передать параметр <b>no_stats=true</b>.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Фоновая задача по созданию нового формата скриншотов больше не останавливается при обнаружении каждой
			  ошибки, а продолжает отрабатывать до конца и в конце выводит список всех найденных ошибок в лог.<br/>
			- В некоторых случаях не удалялись папки задач на серверах конвертации.<br/>
			- Невозможно было включить пагинацию по блоку списка с псевдослучайной сортировкой.<br/>
			- Фильтр "до" по году выпуска не включал верхнюю границу, теперь включает.<br/>
			- Плагины автоподбора моделей, тэгов и категорий не корректно работали с регистром.<br/>
			- В блоке <b>random_video</b> сортировка по рейтингу / популярности за сегодня не работала аналогично
			  сортировке на списке видео.<br/>
			- В фидах экспорта не подставлялся реф партнера в iframe embed код.<br/>
			- В персональных настройках опция включения плеера на странице редактирования видео была видна только в
			  Ultimate пакете.<br/>
			- При редактировании поста некорректно проверялись привилегии на директории.<br/>
			- Импорт не запускался на версиях PHP < 5.3.<br/>
			- Сортировки по рейтингу за период не учитывали количество голосов, только сам рейтинг.<br/>
			- Исправлены некоторые ложные ошибки в проверке корректности кэширования шаблонов сайта.<br/>
			- Рандомизация альтернативных доменных имен отдачи скриншотов видео работала некорректно.<br/>
			- В меню фидов экспорта ссылки работали некорректно.
		</li>
	</ul>
	<h3 id="section_whats_new_3_4_0">KVS v3.4.0 [23.12.2013]</h3>
	<ul>
		<li>
			Выполнена серьезная переработка логики раздела UI сайта и добавлено несколько важных нововведений:<br/>
			- Информация о страницах сайта и рекламе больше не хранится в базе данных. Это позволит упростить
			  синхронизацию дизайна между сайтами (например, между главным сайтом и языковыми сателлитами, а также
			  между DEV и продакшен версиями).<br/>
			- Глобальные блоки теперь можно использовать в компонентах страниц. Многие сталкивались с необходимостью
			  вставить блок категорий или глобальной статистики в шапку сайта, чтобы он выводился на всех страницах.
			  Ранее приходилось вставлять блок в шаблон каждой страницы по отдельности, теперь его можно вставить
			  только один раз в компонент шапки.<br/>
			- Добавлена возможность настроить динамические параметры для отдельных блоков и страниц с целью обхода
			  проблемы кэширования, когда в шаблоне блока или страницы необходимо использовать данные, переданные через
			  запрос. <br/>
			- Значительно улучшена и оптимизирована проверка страниц и шаблонов в разделе UI сайта и в плагине аудита.
			  Теперь выполняются также проверки ошибок кэширования, включая некорректное использование данных из сессии
			  и данных из запроса в местах, где это не будет работать.<br/>
			- В настройках UI сайта добавлена глобальная опция выключения кэширования.<br/>
			- Добавлена возможность восстановления удаленных страниц и удаленных со страниц блоков.<br/>
		</li>
		<li>
			В настройках рекламы появилась возможность привязывать рекламу к категориям и к определенным странам через
			GEO_IP. При использовании категорий в рекламе движок ищет любые данные о категориях в контексте страницы
			(например, выводится список видео по какой-либо категории, или отображается страница с видео, у которого
			есть категории). В таких случаях в рекламном слоте будет показываться только реклама, которая имеет любую
			категорию из контекста страницы.
		</li>
		<li>
			Несколько ключевых изменений в плеере и его настройках:<br/>
			- Добавлена поддержка HTML рекламы и возможность ее настройки.<br/>
			- Добавлена возможность более детально настроить размеры плеера и embed плеера без поправок в шаблонах.<br/>
			- Добавлена возможность использовать изображения (PNG, JPG) в качестве всплывающих баннеров, а также
			  указывать длительность их показа.<br/>
		</li>
		<li>
			Добавлен новый тип данных - посты - с возможностью гибкой кастомизации и разбиения на классы. Посты могут
			использоваться для любых нужд: новости, игры и любые данные, которые не имеют стандартной поддержки в KVS.
		</li>
		<li>
			Расширены настройки по ограничению скорости отдачи для форматов видео. Теперь можно установить не только
			фиксированный битрейт, но и динамическое ограничение, зависящее от конкретного битрейта видеофайла. Также
			появилась возможность задать разные ограничения скорости для пользователей разных статусов.
		</li>
		<li>
			Добавлена группа настроек для статистики, которые позволяют выключить сбор ненужных данных, а также
			включить сбор новых видов данных, таких как: уникальные посещения страниц видео и альбомов (с проверкой на
			уникальность IP адреса), запросы видеофайлов и фотографий альбомов. Кроме включения / выключения
			определенных видов статистики, настройки также позволяют указать длительность хранения для каждого вида
			данных. Это можно использовать для оптимизации работы некоторых блоков сайта, которые базируются на
			статистике.
		</li>
		<li>
			Добавлено отображение статистики по контенту - рейтинг, посещения, уникальные посещения, запросы файлов с
			группировкой по дате либо по отдельным видео / альбомам.
		</li>
		<li>
			Расширено отображение статистики по посещениям контента зарегистрированными пользователями, появилась
			информация по запросам пользователями видеофайлов и фотографий (ранее была доступна только информация по
			посещениям страниц просмотра).
		</li>
		<li>
			В видео добавилось понятие года выпуска с возможностью сортировки и выборки в диапазоне.
		</li>
		<li>
			Плагин резервного копирования переписан с возможностью настроить регулярное создание резервных копий. Новые
			настройки позволяют включить создание ежемесячных бэкапов за последний год, еженедельных бэкапов за
			последний месяц и ежедневных бэкапов за последнюю неделю.
		</li>
		<li>
			Расширена интеграция с биллингом segpay для покупки токенов. Добавлена поддержка one-click покупок.
		</li>
		<li>
			Появилась возможность вручную изменять группы хранения для отдельных видео и альбомов на странице
			редактирования (раньше такая возможность была только через массовое редактирование).
		</li>
		<li>
			Появилась возможность указывать конкретную группу хранения при ручном создании контента и при его импорте.
		</li>
		<li>
			В случае использования удаленных CDN серверов хранения появилась возможность определять свободное место на
			них путем генерации файла специального формата на файловой системе сервера.
		</li>
		<li>
			В фотографиях убралось ограничение описания по длине, до этого максимальная длина описания была равна 150
			символов.
		</li>
		<li>
			При ручной нарезке скриншотов появилась возможность указать смещение первого скриншота. Ранее смещение
			всегда бралось из настроек контента. Кроме этого, использование медленного метода нарезки теперь выключено
			по умолчанию, а для его включения добавилась отдельная опция. Медленный метод нарезки скриншотов может
			создать неудобство при обработке длинных видео.
		</li>
		<li>
			В панели администрирования на списках видео и альбомов добавился отдельный фильтр по контенту, загруженному
			вебмастерами.
		</li>
		<li>
			В панели администрирования на списках видео и альбомов появилась возможность включить отображение
			директории.
		</li>
		<li>
			В панели администрирования на списках видео и альбомов появилась возможность поиска контента по списку
			айди, разделенных через запятую.
		</li>
		<li>
			При создании трейлера убралось минимальное ограничение в 5 секунд для каждой части трейлера.
		</li>
		<li>
			В фидах экспорта добавилась поддержка экспорта полей кастомизации. Также появилась возможность получить
			список удаленных видео в виде ссылок на их страницы.
		</li>
		<li>
			В настройках ротатора добавилась возможность выключить прокрутку скриншотов при наведении мыши, чтобы
			пользователю всегда показывался только 1 скриншот.
		</li>
		<li>
			Добавилась поддержка комбинации Ctrl+S во всех местах, где раньше ее не было.
		</li>
		<li>
			В настройках сервера хранения появилась возможность выключить тестирование стриминга. Актуально для
			серверов, которые не возвращают корректный content-length заголовок, из-за чего по ним постоянно
			показывается ошибка стриминга.
		</li>
		<li>
			В блоке <b>album_view</b> появилась возможность установить лимиты по кол-ву просмотров по аналогии с видео.
		</li>
		<li>
			Очередное улучшение в пагинации - неизвестные параметры не добавляются к адресам страниц, как это было
			ранее. Данная поправка не будет включаться автоматически при обновлении. Для ее включения просим обратиться
			в службу поддержки.
		</li>
		<li>
			В блоках <b>list_videos</b>, <b>list_albums</b> и <b>list_content</b> добавилась группа параметров
			<b>show_comments</b>, которые позволяют для каждого элемента списка вывести несколько последних
			комментариев.
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> добавился параметр <b>var_mode_related</b>, который
			позволяет динамически изменить методику пересчета похожего контента. Это позволяет упростить разработку
			шаблона, если вы показываете закладки с возможностью отобразить похожий контент по разным критериям.
		</li>
		<li>
			В блоке <b>search_results</b> появилась возможность выбрать, какое кол-во результатов поиска следует
			использовать в фильтре по кол-ву результатов (кол-во найденных видео, найденных альбомов или всего вместе).
		</li>
		<li>
			В блоке <b>search_results</b> появилась возможность указать минимальный порог кол-ва запросов, до которого
			поисковые запросы не будут выводиться.
		</li>
		<li>
			Блок <b>list_comments</b> теперь позволяет выводить имя анонимного пользователя, который отправил
			комментарий, а также название страны пользователя.
		</li>
		<li>
			В блоке <b>list_members</b> добавилась сортировка по общему кол-ву комментариев. Также поиск по строке
			теперь ищет и в названии страны.
		</li>
		<li>
			В блоке <b>member_profile_view</b> теперь можно вывести дату, когда пользователи подружились.
		</li>
		<li>
			В блоке <b>list_messages</b> добавилась поддержка папки invites, в которой выводятся только приглашения
			подружиться.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Использование нестандартного CSV формата в импорте.<br/>
			- В случае использования внешнего поиска кол-во найденных результатов не учитывалось в статистике
			  поиска.<br/>
			- Не подчищались некоторые временные файлы ротатора, что при большом трафике могло приводить к проблемам
			  файловой системы.<br/>
			- При логине после восстановления пароля пользователю показывалась не совсем корректная информация.<br/>
			- В панели администрирования не пропускались изображения с расширением JPEG.<br/>
			- В форматах видео нельзя было установить флаг "исходника" одновременно для формата из стандартной группы и
			  из премиум группы.<br/>
			- Плагин подбора категорий при работе с тэгами не учитывал тэги с пробелами.<br/>
			- Плагин резервного копирования создавал бэкапы с некорректными привилегиями на файлы.<br/>
			- При скачивании файлов импортом не производилась проверка на нулевой размер файла.<br/>
		</li>
	</ul>
	<h2 id="section_whats_new_3_3">KVS v3.3</h2>
	<h3 id="section_whats_new_3_3_3">KVS v3.3.3 [19.09.2013]</h3>
	<ul>
		<li>
			Добавлена англоязычная документация по настройке сайта.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Новая операция пересоздания обзорных скриншотов видео приводила к сбросу информации о скриншотах для всех
			видео.<br/>
			- При загрузке исходного видеофайла в качестве одного из нестримовых форматов он не копировался на сервер
			хранения.<br/>
			- Некорректная работа xbill с некоторыми префиксами.<br/>
		</li>
	</ul>
	<h3 id="section_whats_new_3_3_2">KVS v3.3.2 [01.09.2013]</h3>
	<ul>
		<li>
			Добавлена возможность указать время задержки появления контента на сайте по отношению к его дате публикации.
			Это имеет смысл, если у вас скриншоты видео копируются на сторонние сервера через серверную синхронизацию.
			В этом случае вы можете установить задержку, чтобы к моменту появления видео на сайте его скриншоты уже
			были гарантировано вынесены на сервера отдачи.
		</li>
		<li>
			В настройках мультиязычности появилась возможность установить область применения языка для разных типов
			объектов. Ранее область применения (название и описание, либо только название) указывалось глобально для
			всех типов объектов.
		</li>
		<li>
			В фотоальбомы добавилась поддержка флага администратора по аналогии с видео.
		</li>
		<li>
			При импорте контента появилась возможность указывать категории в разбиении по группам категорий. Это
			полезная фича для тех, кто использует расширенную категоризацию контента с разбиением на группы категорий.
			Если раньше все категории на импорте указывались в одном поле, и при отсутствии категорий в базе они
			создавались автоматически с пустой группой категорий, то теперь вы можете указывать категории в разных
			полях импорта и при создании несуществующих категорий они будут создаваться в нужной группе в зависимости
			от поля, в котором они указаны.
		</li>
		<li>
			В блоке <b>random_video</b> добавлены параметры <b>show_content_sources</b> / <b>skip_content_sources</b> и
			<b>show_dvds</b> / <b>skip_dvds</b>, которые позволяют отфильтровать случайное видео по фиксированному
			набору контент провайдеров или каналов.
		</li>
		<li>
			В блоке <b>list_models</b> добавился параметр <b>search_scope</b>, что позволяет настроить поиск только по
			названию и псевдониму моделей без поиска по описанию.
		</li>
		<li>
			В блоках <b>list_videos</b>, <b>list_albums</b> и <b>list_content</b> в параметре <b>search_scope</b>
			появилась новая опция для полного выключения поиска по названию и описанию. В этом случае поиск будет идти
			только по связанным данным (тэгам, категориям и т.д.) в случае включения соотв. параметров
			<b>enable_search_on_xxx</b>.
		</li>
		<li>
			В блоке <b>search_results</b> появилась возможность удалить из выдачи поисковые запросы, по которым нашлось
			менее чем заданное число результатов (параметр <b>query_results_min</b>).
		</li>
		<li>
			На сайте KVS добавлен удобный конфигуратор плеера с возможностью легкой настройки HTML рекламы. Если вы
			используете наш плеер на других проектах - не пропустите его новые возможности! В версии 3.4.0 возможность
			настройки HTML рекламы добавится также и в KVS.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Некорректное наложение ватермарка на новых версиях ffmpeg в случае ресайза видео. Для того, чтобы это
			  изменение подхватилось, вам нужно убедиться что версия API на всех серверах конвертации >= 3.3.2.<br/>
			- При загрузке видеофайлов с нестандартным SAR в качестве форматов видео происходила их некорректная
			  обработка. Для того, чтобы это изменение подхватилось, вам нужно убедиться что версия API на всех
			  серверах конвертации >= 3.3.2.<br/>
			- Блок <b>search_results</b> выводил пустые результаты поиска, если была включена пагинация и какие-либо
			  фильтры.<br/>
			- Исправлено поведение сортировки по рейтингу или популярности за сегодня, чтобы она использовала данные за
			  вчера. В противном случае сортировка сбивалась при наступлении нового дня и начинала работать более
			  корректно только во второй половине дня.<br/>
		</li>
	</ul>
	<h3 id="section_whats_new_3_3_1">KVS v3.3.1 [31.07.2013]</h3>
	<ul>
		<li>
			В движок конвертации добавлена поддержка исходных файлов с нестандартным значением Pixel Aspect Ratio.
			Такие файлы зачастую получаются при захвате видео с телевизионного сигнала.
		</li>
		<li>
			В настройках контента добавилась возможность задать постфикс для видео и альбомов с дубликатами названий.
			При обработке нового контента движок будет осуществлять проверку, и если контент с таким названием уже
			существует, то к названию будет добавляться указанный постфикс с порядковым номером.
		</li>
		<li>
			В списках объектов категоризации в панели администрирования добавлен столбец, который показывает общее
			кол-во зависимого контента (видео и альбомы в категории, с тэгом и т.д.), а также предоставляет возможность
			сортировки.
		</li>
		<li>
			В настройки ресайза скриншотов добавилась опция, позволяющая получать скриншоты с нефиксированным размером
			(размер будет зависеть от аспект ратио исходного видео). До этого форматы скриншотов могли создаваться
			только со строго фиксированным размером.
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> расширена логика параметра <b>var_category_ids</b>.
			Параметр теперь позволяет передавать несколько списков идентификаторов категорий, разделенных через символ
			вертикальной черты (|), которая означает логическое "И". Это может быть использовано для организации
			расширенного поиска при помощи чекбоксов с категориями. Например, найти все фильмы в категориях
			"Триллер (ID=1)" или "Детектив (ID=2)", которые вышли в прокат в 2012 (ID=10) или 2013 (ID=11) годах. Для
			этого в HTTP параметре для <b>var_category_ids</b> необходимо сформировать строку <b>(1,2)|(10,11)</b>, что
			означает видео из категорий 1 или 2, и в то же время из категорий 10 или 11.
		</li>
		<li>
			Во всех блоках сортировки по названию переведены на регистронезависимые.
		</li>
		<li>
			В мультисерверности добавилась возможность указать порт FTP соединения, если он отличается от 21.
		</li>
		<li>
			В настройках контента появилась возможность выключить проверку размеров загружаемых в панели
			администрирования скриншотов видео и фотографий альбомов. По умолчанию все загружаемые изображения
			проверяются на соответствие максимальным размерам настроенных форматов (т.е. если задан формат с размером
			<b>800x600</b>, то со включенной проверкой будет невозможно загрузить изображения меньшего размера).
		</li>
		<li>
			В конфигурации проекта появилась возможность задать длительность сессии для панели администрирования без
			привязки к настройкам окружения PHP. Если вам это необходимо, свяжитесь со службой поддержки для получения
			инструкции.
		</li>
		<li>
			В плагине статистики контента добавились суммарные цифры занимаемого пространства на главном сервере и
			серверах хранения.
		</li>
		<li>
			В фидах экспорта появилась возможность указывать фильтр по каналу через HTTP параметры фида.
		</li>
		<li>
			В настройки UI сайта добавилось поле для настройки паттерна URL-а страницы с результатами поиска. Если он
			задан, то статистика поиска будет давать ссылки по каждому поисковому запросу.
		</li>
		<li>
			В статистике поиска будет собираться информация о кол-ве найденных видео или альбомов по каждому запросу.
			Запросы, по которым ничего не найдено, не будут выводиться в блоке <b>search_results</b>.
		</li>
		<li>
			В блоке <b>search_results</b> добавлена возможность настроить минимальную и максимальную длину выбираемых
			запросов.
		</li>
		<li>
			В блоках просмотра видео и альбома появилась возможность показывать, добавлен ли текущий объект в закладки
			пользователей или нет. Ранее такой возможности не было из-за нюансов с кэшированием.
		</li>
		<li>
			Улучшено юзабилити плеера при проигрывании MP4 файлов. Ранее плеер не показывал никакого % прогресса до тех
			пор, пока не загрузятся метаданные (на длинных MP4 видеофайлах метаданные могут занимать несколько мегабайт
			и подгружаться относительно долго).
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- В плеере с версии 3.3.0 некорректно происходило масштабирование видео на полный экран в некоторых
			  случаях.<br/>
			- При обработке галерей альбомов проверка доступности фотографий не производится, если сервер не
			  поддерживает HEAD запросов. Ранее такая проверка приводила к ошибкам, хотя фотографии были доступны.<br/>
			- В фидах импорта название видео требовалось даже если статус видео был неактивным. Это требование было
			  убрано.<br/>
			- В импорте видео и альбомов при указании категорий нельзя было указать категорию с запятой, поскольку
			  запятая является разделителем. Теперь запятую можно форсировать, указав символ обратного слэша (/) перед
			  ней.<br/>
			- Управляющий скрипт <b>remote_control.php</b>, который загружается на сервера хранения, теперь более
			  корректно определяет размеры диска в случае использования примонтированных директорий.
		</li>
	</ul>
	<h3 id="section_whats_new_3_3_0">KVS v3.3.0 [03.07.2013]</h3>
	<ul>
		<li>
			Переработка полноэкранного режима плеера и улучшения по его юзабилити:<br/>
			- Масштабирование плеера в полноэкранном режиме исправлено и не зависит от размеров исходного видео или
			  окна плеера. Это также позволило исправить проблему с некорректным отображением, если уходить на полный
			  экран до скачивания метаданных видео.<br/>
			- Плеер в оконном режиме может быть масштабирован до любых размеров динамически без переинициализации
			  плеера.<br/>
			- Добавлена возможность настроить метод пропадания контролбара - затухание.<br/>
			- Если в плеере включено пропадание контролбара, он будет появляться во время паузы.<br/>
			- Добавлена поддержка управления клавишами: пробел - пауза, вверх / вниз - регулирование громкости.<br/>
			- Двойной клик по плееру переводит его в полноэкранный режим и назад.<br/>
		</li>
		<li>
			В настройках плеера добавилась возможность указать слот видео по умолчанию. Ранее если у пользователя в
			локальном хранилище не было сохранено выбранного слота, плеер выбирал первый доступный слот как основной.
			Сейчас это настраиваемо.
		</li>
		<li>
			В настройках плеера добавилась возможность выключить запоминание выбранного слота в локальном хранилище.
			Поведение плеера по умолчанию запоминает выбранный слот видео (например, HD) и при открытии другого видео,
			если у него есть такой же слот, - то этот слот будет выбран по умолчанию. Новая опция позволяет выключить
			это поведение.
		</li>
		<li>
			Добавилась поддержка нового вида рекламы, которая показывается по центру плеера в случае наведения мышки на
			плеер и в течение всего времени нахождения мышки над плеером.
		</li>
		<li>
			Появилась возможность задать угол логотипа в плеере. Ранее можно было задать только смещение от левого
			верхнего угла.
		</li>
		<li>
			В JS API плеера добавилась возможность перехватывать клик по рекламному тексту на контролбаре и
			реализовывать свою логику на JS.
		</li>
		<li>
			Кол-во слотов плеера расширено до 7.
		</li>
		<li>
			Выполнена интеграция с проектом videoswiper.com. Сайт videoswiper.com позволяет добавлять видео в KVS из
			огромной базы данных, используя либо embed коды, либо скачивание видеофайлов к себе на сервер.
		</li>
		<li>
			Оптимизировано поведение движка конвертации при копировании файлов. Появилась возможность настроить
			копирование файлов на сервера хранения прямо с серверов конвертации, что позволяет значительно сократить
			нагрузку на винчестер главного сервера, а также сократить время обработки контента. Данная опция не
			включается по умолчанию: для ее включения необходимо обновить скрипт <b>remote_cron.php</b> на сервере
			конвертации и включить галочку в настройках сервера конвертации в панели администрирования.
		</li>
		<li>
			Добавлена поддержка перенарезки обзорных скриншотов видео при наличие исходных файлов.
		</li>
		<li>
			Добавлены галочки для запуска перенарезки обзорных скриншотов и форматов видео на странице редактирования
			видео в панели администрирования. Данные галочки доступны только при наличии исходного файла видео. Теперь
			при замене исходного файла можно очень быстро и удобно запустить пересоздание всех файлов видео.
		</li>
		<li>
			Добавился лог фоновых задач, куда попадают все фоновые задачи после их завершения или удаления. Улучшена
			связь между фоновыми задачами создания контента и самим контентом. Так, при удалении фоновой задачи
			создания видео или альбома, соответствующий объект контента переводится в статус ошибки, а не зависает в
			статусе "в процессе" как было ранее. На списке видео и альбомов в панели администрирования появилась
			возможность перезапустить обработку для контента со статусом "ошибка" как вручную, так и массово. Ранее при
			удалении фоновых задач создания контента, перезапустить их уже не было возможности, приходилось удалять
			контент и загружать его заново.
		</li>
		<li>
			Добавлена очистка рабочих директорий на серверах конвертации при удалении фоновых задач, которые уже успели
			скопироваться на сервера конвертации. Отсутствие такой очистки иногда приводило к долгому зависанию сервера
			конвертации, если на нем скопилось много задач, которые в реальности были удалены.
		</li>
		<li>
			Добавлено концептуальное изменение в логике работы защиты от перегрузки базы данных, что позволяет
			значительно снизить нагрузку на базу данных для высоконагруженных проектов. Данное новшество требует
			отдельной настройки, поэтому мы рекомендуем всем, кто испытывает проблемы с нагрузкой на базу данных,
			обратиться в службу поддержки за помощью.
		</li>
		<li>
			При удалении контента будет сбрасываться кэш его страницы просмотра. Ранее страница с контентом оставалась
			закэшированной до момента инвалидации кэша.
		</li>
		<li>
			Также исправлена старая проблема с кэшированием комментариев, когда после добавления нового комментария он
			не показывается на сайте из-за кэша.
		</li>
		<li>
			Добавлена поддержка данных локализации в импорте, экспорте и фидах.
		</li>
		<li>
			В настройках языков локализации появилась возможность указать область применения локализации языка:
			название и описание, либо только название. Выбранное значение влияет на видимость полей перевода описаний,
			а также на различные фильтры по наличию / отсутствию перевода для объектов в панели администрирования.
		</li>
		<li>
			В импорте / экспорте видео и альбомов добавилась возможность выбирать поле URL контент провайдера.
		</li>
		<li>
			В экспорте видео и альбомов появилась возможность включать вывод строки с названиями полей данных.
		</li>
		<li>
			В фидах импорта добавлена поддержка премиум видео.
		</li>
		<li>
			В CSV фидах экспорта можно указывать статические значения для любого поля через static:&lt;значение&gt;.
			При указании такого столбца фид выведет &lt;значение&gt; для каждой строки.
		</li>
		<li>
			В фиды экспорта добавилась возможность наряду с желаемой шириной embed плеера передавать и желаемую высоту
			embed плеера. Таким образом, можно получить embed коды как с полностью фиксированным размером, так и
			фиксированные по ширине либо по высоте.
		</li>
		<li>
			В разделе статистики появилась возможность более детального разграничения доступа администраторов по
			привилегиям.
		</li>
		<li>
			Появилась возможность удалять поисковые запросы из статистики поисковых запросов.
		</li>
		<li>
			В персональных настройках добавлена возможность включить / выключить отображение плеера с видео на странице
			редактирования видео в панели администрирования.
		</li>
		<li>
			Добавлена поддержка клавишных нажатий для кнопок "Сохранить" (Ctrl+S) и "Сохранить и закрыть"
			(Ctrl+Shift+S). В персональных настройках добавлена возможность указать порядок кнопок сохранения, что
			позволяет сделать первым доступным действием "Сохранить и открыть след.".
		</li>
		<li>
			Добавлена возможность удалить пользователя со всем контентом в один клик.
		</li>
		<li>
			Плагин автоподбора категорий расширен возможностью подбора категорий по тэгам.
		</li>
		<li>
			В модели добавлены новые поля данных: Страна, Город, Штат.
		</li>
		<li>
			В учете трафика по реферерам изменилась логика сравнения, если в качестве реферера указана часть URL-а без
			http. В этом случае учитывается не сайт, с которого пришел пользователь, а URL страницы, на которую он
			пришел. Это позволяет учитывать трафик от партнеров, которые присылают его на ваш сайт, указывая свой
			параметр, например http://domain.com?from=username. При этом трафик может идти с разных ресурсов. Чтобы
			весь такой трафик учитывался под одним реферером, вам необходимо указать <b>from=username</b> в его поле
			URL.
		</li>
		<li>
			Переделана логика пагинации в случае несуществующих страниц - по ним теперь возвращаются 404 ошибки. Данная
			поправка может сказаться на работоспособности некоторых страниц сайта, поэтому по умолчанию она не включена
			в обновлении. Для включения необходимо обратиться в службу поддержки.
		</li>
		<li>
			В настройки доступа для страниц сайта добавилась возможность сделать страницы доступными только для
			вебмастеров и только для доверенных пользователей.
		</li>
		<li>
			В блоках <b>video_edit</b> и <b>album_edit</b> добавлена поддержка визуальной защиты от автосабмита.
		</li>
		<li>
			В блоке <b>video_edit</b> теперь можно показывать список каналов для загрузки видео в какой-либо из каналов
			сайта.
		</li>
		<li>
			В блоках <b>list_albums</b>, <b>list_videos</b> и <b>list_content</b> появилась возможность вывести
			контент, который был загружен пользователями из страны текущего посетителя.
		</li>
		<li>
			В блоках <b>list_albums</b>, <b>list_videos</b> и <b>list_content</b> добавился параметр
			<b>search_scope</b>, который позволяет настроить поиск только по названиям без поиска по описаниям.
		</li>
		<li>
			В блоках <b>list_albums</b>, <b>list_videos</b> и <b>list_content</b> при включенном поиске по категориям,
			тэгам и моделям поиск будет также производиться и по их синонимам (псевдонимам).
		</li>
		<li>
			При загрузке видео или альбома добавлена проверка, является ли разделителем тэгов пробел. KVS требует
			указания тэгов через запятую, но мы сталкивались с тем, что многие вставляют тэги, разделенные пробелами и
			они считаются одним тэгом. Теперь эта проблема должна решиться.
		</li>
		<li>
			В блок <b>list_content_sources</b> добавлены сортировки контент провайдеров по альбомам.
		</li>
		<li>
			В блоке <b>global_stats</b> добавлена возможность фильтрации по категории, т.е. показать статистику
			контента из какой-либо конкретной категории.
		</li>
		<li>
			В блоке <b>list_dvds</b> добавился параметр <b>var_section</b>, который позволяет создать алфавитный
			перечень каналов / DVD.
		</li>
		<li>
			В блоке <b>video_edit</b> добавилась поддержка задания отдельных ограничений максимальной длительности
			загружаемого видео для премиум пользователей и вебмастеров.
		</li>
		<li>
			В шаблонах стали доступны коды стран в переменной <b>$list_countries_codes</b>.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Во время клика по области проигрывания видео, если настроена рекламная ссылка - проигрывание не ставилось
			  на паузу.<br/>
			- При отображении слотов в плеере не учитывалось наличие файла видео, если у пользователя не было доступа к
			  данному формату. В результате слот отображался с рекламной ссылкой, хотя при наличии доступа этого слота
			  бы не было.<br/>
			- Рандомизация показа рекламы плохо работала, если на одной странице было несколько вставок одного и того
			  же рекламного места.<br/>
			- Уникальность видео через импорт не определялась корректно, если вместо ссылки на исходный файл видео
			  указывались ссылки на файлы форматов.<br/>
			- Не работал ресайз загружаемого изображения, если в имени файла были пробелы.<br/>
			- Не корректно работала пагинация по тэгу-числу.<br/>
			- Фиды экспорта не корректно отдавали размеры embed кодов для хотлинкованных видео.<br/>
			- При загрузке на сайте видеофайлов через ссылки не обрезались HTTP параметры при формировании имени
			  файла.<br/>
			- При изменении директории объектов вручную в панели администрирования не осуществлялась их обработка, в
			  результате чего можно было получить неработающие ссылки.<br/>
			- В блоках списков некорректно работали <b>skip_xxx</b> и <b>show_xxx</b> параметры - они срабатывали, даже
			  если на список передается конкретный объект фильтра, в результате отображался пустой список. Например,
			  если в блоке <b>list_videos</b> был включен параметр <b>skip_categories</b> с каким-либо списком
			  категорий, то отображение списка видео этим блоком <b>list_videos</b> по любой из данных категорий
			  выводило пустой список.<br/>
			- В движке сайта при рефреше статуса пользователя не было сделано проверки на деактивацию пользователя.
			  Таким образом, если пользователь залогинился и после этого его деактивировали в панели администрирования
			  - пользователь мог продолжать пользоваться сайтом до окончания длительности его сессии.<br/>
			- Плагин статистики контента не учитывал некоторые типы видео контента в расчетах.<br/>
			- Исправлены некоторые недочеты в обработке фото галерей.<br/>
			- При проверке контента в плагине аудита не проверялись размеры исходников скриншотов, в результате чего
			  некоторые битые исходники могли остаться необнаруженными.<br/>
		</li>
	</ul>
	<h2 id="section_whats_new_3_2">KVS v3.2</h2>
	<h3 id="section_whats_new_3_2_0">KVS v3.2.0 [30.04.2013]</h3>
	<ul>
		<li>
			Добавилась базовая функциональность для подписок на каналы или пользователей сайта. В блоках
			<b>list_videos</b> и <b>list_albums</b> появился дополнительный режим, который позволяет вывести контент из
			своих подписок. Также добавился блок <b>list_members_subscriptions</b>, который позволяет вывести список
			своих подписок (или подписок указанного пользователя) и управлять ими.
		</li>
		<li>
			Добавлена поддержка разбиения каналов / DVD на группы. Основное назначение этой поправки - добавить
			поддержку полноценной трехступенчатой структуры контента, как, например, Сериал -> Сезоны -> Серии. Теперь
			в роли Сериалов могут использоваться группы каналов / DVD, которые имеют поддержку скриншотов с 2 разными
			размерами и возможность отдельного отображения на сайте в виде списка (блок <b>list_dvds_groups</b>) и
			страницы просмотра (блок <b>dvd_group_view</b>).
		</li>
		<li>
			Переработан плагин синонимайзера с целью более удобного ввода синонимов. Теперь в одной строке словаря
			можно просто перечислить список слов, которые являются взаимными синонимами и плагин будет заменять их в
			пределах своей группы. Это позволит значительно упростить задачу словаря.
		</li>
		<li>
			В массэдите видео и фотоальбомов появилась возможность изменить автора на одного из указанных в списке,
			выбранного случайным образом.
		</li>
		<li>
			Кол-во динамических HTTP параметров расширено до 5.
		</li>
		<li>
			В панели администрирования расширен набор столбцов на списке пользователей и предоставлена возможность
			настраивать их отображение в персональных настройках.
		</li>
		<li>
			На страницах редактирования видео / фотоальбомов в панели администрирования выпадающий список для статуса
			заменен на чекбокс (активный / неактивный).
		</li>
		<li>
			Поиск по шаблонам в панели администрирования начал искать и по параметрам конфигурации блоков. Тем самым по
			названию параметра можно найти все блоки на всех страницах, где этот параметр включен. Можно также искать и
			по значению параметра.
		</li>
		<li>
			При удалении фоновых задач создания новых форматов скриншотов или фотоальбомов происходит принудительная
			остановка движка. Ранее если такая задача запускалась, то она отрабатывала до конца (или до ошибки), даже
			если задача была удалена. Теперь при удалении такой задачи ее выполнение должно прекратиться.
		</li>
		<li>
			Добавлен новый плагин, который позволяет подсчитать место на жестком диске, занимаемое разными файлами
			контента.
		</li>
		<li>
			В панели администрирования в информации об установке добавилось отображение % использования memcache.
		</li>
		<li>
			Кол-во файловых доп. полей в контент провайдерах расширено до 10.
		</li>
		<li>
			В движок сайта добавилась поддержка pre_initialize_page_code.php скрипта, который вызывается в самом начале
			работы движка и позволяет заменять GET параметры, значения которых влияют на кэш сайта. Это может
			использоваться, например, чтобы в зависимости от значения флага в сессии пользователя показывать разные
			вариации одной и той же страницы, подменяя значение параметра в GET запросе.
		</li>
		<li>
			Во все блоки списка добавлен параметр <b>var_items_per_page</b>, который при включении позволяет
			динамически настраивать кол-во элементов на странице в списке.
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> добавилась поддержка параметра
			<b>var_category_group_ids</b>, который позволяет динамически передавать список групп категорий, из которых
			должен отображаться контент. Может использоваться для настройки не-отображения каких-либо групп категорий,
			например "для взрослых".
		</li>
		<li>
			В блоках <b>list_videos</b> и <b>list_albums</b> при отображении контента по нескольким категориям или
			группам категорий при помощи параметров <b>var_category_ids</b> или <b>var_category_group_ids</b>,
			появилась возможность использовать логику "И" вместо логики "ИЛИ", которая используется по умолчанию. Для
			этого в качестве одного из элементов списка требуется передать ключевое слово <b>all</b>.
		</li>
		<li>
			Добавился учет показов фотографий альбомов, если они открываются на разных страницах (в случае динамической
			подгрузки их на одной странице показ будет засчитан только главной фотографии альбома). Информацию о кол-ве
			просмотров можно использовать в блоке <b>list_album_images</b> для сортировки.
		</li>
		<li>
			В блоках списка видео, фотоальбомов и моделей добавилась поддержка параметра
			<b>search_redirect_disabled</b> для опционального выключения редиректа, который происходит по умолчанию,
			если в результатах поиска только 1 элемент. Этот параметр следует включить, если у вас на одной странице
			реализован поиск одновременно по видео, фотоальбомам и, возможно, моделям.
		</li>
		<li>
			В блок <b>list_albums</b> добавлена псевдослучайная сортировка.
		</li>
		<li>
			В блок <b>list_playlists</b> добавился глобальный режим, который позволяет выводить глобальный список
			плэйлистов пользователей.
		</li>
		<li>
			В блоке <b>random_video</b> добавилась поддержка рейтинга и флаггирования видео.
		</li>
		<li>
			В блоке <b>list_content</b> добавился набор параметров <b>show_xxx_info</b>, которые позволяют расширить
			набор выбираемых данных о контенте.
		</li>
		<li>
			В блоке топа поисковых запросов появилась возможность указывать период в днях для отображения топа запросов
			за этот период.
		</li>
		<li>
			В сессию пользователя добавилась вся информация о нем.
		</li>
		<li>
			Добавлена обновленная версия документации по настройкам KVS.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Тестирование отдачи с сервера работало некорректно, если использовался кастомный параметр стриминга.<br/>
			- X-bill: периодические запросы со стороны биллинга приводили к отображению ошибок в логе, должны
			  игнорироваться.<br/>
			- При добавлении нового сервера в группу с контентом проверка наличия контента не давала понять в чем
			  проблема и не давала сохранить сервер. Поправлено, чтобы сервер сохранялся, но отображал ошибку, с
			  которой можно разобраться на странице тестирования отдачи.<br/>
			- Проверка email на корректность устарела, была значительно упрощена.<br/>
			- Зацикливание движка конвертации при удалении серверов конвертации во время активной фазы работы
			  движка.<br/>
			- Защита видео контента по рефереру срабатывала для своих субдоменов.<br/>
			- Сортировка категорий не по алфавиту в панели администрирования.<br/>
			- Баг с неправильной ссылкой в отдельном блоке <b>pagination</b> при использовании префикса страниц.<br/>
		</li>
	</ul>
	<h2 id="section_whats_new_3_1">KVS v3.1</h2>
	<h3 id="section_whats_new_3_1_1">KVS v3.1.1 [18.03.2013]</h3>
	<ul>
		<li>
			Добавилась поддержка голосования за комментарии, а также возможность редактирования и удаления своих
			комментариев.
		</li>
		<li>
			В панели администрирования со списка комментариев появилась возможность перейти на страницу просмотра, где
			был оставлен комментарий.
		</li>
		<li>
			Количество доп. полей пользователей было расширено до 10.
		</li>
		<li>
			Добавилась поддержка SMS биллинга x-bill.ru.
		</li>
		<li>
			В блоке обратной связи появилась возможность сделать email обязательным полем.
		</li>
		<li>
			Добавился скрипт редиректа на случайной альбом (<b>/redirect_random_album.php</b>) по аналогии с таким же
			скриптом для видео.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Плеер по умолчанию использовал размеры превью изображения, если метаданные видео не содержали информации
			  о размерах. Это могло приводить к отображению видео с некорректными пропорциями.<br/>
			- Обновлена сторонняя библиотека для работы с ZIP архивами. В обновлении исправлена проблема с нехваткой
			  памяти при работе с большими архивами.<br/>
			- Исправлена проблема, которая могла приводить к зависанию задач на серверах конвертации. Если по каким-то
			  причинам ffmpeg "вылетает" во время конвертации, движок завершит задачу с ошибкой после 2 попыток.<br/>
			- Стандартные embed коды не работали для деактивированного видео.<br/>
			- На проектах-сателлитах не подхватывались настройки мемберзоны, сохраненные на главном проекте.<br/>
		</li>
	</ul>
	<h3 id="section_whats_new_3_1_0">KVS v3.1.0 [05.03.2013]</h3>
	<ul>
		<li>
			Добавилась возможность задавать стоп-слова и замену для них, чтобы пользователи не могли запостить
			информацию, которая содержит запрещенные для вашего сайта слова. При обработке данных от пользователей KVS
			заменяет все найденные стоп-слова на указанный заменитель. Стоп-слова также влияют и на поиск - из
			поискового запроса удаляются все стоп-слова, чтобы они не попали в статистику и не показывались у вас на
			сайте.
		</li>
		<li>
			Небольшие улучшения по фидам импорта:<br/>
			- В настройках фида импорта добавилась возможность установить флаг "требует проверки" для всех добавляемых
			  видео.<br/>
			- Добавилась поддержка импорта ваших ref-ссылок для контент провайдеров и импорта групп контент
			  провайдеров, если такая информация присутствует в данных фида (CSV формат).<br/>
			- Добавилась возможность запускать любые фиды вручную.<br/>
			- Добавилась поддержка указывать ключевое поле без привязки к данным видео.<br/>
		</li>
		<li>
			В форматах альбомов появилась возможность выбирать опцию ресайза с фиксированной высотой, но динамической
			шириной. При выборе этой опции высота всех изображений формата будет фиксированная.
		</li>
		<li>
			Изменилось поведение движка при создании тумб в ситуациях, когда размеры исходного изображения меньше, чем
			требуются для формата. В этом случае движок будет делать увеличение исходного изображения до нужных
			размеров (апскэйл). Изменение затрагивает скриншоты видео и фотографии альбомов.
		</li>
		<li>
			Для премиум доступа по токенам появилась возможность установить лимит на доступность купленного контента
			(через какое кол-во дней доступ прикроется).
		</li>
		<li>
			Появилась возможность отмены транзакции покупки токенов. В этом случае кол-во доступных пользователю
			токенов уменьшится на число токенов транзакции, а если этого недостаточно - то будет автоматически прикрыт
			доступ к некоторому купленному контенту для восстановления баланса.
		</li>
		<li>
			Добавился блок <b>upgrade</b>, который предназначен для получения премиум доступа стандартными
			зарегистрированными пользователями, а также для покупки токенов. Ранее возможность апгрейда профиля до
			премиум статуса была доступна в блоке <b>signup</b>, с 3 ветки эта функциональность была удалена из него.
		</li>
		<li>
			В блоках <b>video_edit</b> / <b>album_edit</b> появилась возможность параметрами блока настроить
			максимальное кол-во категорий (ранее нельзя было указать более 3 категорий).
		</li>
		<li>
			Полностью изменилась концепция JS API плеера, благодаря чему появилась возможность удобной интеграции
			JS / HTML рекламы любого вида. Информация по новому API доступна в публичной документации плеера.
		</li>
		<li>
			Добавились JS обработчики для событий изменения формата в плеере, которые позволяют вместо переключения
			формата или редиректа выполнить кастомный JS код - например, показать пользователю всплывающее окно с
			информацией о покупке доступа.
		</li>
		<li>
			В плагине обновления появилась опция отмены на первом шаге, когда показывается общая информация об
			обновлении.
		</li>
		<li>
			В блоке <b>list_content</b> появилась возможность динамической фильтрации по группе контент провайдеров.
		</li>
		<li>
			Завершилось обновление мануала по основам KVS, теперь он полностью приведен в соответствие.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Проблемы с локализацией во всплывающем окне в блоке <b>video_edit</b>.<br/>
			- Если в плеере была настроена ссылка при клике на область проигрывания - при клике проигрывание не
			  останавливалось.<br/>
			- В плеере при попытке повторить проигрывание через JS API ничего не происходило.<br/>
			- Для MP4 файлов не всегда корректно работала проверка стриминга на серверах хранения, из-за чего
			  появлялась ложная ошибка.<br/>
			- Плеер не загружался, если указать его размеры в процентах (например, 100%).<br/>
			- Ротатор не учитывал клики, если на страницу не передавалась директория видео.<br/>
			- Блок <b>list_playlists</b> в случае использования <b>pull_videos</b> убирал дубликаты из списков видео,
			  чего по логике делать не требуется.<br/>
		</li>
	</ul>
	<h2 id="section_whats_new_3_0">KVS v3.0</h2>
	<h3 id="section_whats_new_3_0_3">KVS v3.0.3 [10.02.2013]</h3>
	<ul>
		<li>
			В CSV фидах экспорта добавился вывод embed кодов во всех возможных случаях. Ранее embed коды выводились
			только теми фидами экспорта, в настройках которых стоял тип контента <b>Embed код</b>.
		</li>
		<li>
			В CSV фидах экспорта появилась возможность вывести URL контент провайдера (ранее только название).
		</li>
		<li>
			В логе аудита появились ссылки на объекта.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- При загрузке видео с сайта не устанавливались категории.<br/>
			- В настройках серверов хранения поле <b>Использовать нестандартный HTTP параметр стриминга</b> не было
			  доступно для типа стриминга <b>Nginx</b>.<br/>
			- Плагин анализа лога аудита тормозил на больших данных.<br/>
			- Не отображался аватар в блоке list_members_blog.<br/>
			- Некорректное отображение исходных скриншотов в панели при больших размерах исходного видео.<br/>
		</li>
	</ul>
	<h3 id="section_whats_new_3_0_2">KVS v3.0.2 [06.02.2013]</h3>
	<ul>
		<li>
			Исправлены следующие баги:<br/>
			- Chrome не воспроизводил видео в случае использования во флэшевом embed плеере формата видео, который
			  разрешен для скачивания.<br/>
			- В версии 3.0 перестали работать JS функции управления плеером из-за одинакового значения id, которое
			  устанавливалось как на плеер, так и на его контейнер.<br/>
		</li>
	</ul>
	<h3 id="section_whats_new_3_0_1">KVS v3.0.1 [15.01.2013]</h3>
	<ul>
		<li>
			В блоке <b>list_videos</b> при отображении своих загруженных видео добавлена возможность массово изменить
			тип
			выбранных видео с личного на публичный и наоборот.
		</li>
		<li>
			В блоке <b>list_messages</b> при отображении переписки с пользователем добавлена поддержка быстрого ответа.
		</li>
		<li>
			В блоках <b>video_view</b> и <b>album_view</b> в функциональности "отправить ссылку другу" добавлена
			поддержка нескольких email адресов, разделенных запятыми.
		</li>
		<li>
			На списках видео / альбомов в панели администрирования добавлены фильтры по локализации.
		</li>
		<li>
			Исправлены следующие баги:<br/>
			- Поиск по шаблонам не учитывал шаблоны глобальных блоков.<br/>
			- Локализация не работала корректно при ajax запросах.<br/>
			- Новые версии ffmpeg перестали поддерживать опцию -sameq.<br/>
			- Плагин генерации аватаров не логгировал ошибки.<br/>
		</li>
	</ul>
	<h3 id="section_whats_new_3_0_0">KVS v3.0.0 [17.12.2012]</h3>
	<h4>Движок конвертации и хранения</h4>
	<ul>
		<li>
			Полностью переделана интеграция с CDN. Если раньше KVS поддерживала фиксированный набор CDN провайдеров, то
			теперь можно подключить любого CDN провайдера. Для этого достаточно реализовать набор типовых функций
			(API для данного CDN).
		</li>
		<li>
			Реализована функция полной проверки отдачи контента с сервера хранения. Если раньше для каждого сервера
			были доступны отдельные опции "проверить прямую ссылку", "проверить защищенную ссылку" и "проверить
			стриминг", то сейчас эти опции заменены одной опцией, которая в автоматическом режиме проверяет отдачу всех
			возможных файлов с сервера и даже работу стриминга. Все проверки учитывают различные настройки защиты:
			например, прямые ссылки на видеофайлы не должны работать, прямые ссылки на файлы форматов альбомов должны
			работать только для тех форматов, которые доступны публично и т.д. Этот механизм позволяет с легкостью
			проверить настройки любого сервера хранения.
		</li>
		<li>
			Улучшена интеграция удаленных серверов конвертации с главным сервером. На главном сервере по каждому
			серверу конвертации можно посмотреть не только лог, но и ответы всех библиотек, которые используются на
			данном сервере конвертации. Также добавлена возможность указывать смещение во времени, чтобы избежать
			ложных ошибок о неработоспособности серверов конвертации, если время на них отличается от основного.
		</li>
		<li>
			В форматы видео наряду с возможностью переопределять ватермарки для разных спонсоров через доп. поля
			контент провайдеров добавлена похожая возможность переопределять ограничение длительности для разных
			спонсоров.
		</li>
		<li>
			В случае создания трейлеров, состоящих из нескольких частей, добавилась галочка, которая позволяет создать
			последнюю часть с конца видео. Ранее такой возможности не было, и последняя часть трейлера создавалась с
			начала последнего фрагмента, что не всегда является желаемым поведением.
		</li>
		<li>
			Оптимизировано создание большого кол-ва одинаковых трейлеров с разными опциями качества. Выигрыш по времени
			очень существенный!
		</li>
		<li>
			При пересоздании какого-либо формата видео через массовое редактирование появилась опция выключить
			наложение ватермарка для данной операции. Эта опция имеет смысл, если в качестве исходного файла видео
			выступает один из существующих форматов, на который уже наложен ватермарк - таким образом, не произойдет
			наложение ватермарка повторно.
		</li>
		<li>
			Добавлена возможность удалить таймлайновые скриншоты для любого формата видео, где их создание выключено.
			Это может потребоваться для увеличения свободного места, если таймлайновые скриншоты вам больше не нужны.
		</li>
		<li>
			Полностью переделан движок по созданию тумб скриншотов и фотоальбомов. Снижено количество промежуточных
			вызовов ImageMagick, исправлена проблема с качеством сжатия получаемых скриншотов / изображений.
		</li>
		<li>
			Улучшено логгирование всех фоновых задач движка конвертации. Также реализован учет % выполнения для всех
			задач (ранее % показывался только по задачам, которые работали над группой контента). Теперь можно видеть
			% выполнения задачи создания нового видео, например.
		</li>
		<li>
			В форматы скриншотов добавлена вторая строка опций ImageMagick, которая используется только для скриншотов,
			которые загружаются вручную. Ранее для загруженных вручную скриншотов происходил только ресайз и наложение
			ватермарка, что не позволяло никаким образом производить пост-обработку для загруженных вручную скриншотов.
			Сейчас такой проблемы не осталось.
		</li>
		<li>
			Добавилась возможность создать формат скриншотов с размером исходника видео (то есть такие скриншоты будут
			иметь разный размер в зависимости от размеров исходного видео). Для этого в качестве размера скриншотов
			нужно использовать специальное слово <b>source</b>.
		</li>
		<li>
			Каждая фоновая задача теперь имеет свой отдельный лог.
		</li>
	</ul>
	<h4>Платный доступ</h4>
	<ul>
		<li>
			Введена поддержка токенов в качестве альтернативы премиум доступу, ограниченному по времени. Токены
			доступны для стандартных (не премиум) пользователей и могут быть как куплены через интеграцию с платежной
			системой, так и "заработаны" за какие-то действия в мемберзоне. Пользователи могут использовать доступные
			у них токены для покупки премиум доступа к контенту. При этом статус пользователя будет оставаться
			стандартным, но к купленному контенту у них будет доступ как у премиум пользователей. Таким образом,
			концепцию токенов можно использовать одновременно с концепцией премиум доступа, ограниченного по времени.
		</li>
		<li>
			Добавлена страница настроек мемберзоны, на которой можно включить возможность использовать токены для
			покупки доступа к стандартным / премиум видео и фотоальбомам, а также указать стоимость по умолчанию для
			этих 4 групп контента. Для каждого видео или фотоальбома в отдельности можно переопределить его стоимость
			на странице редактирования или через массовое редактирование.
		</li>
		<li>
			На странице настроек мемберзоны также добавлена возможность настроить награды пользователям за действия в
			мемберзоне (кол-во зарабатываемых токенов за каждое действие): регистрация на сайте, загрузка аватара,
			отправка комментария (с минимальным ограничением длины), загрузка видео (с минимальным ограничением
			длительности), создание фотоальбома (с минимальным ограничением кол-ва фотографий).
		</li>
		<li>
			Для мемберов на сайте можно вывести списки купленных ими видео и фотоальбомов.
		</li>
		<li>
			Реализована давно ожидаемая возможность настраивать относительные даты появление контента в зависимости от
			даты регистрации пользователей. Эта возможность включается через системный конфиг, поскольку она сильно
			изменяет поведение сайта и панели администрирования, и по умолчанию она выключена. В случае включения, у
			вас появится возможность указывать смещение в днях относительно регистрации как в положительную сторону
			(номер дня после регистрации, например <b>1</b> означает, что контент станет доступен сразу после
			регистрации, <b>10</b> означает, что такой контент станет доступен на 10-й день после регистрации), так и в
			отрицательную сторону :=) Последнее означает, что такой контент будет виден еще до регистрации (т.е.
			незалогиненным пользователям), а его дата появления будет показываться в зависимости от текущей даты на
			сервере. Например, контент с датой публикации <b>-10</b> всегда будет показываться как добавленный 10 дней
			назад независимо от текущей даты. Относительные даты появления контента могут использоваться одновременно
			с абсолютными датами, так что часть контента может использовать одну концепцию, вторая часть - другую.
		</li>
		<li>
			Реализована возможность интегрировать сайт KVS с любой партнеркой, которая работает через .htpasswd файлы.
			Теперь можно без проблем мигрировать любую партнерку на KVS - для входа в мемберзону нужно организовать
			логин через специальный скрипт, который следует положить в папку, закрытую через .htpasswd. Данный скрипт
			при необходимости создаст пользователя в базе KVS и залогинит его. При этом никаких изменений в концепции
			работы партнерки не требуется, только ваш старый сайт заменится новым сайтом на KVS.
		</li>
		<li>
			В блоке регистрации при настройке платного доступа через биллинги кредитных карт добавлена возможность
			использовать сгенерированные логин и пароль, чтобы не требовать от пользователя их ввода. Тогда форма
			регистрации сократится до простого выбора пакета доступа.
		</li>
		<li>
			Концепция логгирования биллингов полностью изменена в новой версии. Лог всех событий сохраняется в базу
			данных, что позволяет сделать возможность выборок с фильтрами.
		</li>
	</ul>
	<h4>Мультиязычность сайта и контента</h4>
	<ul>
		<li>
			Добавлена поддержка мультиязычности контента, что является, наверное, одним из самых объемных изменений
			новой версии. В панели администрирования можно создавать дополнительные языки и добавлять переведенные
			названия и описания для контента и всех объектов категоризации. Добавлен отдельный интерфейс перевода
			объектов, а также возможности перевода видео и альбомов прямо на страницах их редактирования.
		</li>
		<li>
			В движок сайта внесены изменения, которые позволяют сайту работать в режиме одного из дополнительных
			языков. При этом 100% наличия переводов не требуется, если какие-то объекты не были переведены - по ним
			будут показываться их основные названия и описания. Кроме локализации данных, в движок добавлена поддержка
			локализации шаблонов путем создания языковых файлов с переведенными текстовками. Реализация мультиязычного
			сайта может быть выполнена по нескольким подходам, которые описаны в документации.
		</li>
		<li>
			Блоки комментариев на сайте стало возможно перевести на отображение только комментариев из текущей локали -
			для каждого комментария запоминается локаль, в которой он был отправлен. Эта возможность по умолчанию
			выключена, таким образом блоки будут по умолчанию отображать все комментарии.
		</li>
		<li>
			Добавился плагин анализа лога аудита, который кроме отображения суммарной статистики по действиям
			работников-администраторов, может также использоваться для учета работы переводчиков. Все действия по
			переводу попадают в лог аудита, что позволяет высчитать кол-во переведенных символов за любой промежуток
			времени.
		</li>
	</ul>
	<h4>Фотоальбомы</h4>
	<ul>
		<li>
			Наконец-то мы вынесли хранение фотоальбомов на аналогичную архитектуру хранения, как и для видео. Теперь
			можно создать отдельную группу серверов (у каждой группы серверов появился тип: видео или фотоальбомы)
			для хранения всех файлов фотоальбомов: исходников, форматов и ZIP архивов.
		</li>
		<li>
			Обработка фотоальбомов вынесена на сервера конвертации.
		</li>
		<li>
			Добавлена возможность загрузки нескольких фотографий по одной, а не только в ZIP файле.
		</li>
		<li>
			Функциональность фотоальбомов в панели администрирования практически сравнялась с функциональностью по
			видео: добавлена поддержка режима "дескописателя", добавлена возможность отображения фотографий на главной
			странице редактирования фотоальбома, расширен набор фильтров на списке.
		</li>
		<li>
			Добавлена поддержка импорта фотогалерей.
		</li>
	</ul>
	<h4>Плеер</h4>
	<ul>
		<li>
			Добавлена базовая поддержка HTML5 режима. HTML5 режим может использоваться в случае проигрывания MP4
			файлов и включается автоматически при отсутствии поддержки Flash у пользователя.
		</li>
		<li>
			В настройках плеера появилась возможность выбирать режим embed кода: iframe (поддерживает HTML5) или
			типовой embed код (только Flash). Эта настройка влияет на все embed коды, которые генерируются KVS.
		</li>
		<li>
			В случае наличия выпадающего списка с форматами качества плеер будет запоминать выбранный пользователем
			формат и автоматически выбирать его для других видео.
		</li>
		<li>
			При наведении на кликабельный логотип происходит его небольшое размытие как индикатор кликабельности.
		</li>
		<li>
			Устранены некоторые существенные проблемы, которые ранее были анонсированы патчем.
		</li>
	</ul>
	<h4>Импорт контента и фиды</h4>
	<ul>
		<li>
			Удобство импорта: добавлены останавливаемые фоновые задачи и защита от переполнения HDD на главном сервере.
			Теперь после начала импорта вы можете видеть фоновую задачу, которая показывает % выполнения импорта и
			имеет свой лог. Вы можете удалить задачу, что приведет к остановке процесса импорта. В случае, если на
			главном сервере заканчивается свободное место (можно настроить лимит), процессы импорта приостанавливаются
			до тех пор, пока место не освободится. Такое может случаться в случае импорта большого объема данных, когда
			исходные файлы временно скачиваются на сервер для последующей обработки.
		</li>
		<li>
			Данные всех импортов сохраняются на файловой системе. При необходимости вы можете найти данные, которые
			вы импортировали ранее.
		</li>
		<li>
			Добавлена опциональная проверка ссылок на дубликаты, что позволяет защититься от повторного импорта одного
			и того же контента (если он импортируется по тем же ссылкам, что и ранее).
		</li>
		<li>
			Добавлено использование синонимов категорий и псевдонимов моделей при импорте контента. Теперь новые
			категории / модели не будут создаваться, если уже есть другие категории / модели с такими синонимами /
			псевдонимами.
		</li>
		<li>
			В случае импорта псевдо видео добавилась возможность определять длительность и создавать скриншоты на
			основе ссылки на видеофайл. Это позволяет создавать сайты с одинаковым контентом, но с разным набором
			скриншотов и редиректом на главный сайт.
		</li>
		<li>
			Изменена логика определения дубликатов видео в фидах импорта. В старых версиях для составления уникального
			ключа импортированного видео использовался домен фида, что приводило к проблемам, если на одном домене
			работают несколько разных фидов, которые отдают разные видео с одинаковыми идентификаторами. В новой версии
			мы сделали возможность управлять этим аспектом: теперь для каждого фида импорта нужно указывать ключевую
			строку, которая будет использоваться для определения дубликатов. Таким образом вы сами сможете полностью
			контролировать поведение фида при определении дубликатов.
		</li>
		<li>
			Концепция логгирования фидов импорта полностью изменена. Лог всех событий сохраняется в базу данных, что
			позволяет сделать возможность выборок с фильтрами.
		</li>
		<li>
			В фиды экспорта добавлена поддержка фильтров по длительности, возможности выдавать только видео, ротация
			скриншотов которых была завершена, возможности выдавать временные ссылки на видео.
		</li>
	</ul>
	<h4>Движок сайта</h4>
	<ul>
		<li>
			Появилась возможность создавать глобальные блоки - блоки, которые не привязаны к конкретной странице. Такие
			блоки имеют глобальные настройки и один шаблон, что позволяет одним махом изменять их, чтобы сразу
			затронуть все страницы сайта, где эти блоки используются. Область применения - блоки с одинаковым контентом
			на разных страницах сайта (например, глобальный список тэгов или категорий, который отображается на каждой
			странице). Если раньше для этого приходилось на каждой странице вставлять отдельный блок и дублировать его
			настройки для каждой страницы, то теперь настройки можно указать в глобальном блоке. В случае необходимости
			изменения этих настроек в будущем, их требуется изменить только в 1 месте.
		</li>
		<li>
			Добавилась поддержка группировки страниц сайта по префиксу в названии.
		</li>
		<li>
			Для каждой страницы сайта появилась возможность выключить ее в любой момент времени, а также настроить
			уровень доступа пользователя для открытия этой страницы.
		</li>
		<li>
			Во всех шаблонах стал доступен список стран. Также мы собрали иконки флагов всех стран и можем предоставить
			их по требованию (по умолчанию они не включены в продукт).
		</li>
		<li>
			Исправлены некоторые проблемы с подключением trade-движков.
		</li>
	</ul>
	<h4>Социалка</h4>
	<ul>
		<li>
			Пользователи могут создавать свои каналы и управлять ими. Для каждого канала они могут выбирать круг лиц,
			которые могут постить видео в канал: все пользователи, только друзья или только сам владелец канала.
		</li>
		<li>
			Появилась возможность использовать флаги для каналов.
		</li>
		<li>
			Добавлен новый тип данных - плэйлисты. Пользователи могут создавать свои плэйлисты и управлять ими.
			Добавлена поддержка нескольких типов закладок, которые вы можете использовать на сайте по своему желанию.
			При добавлении видео в закладки появляется возможность сделать выпадающий список, где пользователи могут
			выбрать в какой тип закладок добавить либо выбрать один из плэйлистов. Пользователи также могут перемещать
			видео между своими плэйлистами.
		</li>
		<li>
			Добавлена концепция доверенных пользователей, любые действия которых не требуют проверки администратором.
		</li>
		<li>
			Добавлена возможность показывать историю просмотров контента любого пользователя.
		</li>
		<li>
			Пользователи могут заполнять / изменять свое статус сообщение. Изменение статус сообщения отражается в
			событиях сайта.
		</li>
		<li>
			В массовых рассылках добавлена возможность фильтровать адресатов рассылки по статусу: всем активным, только
			премиум пользователям или только вебмастерам.
		</li>
		<li>
			При регистрации добавлена возможность указать свой ник (в дополнение к логину). Ранее возможность изменять
			ник была доступна только после регистрации на странице редактирования профиля.
		</li>
	</ul>
	<h4>Комментарии</h4>
	<ul>
		<li>
			Структура хранения комментариев полностью изменена, а сам раздел комментариев перенесен в раздел
			пользователей в панели администрирования. Теперь комментарии по всем объектам отображаются в одном списке.
			Это изменение также позволило убрать тормоза с блока <b>list_comments</b>, который выводит глобальный блок
			комментариев на сайте.
		</li>
		<li>
			Анонимные пользователи теперь могут опционально подписывать свои комментарии.
		</li>
		<li>
			Добавлена поддержка смайлов и bb-кода.
		</li>
		<li>
			Для каждого блока комментариев появилась возможность настроить, требуют ли проверки комментарии от
			зарегистрированных пользователей.
		</li>
	</ul>
	<h4>Панель администрирования и юзабилити</h4>
	<ul>
		<li>
			Самое главное улучшение версии - опция включения доступа для службы поддержки вынесена на страницу старта
			:=)
		</li>
		<li>
			Плагин обновления - мы решили отказаться от идеи последовательных обновлений для вашего удобства. Теперь
			для обновления версии 3.x на любую 3.y будет достаточно провести процедуру 1 раз, при этом плагин будет
			лишь требовать выполнение тех шагов, которые актуальны для вашей текущей версии.
		</li>
		<li>
			На странице логина в панель случае неправильного введения данных показывается число оставшихся попыток
			перед срабатыванием защиты от перебора.
		</li>
		<li>
			На любых списках панели администрирования можно выбрать множество объектов в 2 клика. Для этого выберите
			самый верхний чекбокс из требуемых, затем кликните на самом нижнем удерживая клавишу Shift. Автоматически
			выберутся все объекты внутри интервала.
		</li>
		<li>
			Массовое редактирование видео и фотоальбомов теперь можно запустить по отфильтрованному множеству объектов,
			даже если они все не отображаются на одной странице. Вам теперь не нужно перенастраивать кол-во
			отображаемых элементов на списке, чтобы запустить массовое редактирование по 100500 отфильтрованным
			объектам. Просто настройте фильтр и воспользуйтесь отдельной опцией.
		</li>
		<li>
			При выборе категорий / моделей теперь можно создавать новые категории / модели сразу на странице
			редактирования. Для этого просто впишите название нового объекта и выберите соотв. опцию в выпадающем
			списке (новый объект). При сохранении видео / фотоальбома произойдет автоматическое создание нового
			объекта категоризации. Также теперь можно копипастить список категорий и моделей, разделенный запятыми,
			прямо в текстовое поле - ранее такое было возможно только для тэгов.
		</li>
		<li>
			На страницах редактирования объектов, которые поддерживают категоризацию, добавлено отображение флагов
			данного объекта с возможностью удалить их. Ранее удаление флагов было возможно только через массовое
			редактирование.
		</li>
		<li>
			Добавлена возможность массового переименования тэгов на списке тэгов.
		</li>
		<li>
			Статистика теперь учитывает суммарно кол-во заходов на страницы видео и альбомов (ранее - только по видео).
		</li>
		<li>
			Массовое редактирование: добавлена возможность обнуления рейтинга, добавлена возможность сменить владельца
			контента (администратора, который является владельцем контента). Последнее может использоваться для
			распределения контента между контент менеджерами с целью исключить какие-либо пересечения в их работе.
			Для этого в настройках профиля администратора KVS позволяет ограничить доступ только к контенту, владельцем
			которого является данный администратор.
		</li>
		<li>
			Добавлены новые фильтры у видео и фотоальбомов, добавлены новые столбцы для отображения в таблице.
		</li>
		<li>
			В разделе статистики улучшена навигация: добавлены ссылки для связи между разными страницами статистики.
		</li>
		<li>
			При выводе различных изображений в панели администрирования (скриншоты, фотографии) KVS стал автоматически
			определять кол-во изображений в строке исходя из размера изображения и разрешения монитора.
		</li>
		<li>
			Появилась возможность включить привязку изменения названия объекта и его директории. В случае включения,
			поле директории будет недоступно для изменения и будет изменяться синхронно при изменении названия.
			Актуально, если у вас работают контент менеджеры, которые изменяют названия контента и иногда могут
			забывать обнулить значение директории, чтобы она перегенерировалась.
		</li>
		<li>
			Добавлен новый главный раздел Администрирование, куда перенеслось часть страниц из раздела Настройки,
			которые не связаны с настройками. Системные Настройки переименованы в Настройки Контента и часть настроек,
			которые не связаны с контентом вынесены от другие разделы.
		</li>
	</ul>
	<h4>Блоки сайта</h4>
	<ul>
		<li>
			В конфигурации появилась опция, которая позволяет вынести JS файлы сайта на CDN (указывается URL к
			статическим файлам). Поскольку KVS подключает JS файлы из движка, сделать это через шаблоны возможности
			нет.
		</li>
		<li>
			Появилась возможность показывать похожие видео / фотоальбомы по названию. Для этого используется
			полнотекстовый поиск по названию. Данные варианты доступны в параметре <b>mode_related</b> блоков
			<b>list_videos</b> и <b>list_albums</b>. По нашему мнению, в случае большой базы контента данные режимы
			работают интереснее, чем остальные.
		</li>
		<li>
			В блоке <b>list_dvds</b> добавилась возможность для каждого DVD / канала опционально вытянуть все его
			видео. Это можно включить параметром <b>pull_videos</b>, а также указать кол-во видео и сортировку
			дополнительными параметрами.
		</li>
		<li>
			В блоке <b>list_albums</b> добавился параметр <b>show_image_info</b>, который позволяет для каждого
			фотоальбома вытянуть его фотографии.
		</li>
		<li>
			В блоках <b>list_videos</b>, <b>list_albums</b> и <b>list_content</b> добавились параметры
			<b>skip_content_sources</b> и <b>show_content_sources</b>, которые позволяют статически отфильтровать
			выводимый контент по контент провайдерам. В блоке <b>list_videos</b> добавились параметры
			<b>skip_dvds</b> и <b>show_dvds</b>, которые позволяют статически отфильтровать выводимые видео по DVD /
			каналу.
		</li>
		<li>
			На странице видео / фотоальбома появилась возможность вывести ссылки на предыдущее и следующее видео
			(фотоальбом). Последовательность определяется датой появления. Эти данные становятся доступными только
			после включения параметра <b>show_next_and_previous_info</b>, который добавлен в блоки <b>video_view</b> и
			<b>album_view</b>.
		</li>
		<li>
			В блоке <b>list_categories</b> добавлен параметр <b>show_only_with_albums_or_videos</b>, который позволяет
			показать только те категории, в которых есть хотя бы 1 видео или 1 фотоальбом.
		</li>
		<li>
			В блоке <b>list_videos</b> добавлен фильтр по группе контент провайдеров.
		</li>
		<li>
			Появилась возможность передавать имя скачиваемого видеофайла / ZIP архива для фотоальбома. Для этого в
			ссылку на скачивание необходимо добавить параметр download_filename=&lt;имя файла&gt;.
		</li>
	</ul>
	<h4>Другие поправки</h4>
	<ul>
		<li>
			В модели добавлено поле цвета глаз.
		</li>
		<li>
			У категорий расширено кол-во доп. полей.
		</li>
		<li>
			В систему защиты видео по IP внесена поправка, которая позволяет указывать список "белых" IP, доступ с
			которых не будет блокироваться. Также появилась возможность видеть список IP, которые заблокированы на
			текущий момент.
		</li>
		<li>
			В модели добавлено поле, которое позволяет перечислить псевдонимы. Добавлен новый плагин автовыбора
			моделей (по аналогии с плагинами для тэгов и категорий), который, если включен, будет анализировать
			название и описание контента на наличие там модели или одного из псевдонимов.
		</li>
		<li>
			В плагин автовыбора категорий добавились опции, которые позволяют настроить в каких случаях его запускать
			(ранее он срабатывал только если у видео / фотоальбома нет ни одной категории).
		</li>
	</ul>
	<h2 id="section_whats_new_2_4">KVS v2.4</h2>
	<h3 id="section_whats_new_2_4_4">KVS v2.4.4 [03.06.2012]</h3>
	<ul>
		<li>
			Создан новый плагин, который позволяет загружать файлы видео / фотоальбомов по ФТП и создавать на основе
			этих файлов объекты видео или альбомов. По нашему мнению, это будет наиболее удобный способ массовой
			загрузки контента. В плане видео вы сможете загружать как просто одиночные видеофайлы, которые будут
			использоваться в качестве исходников, так и папки с несколькими файлами, от различных форматов видео до
			обзорных скриншотов. В плане фотоальбомов вы также сможете загружать как одиночные архивы с фотографиями,
			так и папки со списком фотографий для каждого альбома. Принцип действия плагина прост. Первым делом вы
			копируете в папки на сервере контент в нужной структуре (плагин поддерживает отдельные корневые папки для
			стандартных видео, премиум видео и фотоальбомов). После этого вы запускаете плагин, настроенный на данные
			папки; плагин анализирует папки, выводит вам обзор найденного контента и после вашей проверки производит
			импорт выбранного контента.
		</li>
		<li>
			Выполнена значительная оптимизация скрипта раздачи видео в плане использования сессий PHP. По нашим тестам
			на высоконагруженных проектах данная оптимизация приводит к заметному снижению кол-ва сессий на сервере и
			общему увеличению производительности системы.
		</li>
		<li>
			Выполнена оптимизация подсчета статистики в плане доступа к файлам.
		</li>
		<li>
			При флаггировании видео / фотоальбомов появилась поддержка указания опционального текстового сообщения.
			Соответственно в панели администрирования появилась возможность просматривать сообщения к флагам от
			пользователей.
		</li>
		<li>
			В настройках форматов видео добавлена возможность перекрыть watermark изображение для отдельных контент
			провайдеров. Вы можете использовать это для того, чтобы видео, загруженное от разных спонсоров имело разные
			логотипы.
		</li>
		<li>
			В настройках форматов видео добавлена возможность указать, какой из форматов является исходником для
			нарезки других форматов. Ранее исходником считался тот формат, чей размер файла больше. Теперь появилась
			возможность вручную выбрать любой из форматов.
		</li>
		<li>
			В настройках серверов хранения появилась возможность указать часовое смещение времени. Это может
			потребоваться для настройки удаленных серверов хранения, чтобы не приводить на них таймзону к таймзоне
			основного сервера - а просто указать часовое смещение.
		</li>
		<li>
			В блоки списков видео и списков фотоальбомов (list_videos и list_albums) добавлены такие возможности как:
			выводить список по букве алфавита, выводить список по нескольким категориям одновременно, поиск по доп.
			полям кастомизации.
		</li>
		<li>
			На основной странице редактирования видео появилась возможность выбирать главный скриншот (без
			необходимости переключаться на редактирование скриншотов видео).
		</li>
		<li>
			При поиске на сайте по элементам поискового запроса (когда запрос разбивается на пробелы и идет поиск по
			отдельным элементам запроса) не происходит поиска по элементам с длиной менее 2 символов, чтобы улучшить
			качество результатов поиска.
		</li>
		<li>
			Появилась возможность выключить ротацию видео для отдельных блоков list_videos.
		</li>
		<li>
			В массэдит добавлена возможность массового запрета редактирования с сайта для выбранных видео и
			фотоальбомов, а также запуска любых плагинов пост-обработки в любое время (например, автогенерация
			категорий, тэгов, синонимайзер).
		</li>
		<li>
			Для моделей добавлена возможность указать фиксированный возраст модели, вместо даты рождения. Поскольку при
			указании даты рождения возраст модели постоянно увеличивается, это может быть неудобным в некоторых
			случаях.
		</li>
		<li>
			Несколько улучшена концепция защиты мемберзоны от мультидоступа. В случае временной блокировки ранее
			пользователю просто отправлялось письмо со ссылкой для активации доступа - теперь же одновременно со
			временной блокировкой происходит автоматический сброс пароля, и пользователю высылается новый пароль.
			Благодаря смене пароля отсекаются все сторонние лица, которые могли входить в мемберзону под именем данного
			пользователя. Повторная попытка сменить пароль на старый будет пресечена, т.е. заблокированные пароли уже
			никогда не смогут стать снова доступными.
		</li>
		<li>
			Улучшена обработка архивов для фотоальбомов. Теперь фотографии всегда добавляются из архивов в алфавитном
			порядке (а не в порядке добавления в архив, как было ранее). Также игнорируются любые сторонние папки и
			файлы, которые могут случайно оказаться в архиве.
		</li>
		<li>
			В плагине аудита в проверку видео контента добавлена опция, которая позволяет проверить отдачу всех до
			исключения видеофайлов (простая проверка контента просто проверяет наличие файлов на жестком диске и их
			размеры).
		</li>
		<li>
			Кол-во текстовых доп. полей для DVD / каналов расширено до 10.
		</li>
		<li>
			Исправлено несколько серьезных проблем в плеере.
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h3 id="section_whats_new_2_4_3">KVS v2.4.3 [25.03.2012]</h3>
	<ul>
		<li>
			Добавлена интеграция с NATS.
		</li>
		<li>
			Добавлена поддержка Universal CDN (ucdn.com).
		</li>
		<li>
			Расширена система ограничения доступа в панель администрирования. Теперь для администраторов можно
			настраивать, имеют ли они доступ ко всем видео и фотоальбомам, либо только к тем, которые они создавали.
			Таким образом, вы сможете создавать ограниченных администраторов, которые смогут логиниться в панель
			администрирования и работать со своим контентом (добавлять, редактировать, удалять, работать со скриншотами
			/ фотографиями). При этом они не будут иметь доступа к контенту (видео и фотоальбомам), загруженному другими
			администраторами или пользователями сайта.
		</li>
		<li>
			Появился новый плагин обновления, который предоставляет удобный интерфейс для пошагового обновления вашего
			проекта на новую версию.
		</li>
		<li>
			Добавлена дата последнего обновления контента модели. Она обновляется каждые 8 часов в целях оптимизации на
			основе видео и фотоальбомов модели. Вы можете использовать эту дату для вывода в шаблонах сайта, либо для
			сортировки списка моделей.
		</li>
		<li>
			Количество текстовых доп. полей моделей расширено до 10.
		</li>
		<li>
			Появилась возможность не показывать часть моделей на публичной зоне сайта - для этого у каждой модели есть
			поле выбора уровня доступа, который будет требоваться для возможности видеть модель на сайте (как на списке
			моделей, так и на странице модели).
		</li>
		<li>
			Добавлена возможность вывести список похожих видео по DVD / каналу.
		</li>
		<li>
			В блоке логина появилась опция, при включении которой входить в мемберзону смогут только Премиум
			пользователи. Она предназначена для закрытия мемберзоны от стандартных пользователей.
		</li>
		<li>
			В панели администрирования появилась возможность изменить статус видео / фотоальбома, находясь на странице
			скриншотов / фотографий.
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h3 id="section_whats_new_2_4_2">KVS v2.4.2 [06.03.2012]</h3>
	<ul>
		<li>
			В плагин аудита добавлена проверка критериев безопасности проекта: отсутствие привилегий записи на
			системные файлы и папки, запрет прямого доступа к определенным папкам и др.
		</li>
		<li>
			Изменена концепция создания и удаления страниц сайта, которая ранее требовала привилегий на запись в
			корневую папку проекта. Теперь для создания новой страницы сайта необходимо вручную скопировать PHP файл
			страницы, аналогично для удаления страницы необходимо вручную удалить PHP файл. Таким образом, отпала
			необходимость для нарушения политики безопасности доступа к корневой папке.
		</li>
		<li>
			Добавлена документация по плагину аудита с описанием всех ошибок, предупреждений и информационных сообщений.
		</li>
		<li>
			Расширен набор доступных сортировок в блоке списка моделей (list_models).
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h3 id="section_whats_new_2_4_1">KVS v2.4.1 [12.02.2012]</h3>
	<ul>
		<li>
			Добавлен блок удаления профиля пользователя (member_profile_delete). Блок предназначен для того, чтобы
			пользователи могли запрашивать удаление своих профилей. Само удаление выполняется вручную администратором.
		</li>
		<li>
			В блок логина добавлена встроенная поддержка ajax запроса, который можно использовать для логина
			пользователей без открытия страницы логина.
		</li>
		<li>
			В настройках форматов видео появилась возможность включить ресайз не по ширине, а по высоте. Это, возможно,
			потребуется, если вы хотите, чтобы высота ваших видеофайлов соответствовала стандартам (720p, 1080p и др.).
		</li>
		<li>
			Добавлен блок смешанного видео и фото контента (list_content), который умеет выводить видео и фотоальбомы
			по общему набору фильтров и общей сортировке.
		</li>
		<li>
			Добавлен блок смешанного облака тэгов (tags_cloud_v2), который может выводить облако тэгов по видео и
			фотоальбомам одновременно.
		</li>
		<li>
			В фотоальбомы добавлена поддержка нескольких категорий (до этого момента фотоальбомы могли иметь только
			одну категорию).
		</li>
		<li>
			На импорте видео / фотоальбомов появилась возможность пропустить любое поле (столбец) из данных импорта.
		</li>
		<li>
			В импорт фотоальбомов добавлена возможность указывать в данных импорта номер главной фотографии.
		</li>
		<li>
			Работа фидов импорта стала параллельной. Ранее фиды работали последовательно, поэтому при необходимости
			скачивания больших файлов с медленной отдачей обработка группы фидов могла длиться очень долго. Сейчас фиды
			работают независимо друг от друга и могут параллельно скачивать файлы, что может в разы ускорить общую
			производительность.
		</li>
		<li>
			В плеере исправлена проблема, когда при выборе другого качества в выпадающем списке, видео запускалось с
			начала, а не с того момента на котором пользователь переключил качество.
		</li>
		<li>
			В блоке логина появилась возможность использования опции "запомнить меня" в течение настроенного кол-ва
			дней.
		</li>
		<li>
			В блоке списка моделей (list_models) добавлена возможность фильтрации по интервалу возраста (от-до), а
			также текстовый поиск по названию и описанию.
		</li>
		<li>
			Появилась возможность отключить сайт из панели администрирования. При отключении сайта пользователям будет
			показываться статический HTML файл (/website_unavailable.html), который вы можете отредактировать по своему
			усмотрению.
		</li>
		<li>
			На импорте видео и фотоальбомов появилась возможность настроить, чтобы категории для импортируемых видео /
			фотоальбомов брались из данных их контент провайдера.
		</li>
		<li>
			В блоке списка видео (list_videos) появилась возможность фильтрации по интервалу длительности (от-до).
		</li>
		<li>
			Добавлена возможность настраивать привилегии доступа к разделу настроек. Если ранее раздел настроек был
			доступен только для супер-администратора, то сейчас можно наделять ограниченных администраторов различными
			правами доступа к разделу настроек.
		</li>
		<li>
			В фотоальбомы по аналогии с видео добавлена поддержка флагов. В фотоальбомах флаги присваиваются не самим
			фотоальбомам, а их отдельным изображениям (собственно так же ведет себя и рейтинг, и комментарии). В
			остальном флаги фотоальбомов ведут себя аналогично флагам видео (например, позволяют настроить рейтинг
			через них).
		</li>
		<li>
			В блоках списка категорий (list_categories), моделей (list_models) и контент провайдеров
			(list_content_sources) добавлена возможность вывести список фотоальбомов для каждой категории (модели,
			контент провайдера).
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h3 id="section_whats_new_2_4_0">KVS v2.4.0 [10.12.2011]</h3>
	<ul>
		<li>
			В импорт и экспорт фидов добавили поддержку директории видео, а также имени пользователя.
		</li>
		<li>
			В форматах скриншотов и альбомов появилась возможность создавать ZIP архивы для конкретных форматов. При
			включении галочки создания ZIP архива в любом из существующих форматов, все необходимые ZIP файлы создадутся
			через фоновую задачу. Таким образом, использовать ZIP архивы с фотографиями или скриншотами вы сможете в
			любой момент.
		</li>
		<li>
			Для оптимизации скорости обработки нового видео мы вынесли (опционально) процедуру создания всех форматов
			скриншотов на сервера конвертации. Ранее форматы скриншотов всегда создавались на главном сервере, добавляя
			лишнюю нагрузку на него. Начиная с версии 2.4.0 в скрипте конвертации remote_cron.php, который находится на
			сервере конвертации, вы можете указать путь к библиотеке imagemagick, и если путь указан, то создание
			форматов скриншотов начнет происходить на сервере конвертации.
		</li>
		<li>
			Блок загрузки и редактирования видео (video_edit) был расширен возможностью, которая позволяет пользователю,
			загрузившему видео, выбрать главный скриншот для этого видео.
		</li>
		<li>
			Появилась возможность получить срез загрузок ваших embed кодов по доменам, в раздел статистики была
			добавлена новая страница для этого.
		</li>
		<li>
			Добавлено логгирование действий с видео и фотоальбомами в так называемый лог аудита. Лог аудита находится в
			разделе настроек панели администрирования и позволяет проследить все действия по какому-либо видео или
			фотоальбому (кто и когда создал, изменял или удалил), а также по любому администратору или пользователю
			проследить все его действия с контентом. Этот функционал будет полезен вам, если вы хотите более детально
			контролировать объем работы ваших работников с проектом.
		</li>
		<li>
			Добавлен плагин "Исправление базы данных", который показывает статус по таблицам MySQL и позволяет
			исправлять ошибки при их наличии. При обнаружении ошибок вы увидите сообщение на странице старта.
		</li>
		<li>
			Добавлена глобальная опция, которая позволяет вам для стандартных и премиум видео выбрать формат, на основе
			которого необходимо вычислять длительность видео. Данная опция находится в разделе системных настроек панели
			администрирования. По умолчанию длительность видео определяется его исходником. Вам следует использовать эту
			опцию, если вы загружаете исходники большой длительности, а все форматы создаются сильно урезанными
			(например, 3-5 минут). В такой ситуации определять длительность по исходнику видео некорректно, и вы можете
			выбрать один из форматов, по которому будет определяться длительность видео.
		</li>
		<li>
			Добавлен новый блок сайта, который умеет выводить список наиболее частых поисковых запросов у вас на сайте.
			Блок называется search_results.
		</li>
		<li>
			На списках видео и фотоальбомов в панели администрирования появилась опция валидации, которая позволяет
			проверить отдельные видео или фотоальбомы. Процедура валидации полностью идентична валидации контента в
			плагине аудита и проверяет наличие всех видеофайлов и скриншотов / изображений.
		</li>
		<li>
			Базовый набор шаблонов сайта, который поставляется вместе с KVS, переведен на русский язык.
		</li>
		<li>
			Добавлены долгожданные плагины для автогенерации тэгов, автогенерации категорий, а также автозамены слов в
			текстовках для видео и фотоальбомов. Плагин автозамены может использоваться для большей уникальности
			описаний ваших видео и фотоальбомов.
		</li>
		<li>
			Появилась возможность включить режим паузы для движка конвертации. Движок KVS не позволяет менять некоторые
			настройки (форматы видео, скриншотов и фотоальбомов) во время обработки фоновых задач. При большом
			количестве постоянно добавляемых видео и (или) альбомов администратору сложно найти окно, во время которого
			можно внести необходимые изменения в настройки. Для решения этой проблемы мы добавили опцию паузы, которая
			находится в разделе системных настроек. При включении этой опции движок закончит обработку уже начатых
			задач и перейдет в режим паузы (вы узнаете об этом по подсказке в шапке панели администрирования).
		</li>
		<li>
			В системных настройках также появились 2 дополнительные опции, которые позволяют настроить поведение
			некоторых предупреждений на странице старта. Во-первых, появилась возможность выключить предупреждение о
			включенном доступе для службы поддержки. Во-вторых, появилась возможность указать порог срабатываний защиты
			от перегрузки, при котором появляется предупреждение.
		</li>
		<li>
			В блоках списка видео и фотоальбомов (list_videos и list_albums) добавлена возможность указать паттерн
			страницы, на которую будет выполнен редирект в случае единственного результата в поиске. В обычных
			ситуациях ничего указывать не нужно, т.к. редирект идет на страницу просмотра видео / фотоальбома. При
			наличии раздела сайта для мобильных устройств, поиск находится на отдельной странице сайта и редирект с
			него требуется также на отдельную страницу для мобильных устройств - в этом случае вам нужно настроить
			корректный паттерн для редиректа.
		</li>
		<li>
			Выполнена значительная оптимизация поиска на сайте (за счет ограниченного кэширования результатов поисковых
			запросов).
		</li>
		<li>
			Появилась возможность продублировать любую страницу сайта в два клика. Эта возможность удобна для создания
			тестовых страниц сайта, либо для создания новых версий уже существующих страниц. Так, например, не боясь
			сломать уже рабочий функционал сайта, вы можете создать новую версию страницу просмотра видео
			(video_view_v2) путем копирования существующей страницы. Затем вы можете не спеша работать с новой
			страницей, менять ее концепцию или содержимое - после всех работ для переключения сайта на новую страницу
			вам всего лишь будет необходимо поправить правило(а) в htaccess! При необходимости вы можете сохранить
			старую версию страницы и переключиться на нее назад в любой момент.
		</li>
		<li>
			В фиды экспорта добавлена возможность задавать фильтры по любым направлениям категоризации: категории, тэги,
			модели и спонсоры. Из-за потенциально возможной нагрузки в настройки фидов экспорта была добавлена
			настройка времени кэширования.
		</li>
		<li>
			В настройки серверов конвертации добавлена возможность настраивать приоритет фоновых процессов (nice) на
			этих серверах по отдельности. Аналогичная опция в системных настройках теперь работает только в рамках
			главного сервера.
		</li>
		<li>
			При редактировании видео в панели администрирования добавлена возможность помечать видео любым из флагов.
			Соответственно список видео можно фильтровать по любым флагам, а также в массовом редактировании можно
			устанавливать значение этого флага. Данное дополнение позволяет упростить кооперацию между
			администраторами, которые совместно работают над контентом (один ждет, пока другой обработает видео и т.д.).
			Напоминаем, что вы можете создавать любые флаги и использовать их в частности для этих целей.
		</li>
		<li>
			В блоке загрузки видео (video_edit) появилась возможность пользователям загружать видеофайлы по удаленным
			ссылкам на них, как это возможно в панели администрирования. Данная поправка требует модификации шаблонов
			сайта и поэтому недоступна при обновлении.
		</li>
		<li>
			В блоке списка контент провайдеров (list_content_sources) добавлена возможность фильтрации списка по
			группам категорий.
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h2 id="section_whats_new_2_3">KVS v2.3</h2>
	<h3 id="section_whats_new_2_3_2">KVS v2.3.2 [25.09.2011]</h3>
	<ul>
		<li>
			Добавлен плагин резервного копирования, который позволяет сделать резервные копии базы данных, шаблонов и
			настроек сайта, а также системных файлов KVS.
		</li>
		<li>
			Вернулась возможность экспортировать исходники скриншотов видео и фотоальбомов: как при ручном экспорте,
			так и через фиды. При создании фидов экспорта вы должны включить отдельную опцию, которая разрешает фиду
			показывать исходник - в противном случае фид не позволит получить исходники.
		</li>
		<li>
			В персональные настройки пользователей добавлена возможность выбрать режим отображения страницы
			редактирования видео: "полный" или "для дескописателя". При работе в режиме "для дескописателя" на странице
			редактирования видео отображается меньше полей, также присутствует плеер без необходимости дополнительных
			действий для его отображения.
		</li>
		<li>
			Добавлена поддержка импорта RSS фидов, которые предоставляют ссылки на видео галереи. При импорте таких
			фидов движок KVS проанализирует страницы из фида, определит на них видеофайлы, которые при необходимости
			склеит и добавит в базу.
		</li>
		<li>
			В статистику транзакций добавлен подсчет кол-ва пользователей, которые ушли с вашего сайта на биллинг, а
			также кол-во транзакций, которые по тем или иным причинам были отклонены биллингом.
		</li>
		<li>
			Добавлена поддержка биллинга Zombaio (zombaio.com). Интеграция с данным биллингом пока находится в тестовом
			режиме.
		</li>
		<li>
			В таблицу фоновых задач добавлено отображение кода ошибки для более удобного вычленения задач с ошибками
			определенного типа.
		</li>
		<li>
			В панели администрирования появилась возможность искать видео и фотоальбомы по их урлам на сайте.
		</li>
		<li>
			Изменена концепция своего embed кода - в embed коде больше не требуется передавать ссылку на видео и превью
			скриншот. Вместо этих параметров embed код будет содержать идентификатор видео, по которому в реальном
			времени будет вычисляться и ссылка на видеофайл, и ссылка на превью изображение. Такое изменение вызвано
			различными сценариями, при которых ссылка на видеофайл может измениться. Так, например, вы можете захотеть
			показывать через embed коды другой формат видео, либо смигрировали видео с одной группы серверов на другую -
			в этих случаях возникнут проблемы с embed кодами. Изменение концепции позволит полностью избавиться от
			проблем такого рода в будущем.
		</li>
		<li>
			Добавлен плагин, позволяющий создать видеофайл указанной длительности и качества на основе одного
			изображения (видеофайл просто показывающий это изображение). Такой видеофайл может использоваться в
			настройках защиты от хотлинка, чтобы он показывался пользователям, для которых по тем или иным причинам
			сработала защита.
		</li>
		<li>
			Добавлена поддержка стриминга через Reflected Networks, Inc. CDN.
		</li>
		<li>
			В списки моделей на сайте добавлена возможность отображать отдельно мужчин и женщин.
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h3 id="section_whats_new_2_3_1">KVS v2.3.1 [12.08.2011]</h3>
	<ul>
		<li>
			Движок конвертации переведен на ffmpeg 0.8. В этой версии библиотеки была изменена концепция наложения
			ватермарка. В связи с этим при обновлении необходимо также обновлять и ffmpeg на новую версию (не менее
			0.8).
		</li>
		<li>
			В настройки форматов видео добавлена дополнительная опция ресайза видео, которая позволяет выбрать либо
			сохранение пропорций исходного видео (так всегда работало ранее), либо кроп видео до нужных пропорций.
			Эта опция важна для форматов, которые вы планируете использовать для мобильных устройств и которые
			должны иметь фиксированные размеры вне зависимости от пропорций исходных видеофайлов.
		</li>
		<li>
			В настройки форматов видео добавлена возможность ограничить скорость скачивания видеофайлов этого
			формата. Варианты использования могут быть, например, такими: ограничить скорость отдачи бесплатного
			видео, ограничить скорость отдачи видео, которое просматривается через embed код, ограничить скорость
			отдачи видео, которое разрешается хотлинковать партнерам и т.д. Ограничение скорости будет работать
			только если видео отдается через nginx.
		</li>
		<li>
			Введено понятие условно-необязательных форматов видео. Условно-необязательные форматы в отличие от
			просто необязательных форматов могут создаваться автоматически, но только в тех случаях, когда исходник
			видео позволяет создать такой формат исходя из длительности и размеров. Например, вы хотите, чтобы по
			всем видео у вас было 3 формата с разными размерами: SD, HD и Full HD. Скажем, не все ваши исходники
			позволяют создать Full HD формат. Вы можете сделать этот формат условно-необязательным, и в результате
			он будет создаваться только с тех исходников, которые это позволяют, а с других создаваться не будет.
		</li>
		<li>
			В фотоальбомы добавлены настройки кроппинга и возможность настроить уровень доступа пользователей к
			исходникам фотографий (раньше доступ к исходникам фотографий был только у админа). Таким образом, вы
			можете отображать исходники фотографий на сайте как один из форматов фотоальбомов.
		</li>
		<li>
			В фотоальбомы добавлена возможность вывести на сайте геометрический размер фотографий и их файловый
			размер на диске. Это справедливо для любого формата фотоальбомов.
		</li>
		<li>
			В блоке list_videos добавлена возможность вывести только те видео, скриншоты которых сротировались
			ротатором.
		</li>
		<li>
			Появилась возможность ответить из панели администрирования на сообщение обратной связи.
		</li>
		<li>
			Для отдельных пользователей сайта появилась возможность задать группу контент провайдеров, в которую
			они могут добавлять свои видео или фото. Это сделано в основном для удобства вебмастеров, добавляющих
			свои видео / фото через ваш сайт, чтобы они могли привязывать видео / фото только к своим контент
			провайдерам и быстрее могли найти их в списке (список будет содержать только контент провайдеры из
			группы, которая выбрана для данного вебмастера).
		</li>
		<li>
			В плеер добавлен яваскрипт колбэк, который вызывается при загрузке плеера.
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h3 id="section_whats_new_2_3_0">KVS v2.3.0 [27.06.2011]</h3>
	<ul>
		<li>
			Существенно расширена функциональность фотоальбомов и практически доведена до функциональности видео
			контента. Во-первых, в фотоальбомы добавлена поддержка отложенной даты появления на сайте, т.е. дата
			публикации. Во-вторых, в функциональность панели администрирования по фотоальбомам добавились функции импорта,
			экспорта и массового редактирования. Данные функции работают по аналогии с соответствующими функциями видео.
		</li>
		<li>
			Появилась возможность привязывать фотоальбомы к видео. Для этого на странице редактирования фотоальбомов
			в панели администрирования добавлено поле, которое позволяет указать видео для данного фотоальбома. Таким
			образом, к одному видео можно привязать несколько фотоальбомов (они будут видны в панели администрирования
			на странице редактирования видео). На сайте вы можете показать для видео список его фотоальбомов через блок
			list_albums. Аналогично для фотоальбома вы можете показать привязанное к нему видео через блок
			list_videos.
		</li>
		<li>
			Появилась возможность перестартовать любые фоновые задачи, завершенные с ошибкой. Эта опция доступна
			в контекстном меню задачи на списке фоновых задач в панели администрирования.
		</li>
		<li>
			По длительным фоновым задачам появилась возможность видеть процент их выполнения. Если ранее, запуская
			задачу по нарезке нового формата скриншотов, вы могли ждать сутки не имея информации о прогрессе
			задачи, то теперь в такой длительной задаче всегда показывается % ее выполнения.
		</li>
		<li>
			Добавилась возможность массово пересоздать любые форматы скриншотов или фотоальбомов. Эта возможность
			доступна в контекстном меню формата на списке форматов в панели администрирования. При ее выборе все
			скриншоты / изображения формата будут пересозданы (с новыми опциями разумеется) для всех видео / альбомов.
		</li>
		<li>
			Добавлено 2 небольших дополнения к ротатору. Во-первых, появилась возможность для отдельных списков
			видео на сайте (блок list_videos) включать форсирование отображения лучших по CTR скриншотов, даже если
			какие-то видео в этих списках еще находятся на этапе ротации. Это можно использовать, например, для
			индекса сайта, где всегда лучше всего показать только наиболее кликабельные тумбы. Во-вторых, появилась
			возможность вывести отдельно только те видео, скриншоты которых еще не сротировались. Таким образом,
			вы можете создать отдельную страницу сайта с такими видео на ней и скидывать на нее "мусорный" трафик
			для ускорения ротации.
		</li>
		<li>
			В массовое редактирование видео добавлена возможность мигрировать видео с одной группы серверов на
			другую. Эта возможность потребуется для дальнейшего расширения проекта, когда вы хотите добавить новые
			форматы видео, а места на серверах группы недостаточно. Чтобы решить эту проблему, вы сможете добавить
			новую группу серверов, смигрировать часть видео на нее и на освободившемся месте создать новые форматы.
		</li>
		<li>
			Добавилась уникальнейшая возможность отладки страниц сайта, которая в большинстве случаев значительно
			упростит вам работу с натяжкой дизайна, либо добавлением новых страниц сайта. Для того, чтобы получить
			отладочные данные по любой странице сайта, вам необходимо к ее адресу добавить параметр
			<b>?debug=true</b>. Чтобы это сработало, вы должны быть залогинены в панели администрирования. Отладочная
			информация показывает ВСЕ, что только можно показать по данной ссылке: какая страница в движке отвечает за
			формирование того, что вы видите на экране, какие компоненты используются в шаблоне страницы, какие
			блоки подключаются на странице, значения параметров конфигурации всех блоков, и самое главное - как и
			в любом отладчике, список всех переменных, которые вы можете использовать в шаблонах, а также их
			текущие значения! Мы надеемся, что эта новая фича движка KVS поможет вам быстрее и с меньшими затратами
			разобраться в деталях настройки и кастомизации сайта.
		</li>
		<li>
			В плагин аудита добавлена проверка всех требуемых файлов KVS. Эта проверка должна позволить в любой
			момент времени получить информацию о кастомных изменениях в софте, сделанных у вас на проекте.
		</li>
		<li>
			Расширено логгирование всех системных процессов, чтобы в любой момент времени можно было получить
			лог последнего запуска того или иного процесса. Список системных логов, а также информация об установке
			KVS на вашем сервере доступна на новой странице панели администрирования в разделе настроек (Информация
			установки).
		</li>
		<li>
			В блоках list_videos и random_video добавлена дополнительная опция псевдослучайной сортировки, которая
			работает в несколько раз быстрее, чем обычная случайная сортировка средствами MySQL. По результатам
			тестирования на нескольких ресурсах было замечено, что случайная сортировка значительно замедляет
			выборку данных при большом кол-ве объектов. Псевдослучайная сортировка работает в несколько раз быстрее.
		</li>
		<li>
			На списках видео / альбомов в панели администрирования появился постфикс <b>(w)</b> рядом с именем
			пользователя, если этот пользователь является вебмастером.
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h2 id="section_whats_new_2_2">KVS v2.2</h2>
	<h3 id="section_whats_new_2_2_2">KVS v2.2.2 [10.05.2011]</h3>
	<ul>
		<li>
			Завершено первоначальное тестирование ротатора и поправлены найденные проблемы.
		</li>
		<li>
			Настройка ротатора полностью вынесена в раздел системных настроек и доступна всем желающим. В документацию
			добавлен раздел о ротаторе.
		</li>
		<li>
			Добавлена возможность отфильтровать список видео в панели администрирования по завершенности ротации
			скриншотов, а также появилась возможность вывести CTR каждого видео и отсортировать по нему.
		</li>
		<li>
			В массовое редактирование добавлена возможность сбросить статистику ротатора.
		</li>
		<li>
			На странице редактировании видео и фотоальбомов в панели администрирования в дополнение к кнопке "Сохранить
			и открыть след." появилась кнопка "Удалить и открыть след.".
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h3 id="section_whats_new_2_2_1">KVS v2.2.1 [22.04.2011]</h3>
	<ul>
		<li>
			В некоторых блоках сайта добавилась возможность выводить древовидную структуру видео: по категориям,
			по моделям и по контент провайдерам. Так, например, вы можете вывести список контент провайдеров и для
			каждого контент провайдера показать N видео с нужной вам сортировкой (по рейтингу, по популярности, по
			ротатору и т.д.). Аналогичным образом можно сделать и для категорий, и для моделей.
		</li>
		<li>
			Подключен SMS биллинг smspay.lenden.ru.
		</li>
		<li>
			На экспорте видео появилась возможность указать размеры и скин плеера для embed кодов, которые
			генерятся экспортом на свои видео. Это вам пригодится, если вы используете свои embed коды на других
			своих проектах: на разные проекты вам могут потребоваться embed коды с разными размерами плеера и даже
			разным скином.
		</li>
		<li>
			В плагине аудита появилась возможность посмотреть на результаты недавних аудитов (до 7 дней назад). Это
			сделано для того, чтобы не ждать пока закончится текущий аудит (полный аудит может занять несколько
			часов), а спокойно запустить его, закрыть страницу и зайти через некоторое время, чтобы увидеть
			результат.
		</li>
		<li>
			Были выполнены небольшие дополнения комментариев и событий сайта. Везде добавлена возможность вывести
			пол пользователя (по комментарию или событию).
		</li>
		<li>
			В CSV фидах импорта добавлена возможность пропускать первую строку фида. Некоторые сайты отдают CSV
			фид со строкой заголовка, где перечислены названия и порядок столбцов. Для возможности добавления таких
			фидов и предназначена опция, которая пропускает строку заголовка.
		</li>
		<li>
			Расширено применение фидов экспорта. Если раньше фиды могли отдавать только данные о видео, которые
			хостятся у вас, то сейчас в фиды экспорта попадают и хотлинкованные видео, и псевдо видео и embed коды.
			Это позволит вам полноценно синхронизировать контент между своими проектами.
		</li>
		<li>
			На странице работы со скриншотами видео добавлена галочка для одновременного выбора всех скриншотов на
			удаление. Это пригодится, если вы удаляете больше скриншотов, чем оставляете - в этом случае вам будет
			быстрее выделить все сразу и вручную снять выделение только с тех скриншотов, которые вы хотите
			оставить.
		</li>
		<li>
			В массэдит добавлена возможность массово перевести публичные видео в личные и наоборот.
		</li>
		<li>
			В блоке list_videos добавлен параметр блока, который позволяет показать только те видео, у которых есть
			файл указанного формата.
		</li>
		<li>
			Рандомизировано распределение новых задач по серверам конвертации. Если раньше задачи добавлялись на
			сервера конвертации по очереди до предельного заполнения каждого сервера, то сейчас задачи
			раскидываются случайным образом.
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h3 id="section_whats_new_2_2_0">KVS v2.2.0 [24.03.2011]</h3>
	<ul>
		<li>
			Бета версия ротатора: поправка, которую все давно ждали наконец завершена! В версии 2.2.0 мы сделали
			ротатор только по видео, но в будущем потенциально нет никаких проблем для добавления ротаторов по
			фотоальбомам, контент провайдерам, моделям и DVD. Ротатор по видео работает на 2 уровнях: на первом
			уровне происходит ротация скриншотов в пределах одного видео с целью выявления наиболее
			кликабельного(ых). Возможно автоматическое удаление N-ного кол-ва скриншотов с наихудшими CTR. На
			втором уровне работает ротация всех видео с целью выявления наиболее кликабельных видео среди других.
			Подробная информация по ротатору будет доступна в документации следующих версий. Пока что, поскольку
			поправка серьезная и влияет на самое сердце движка сайта, по умолчанию она заблокирована и будет
			разблокирована в будущем. Желающих поучаствовать в бета тестировании приглашаем создать тикеты по этому
			вопросу.
		</li>
		<li>
			Появилась возможность хотлинковать свое видео с других доменов с сохранением защиты от хотлинка. Эта
			возможность позволит вам на основе уже созданного (на KVS) ресурса быстро и дешево поднять десятки
			других ресурсов через хотлинкование своих же видео. При этом хотлинковать можно будет только с ваших
			же ресурсов.
		</li>
		<li>
			Доведена до ума возможность создавать ресурсы-клоны, частично используя уже готовую базу данных.
			Напомним, KVS позволяет создать ресурсы на физически одной базе данных с отдельным набором и дизайном
			страниц, а также отдельной статистикой. При этом данные по видео, комментариям, пользователям и т.д.
			являются общими для всех ресурсов.
		</li>
		<li>
			Добавлен плагин очистки кэша смарти. Плагин позволяет посмотреть размер файлового кэша, который
			используется страницами сайта и настроить его очистку по расписанию.
		</li>
		<li>
			Добавлена интеграция с биллингом smsdostup.ru.
		</li>
		<li>
			Небольшие поправки в embed плеере. В настройки плеера добавлена опция отключить на сайте возможность
			скопировать embed код на ваше видео. Также добавлена подстановка партнерского рефа в embed код, который
			отображается в плеере на сайте. Таким образом, посетители от вашего партнера возьмут embed код с его же
			рефом.
		</li>
		<li>
			Появилась возможность использовать флаги в качестве рейтинга. Для каждого флага вы можете назначить вес,
			который будет добавляться (отниматься) к рейтингу. Таким образом, вы сможете сортировать видео по
			рейтингу, полученному от флагов.
		</li>
		<li>
			На импорте видео появилась опция, которая позволяет пропускать видео с названиями, уже существующими в
			базе. Раньше по таким видео всегда выводились предупреждения и они так или иначе создавались, что может
			быть нежелательным.
		</li>
		<li>
			Улучшили юзабилити выбора скриншотов видео на ручном граббинге - теперь можно кликать по тумбам и они
			будут выбираться в такой же последовательности, как вы кликаете.
		</li>
		<li>
			В блоке сайнапа добавили возможность проверки существования таких логина / email в базе через ajax
			(проверка дубликатов).
		</li>
		<li>
			Добавилось небольшое API работы с пользователями для интеграции с другими скриптами форумов / сайтов /
			партнерок. API пока позволяет создать пользователя, дать пользователю премиум доступ и забрать премиум
			доступ. В будущем по мере ваших запросов API будет расширяться.
		</li>
		<li>
			Небольшие поправки по плееру. Появилась возможность указать алгоритм масштабирования видео: (а)
			сохранять пропорции, (б) растягивать без сохранения пропорций и (в) обрезать края. Эта поправка не
			сильно актуальна для софта (поскольку в блоке video_view плеер по умолчанию принимает пропорции видео).
			Но вам может пригодиться, если вы показываете плеер фиксированного размера. В этом случае в зависимости
			от пропорций видео появляются черные полосы, что может быть нежелательным.
		</li>
		<li>
			Добавились еще 2 доп. поля в категории.
		</li>
		<li>
			Мелкие поправки и баги.
		</li>
	</ul>
	<h2 id="section_whats_new_2_1">KVS v2.1</h2>
	<h3 id="section_whats_new_2_1_1">KVS v2.1.1 [05.02.2011]</h3>
	<ul>
		<li>
			Количество слотов плеера расширено с 3 до 5.
		</li>
		<li>
			При сохранении FTP сервера хранения или конвертации сделана детализация по ошибкам: ошибка соединения,
			ошибка логина или ошибка записи.
		</li>
		<li>
			В функцию проверки серверов в плагине аудита добавлена проверка отдачи контента со всех серверов хранения.
		</li>
		<li>
			Добавлен блок отображения случайного видео (random_video). Блок позволяет отобразить одно видео, взятое
			случайным образом по настроенным правилам. Например, случайное видео из 10 лучших за сегодня, случайное
			видео из 20 наиболее рейтинговых в категории "Категория" и т.д. - выбор опций достаточно большой.
		</li>
		<li>
			В фиды импорта добавлена возможность указать порядок обработки видео из фида - прямой или обратный.
		</li>
		<li>
			В фиды импорта добавлена возможность брать главный скриншот из фида и создавать остальные самостоятельно.
			Раньше была возможность только либо брать один скриншот, либо полностью создавать все скриншоты
			самостоятельно.
		</li>
		<li>
			В просмотр видео в панели администрирования добавлено отображение таймлайновых скриншотов, если они
			включены в настройках плеера и имеются в наличии для данного формата видео.
		</li>
		<li>
			В плагине аудита появилась новая опция проверки - проверка защиты контента. Эта опция проверяет, что вся
			необходимая защита от хотлинка и несанкционированного доступа к видео включена и корректно настроена в
			конфигурации nginx. В частности осуществляется проверка невозможности прямого доступа к исходникам видео и
			файлам форматов видео. Кроме проверки видео для владельцев полного пакета KVS аналогичным образом
			проверяются исходники и закрытые форматы фотоальбомов, к которым не должно быть возможности прямого
			доступа.
		</li>
		<li>
			Поправлено несколько проблем в плеере.
		</li>
	</ul>
	<h3 id="section_whats_new_2_1_0">KVS v2.1.0 [17.01.2011]</h3>
	<ul>
		<li>
			Добавился плагин новостей, который 2 раза в сутки вытягивает информацию о новостях с сайта Kernel Video
			Sharing и показывает новости на странице старта.
		</li>
		<li>
			Интегрирована новая версия плеера с большим количеством поправок.
		</li>
		<li>
			Хранение исходников скриншотов видео перенесено в ту же папку, где хранятся исходники видеофайлов (и
			которая должна быть закрыта от прямого доступа), таким образом исходники скриншотов видео будут защищены от
			несанкционированного доступа.
		</li>
		<li>
			Добавлена дополнительная логика обработки таймлайновых скриншотов, когда ffmpeg по каким либо причинам не
			может создать скриншот в нужной точке.
		</li>
		<li>
			Появился новый плагин интеграции поиска видео с внешними поисковиками. Вы можете полностью либо частично
			переключить поиск по видео у вас на сайте на использование стороннего поиска с отображением сторонних
			результатов на вашем сайте. Это позволяет продавать поисковый трафик с вашего сайта.
		</li>
		<li>
			Для оптимизации поиска видео на сайте в блок list_videos были введены параметры, которые настраивают
			отдельно поиск по категориям, тэгам, моделям, контент провайдерам и DVD.
		</li>
		<li>
			Парсер фидов smartscripts переключен на работу в реверсном режиме (начинать обработку видео с конца фида).
		</li>
		<li>
			Исправлены некоторые мелкие ошибки и недочеты.
		</li>
	</ul>
	<h2 id="section_whats_new_2_0">KVS v2.0</h2>
	<h3 id="section_whats_new_2_0_6">KVS v2.0.6 [30.12.2010]</h3>
	<ul>
		<li>
			Полностью изменена структура контента фотоальбомов. Теперь фотоальбомы поддерживают мультиформатность, как
			и видео. Обработка фотоальбомов вынесена на фоновые задачи.
		</li>
		<li>
			В фотоальбомах добавлена поддержка контент провайдеров и моделей.
		</li>
		<li>
			Появилась возможность закрывать доступ к определенным форматам фотоальбомов для непривилегированных
			пользователей.
		</li>
		<li>
			Для фотоальбомов в панели администрирования появилась возможность настроить столбцы списка (в персональных
			настройках), а также появились кнопки аналогичные видео "Сохранить и открыть след." и "Сохранить и добавить
			еще".
		</li>
		<li>
			В логгировании процесса конвертации видео добавлен фильтр, который позволяет отфильтровать множество
			похожих сообщений по фреймам видео, оставив только небольшую их часть. Это сделано для того, чтобы повысить
			доступность логов конвертации видео.
		</li>
		<li>
			В импорте видео появилась возможность указать вместо интервала конкретных дат расброса видео - кол-во дней
			в будущем, на которое будет расбрасываться видео. Это удобно если вы регулярно используете схемы импорта и
			всегда загружаете видео на один и тот же интервал в будущем (например, на неделю вперед).
		</li>
		<li>
			В схемах импорта / экспорта видео появилась возможность указать схему по умолчанию, которая будет
			выбираться автоматически.
		</li>
		<li>
			На списке форматов видео в панели администрирования добавлена возможность переключать стуктуру списка между
			2 режимами: стандартным (как было) и режимом доступа и защиты, который показывает несколько другие столбцы
			таблицы, акцентируя внимание на настройках доступа к форматам видео.
		</li>
		<li>
			В ручном граббинге скриншотов видео появилась возможность добавлять новые обзорные скриншоты к видео
			(раньше можно было только заменять существующие).
		</li>
		<li>
			В плагин аудита добавилась возможность полной проверки контента фотоальбомов.
		</li>
		<li>
			Исправлены некоторые мелкие ошибки и недочеты.
		</li>
	</ul>
	<h3 id="section_whats_new_2_0_5">KVS v2.0.5 [07.12.2010]</h3>
	<ul>
		<li>
			Появилась возможность указывать какие форматы видео доступны для скачивания.
		</li>
		<li>
			Появилась возможно выключать глобальную защиту от хотлинка для отдельных форматов видео. Это может
			потребоваться, если вы хотите предоставить другим возможность хотлинковать ваши видеофайлы.
		</li>
		<li>
			Добавилась возможность создавать фиды экспорта, которые могут использоваться вашими партнерами для
			периодического запроса информации о ваших видео. Фиды экспорта предоставляет партнерам удобную возможность
			самостоятельно выбрать формат фида (KVS или CSV с возможностью указать список и порядок столбцов), а также
			выбрать подходящий формат скриншотов (если у вас настроена мультиформатность скриншотов) и указать
			некоторые другие фильтры и сортировку.
		</li>
		<li>
			В настройках embed плеера появилась возможность указать какой формат видео будет использоваться при
			генерации embed кода. Тем самым вы можете создавать отдельные форматы для показа в embed кодах, который
			ставится на ваше видео на сторонних ресурсах.
		</li>
		<li>
			Появилась возможность передавать партнерский реф через параметры embed кода и в рекламе плеера генерировать
			ссылки с указанным рефом. Это позволит вашим партнерам, например, использовать ваш embed код для
			продвижения вашего ресурса и получать свой % дохода, как будто при использовании простых реф ссылок на
			ваш ресурс.
		</li>
		<li>
			Исправлены некоторые мелкие ошибки и недочеты.
		</li>
	</ul>
	<h3 id="section_whats_new_2_0_4">KVS v2.0.4 [15.11.2010]</h3>
	<ul>
		<li>
			Добавлена интеграция с биллингом epoch.
		</li>
		<li>
			Добавлена поддержка фидов импорта. Фиды импорта позволяют вам настроить импорт видео по расписанию,
			используя фиды предоставленные третьими сторонами (как правило партнерками). KVS поддерживает фиды
			следующих форматов: KVS (xml), SmartScripts (xml) и CSV (возможность задать соответствие столбцов и
			разделитель). Кроме этого, вы можете выбирать различные режимы добавления видео (как embed код, как
			псевдо-видео, хотлинковать видеофайлы, загружать к себе), режимы скриншотов (использовать скриншоты
			фида или создавать свои), а также гибко настраивать распределение видео по датам и создание базы на
			будущее.
		</li>
		<li>
			Появился новый плагин, который позволяет включить создание по расписанию аватаров категорий на основе
			видео в этих категориях (можно указать критерий).
		</li>
		<li>
			В массэдите видео добавлена возможность массово сбрасывать выбранный флаг у видео.
		</li>
		<li>
			В блоке списка видео (list_videos) добавлена информация о форматах каждого видео.
		</li>
		<li>
			В случае срабатывания защиты от перегрузки для главного крона - теперь это событие не дает
			предупреждение на странице старта, а просто пишется в статистику.
		</li>
		<li>
			Добавлена возможность отключать защиту от хотлинка для отдельных форматов видео. Это может
			потребоваться, если вы хотите дать возможность другим хотлинковать ваше видео (по аналогии с FHG).
		</li>
		<li>
			Исправлены некоторые мелкие ошибки и недочеты.
		</li>
	</ul>
	<h3 id="section_whats_new_2_0_3">KVS v2.0.3 [31.10.2010]</h3>
	<ul>
		<li>
			Несколько изменен механизм балансировки видео между несколькими серверами (CDN). Теперь одно и то же
			видео отдается с одного и того же сервера в течение 5 минут. Таким образом распределение отдачи видео
			меняется каждые 5 минут. Это сделано для того, чтобы еще более ускорить отдачу видео контента, поскольку
			отдавая одно и то же видео с одного сервера мы увеличиваем вероятность использования локального кэша
			nginx и ОС и снимаем нагрузку на винчестеры.
		</li>
		<li>
			Добавлены отдельные RSS каналы для видео по категориям и видео по тэгам.
		</li>
		<li>
			В массэдит видео добавилась возможность массовой замены рейтинга.
		</li>
		<li>
			В импорте видео появилась возможность глобально указать контент провайдер для всех импортируемых видео.
		</li>
		<li>
			Добавилось флаггирование видео. Можно создавать любое кол-во флагов и по каждому видео можно
			проголосовать за один из флагов. Для флага можно указать после какого кол-ва голосов он должен выводить
			предупреждение на страницу старта в панели администрирования. Для списка видео в панели администрирования
			появилась возможность включить отображение информации о флагах в качестве отдельных столбцов (в персональных
			настройках, где настраиваются столбцы списка видео).
		</li>
		<li>
			Добавлена поддержка ccbill.
		</li>
		<li>
			Исправлены некоторые мелкие ошибки и недочеты.
		</li>
	</ul>
	<h3 id="section_whats_new_2_0_2">KVS v2.0.2 [11.10.2010]</h3>
	<ul>
		<li>
			В дефолтовом варианте сайта был сделан вывод HTML title и description тэгов для списков видео по
			категории на основе доп. полей в категориях (раньше эти данные брались из названий и описаний
			категорий, но многие просили добавить отдельные поля для se-оптимизации).
		</li>
		<li>
			С этого момента убрали VIP видео и VIP пользователей, которые просуществовали с версии 1.5.0 и не нашли
			применение у клиентов. Убрали, т.к. их наличие осложняло некоторые аспекты мемберзоны и ограничений.
		</li>
		<li>
			Добавилась возможность настроить альтернативные хранилища скриншотов и их случайное использование на
			сайте. Это сделано для ускорения загрузки страницы сайта с большим кол-вом картинок, т.к. если часть
			картинок грузится с одного домена (субдомена), а другая часть с другого - это дает визуальный эффект
			более быстрого отображения сайта.
		</li>
		<li>
			Появилась возможность массово проконфирмить пользователей на списке в панели администрирования.
		</li>
		<li>
			Оптимизирован сбор статистики по поиску на сайте.
		</li>
		<li>
			Исправлены некоторые мелкие ошибки и недочеты.
		</li>
	</ul>
	<h3 id="section_whats_new_2_0_1">KVS v2.0.1 [26.09.2010]</h3>
	<ul>
		<li>
			В движке конвертации сделана логика анализа всех скриншотов и в случае появления серых скриншотов их
			автоматическая перенарезка более сложным и длительным методом (быстрая нарезка ffmpeg в некоторых
			случаях дает серые скриншоты, равномерно распределенные по всему видео).
		</li>
		<li>
			В случае, когда вручную загружаются файл стриминговых форматов (flv, mp4), движок теперь все равно
			загружает их на сервер конвертации чтобы убедиться что они готовы к стримингу (метаданные для flv,
			moov контейнер для mp4).
		</li>
		<li>
			В аплодер на сайте и в панели администрирования добавлена проверка 413 ошибки nginx, которая отдается если
			загружаемый файл имеет размер больше разрешенного. Теперь показывается корректное сообщение, вместо кода
			ошибки.
		</li>
		<li>
			Исправлены некоторые мелкие ошибки и недочеты.
		</li>
	</ul>
	<h3 id="section_whats_new_2_0_0">KVS v2.0.0 [17.09.2010]</h3>
	<h4>Движок конвертации и хранения видео / скриншотов полностью переписан</h4>
	<ul>
		<li>
			Для каждого типа видео - стандартное (публичное и личное) и премиум - теперь можно задать отдельный
			список форматов, которые будут создаваться автоматически на основе исходника. Каждый из таких форматов
			позволяет указать отдельные настройки ограничений длительности видео (в секундах или в %, кол-во
			частей на основе которых сформировать ролик), отдельное watermark изображение.
		</li>
		<li>
			Возможность включить сохранение исходников видео.
		</li>
		<li>
			Форматы видео можно удалять / добавлять в любое время. При удалении формата все видеофайлы этих
			форматов будут автоматически удалены, при добавлении - донарезаны либо на основе исходников видео, либо
			на основе файлов других форматов.
		</li>
		<li>
			Скриншоты разбиты на 2 группы: обзорные и таймлайновые. Обзорные скриншоты создаются на основе
			исходника видео и по сути представляют видео для пользователя. Можно задать как фиксированное кол-во
			обзорных скриншотов для всех видео, так и интервал, через который они будут сняты (таким образом, у
			видео разной длительности будет разное кол-во обзорных скриншотов). Таймлайновые скриншоты
			настраиваются для каждого формата видео в отдельности и создаются на основе файла этого формата (а не
			исходника). Таймлайновые скриншоты предназначены для отображения в плеере точек при перемотке, но также
			могут использоваться и в других местах, где необходимо показать раскадровку видео.
		</li>
		<li>
			Для обзорных и таймлайновых скриншотов можно задать отдельные списки форматов. Для каждого формата
			скриншотов можно указать отдельный размер, отдельные настройки качества, отдельное watermark
			изображение. Форматы скриншотов можно добавлять / удалять в любое время, нужные файлы будут
			создаваться / удаляться автоматически.
		</li>
		<li>
			Введено понятие очереди конвертации и серверов конвертации. Теперь любые операции с контентом выносятся
			в задачи (9 видов задач). Некоторые задачи выполняются на главном сервере и не требуют сервера
			конвертации. Задачи, которые включают работу с видео контентом выполняются на сервере(ах) конвертации.
			При установке создается один сервер конвертации, который физически находится на этом же сервере. При
			необходимости, можно добавить любое кол-во сторонних серверов конвертации и вынести все наиболее
			ресурсоемкие операции на них. Это можно сделать в любое время (на сервере конвертации требуется только
			установить нужные серверные библиотеки и поставить PHP скрипт на крон). Таким образом, решена важная
			проблема выноса конвертации на сторонние сервера.
		</li>
		<li>
			Расширена поддержка мультисерверного хранения видео:<br/>
			<b>(a)</b> Появилась возможность настраивать балансировку отдачи видео между серверами одной группы по
			весовым коэф. а также по странам (организация CDN). Таким образом, имея сервера в США и Европе вы
			сможете показывать одно и то же видео разным пользователям с разных серверов.<br/>
			<b>(b)</b> Добавлена поддержка FTP при работе с мультисерверностью.<br/>
			<b>(c)</b> Добавлена постоянная фоновая проверка наличия видеофайлов на всех серверах, таким образом
			при любых сбоях в системе хранения вы об этом узнаете.<br/>
			<b>(d)</b> Добавилась возможность для каждого сервера проверить отдачу видео с него как по прямой
			ссылке, так и через скрипт отдачи. Это сделано для того, чтобы при включении \ выключении защиты от
			хотлинка можно было быстро убедиться что все работает как требуется.
		</li>
		<li>
			Ручная работа со скриншотами переработана с учетом мультиформатности и разбиения скриншотов на
			обзорную / таймлайновую группы. Нарезка новых скриншотов по видео вынесена на фон с отображением
			прогрессбара, чем стала на порядок удобнее (во-первых, вы видите сколько осталось ждать, во-вторых, вы
			можете продолжать работать с панелью администрирования из этого же браузера - раньше это было невозможно).
		</li>
		<li>
			Импорт и экспорт видео переписаны с учетом всех новшеств, а также исправлены некоторые серьезные
			недоработки прошлых версий:<br/>
			<b>(a)</b> Возможность пропустить строки, которые вызвали ошибки.<br/>
			<b>(b)</b> Возможность указать длительность видео в нормальном формате (раньше можно было только
			кол-вом секунд).<br/>
			<b>(c)</b> Добавлена возможность указать список пользователей от которых добавятся видео, т.е. по сути
			не указывать отдельно для каждого видео, а задать один список из которого для каждого видео будет
			случайно подбираться пользователь.<br/>
			<b>(d)</b> Операция проверки данных импорта вынесена на фон с отображением прогрессбара. Здесь также
			поправлены основные проблемы ожидания, с которыми сталкивались пользователи предыдущих версий при
			импорте большого кол-ва видео.<br/>
			<b>(e)</b> Возможность указывать скриншоты в архиве.
		</li>
		<li>
			Сделано полное логгирование процессов конвертации и пост-конвертации видео. Мы постарались вывести как
			можно больше полезной информации, которая позволит быстро разобраться в случае каких-либо проблем и
			оперативно решить их. Логи по каждому видео теперь доступны со списка видео в панели администрирования.
		</li>
		<li>
			Добавлена поддержка 5 типа контента - фейковое видео. Для данного типа видео вы должны указать ссылку
			редиректа и, попав на данное видео, пользователь уйдет по ссылке. Это можно использовать для
			разбавления собственной базы видео ссылками на трейд.
		</li>
		<li>
			Появился массэдит видео, который позволяет не просто массово изменить некоторые поля выбранных
			(или всех) видео, но также позволяет намного больше:<br/>
			<b>(a)</b> Назначить дату появления в указанном диапазоне - т.е. случайно раскидать видео по разным
			датам.<br/>
			<b>(b)</b> Добавить или удалить тэги, категории, моделей.<br/>
			<b>(c)</b> Создать или пересоздать файлы выбранных форматов.<br/>
			<b>(d)</b> Массово удалить исходные файлы видео.
		</li>
	</ul>
	<h4>Движок сайта и производительность</h4>
	<ul>
		<li>
			Выполнена оптимизация самых проблемных блоков сайта: list_categories, list_tags, tags_cloud.
		</li>
		<li>
			Усилена защита от перегрева сервера. Добавлена статистика по срабатываниям защиты от перегрева.
		</li>
		<li>
			Добавлен сбор и отображение статистики производительности отдельных страниц и блоков. Данная статистика
			очень важна для оптимизации различных аспектов сайта. Она позволяет анализировать стратегию кэширования
			и корректировать ее, а также находить наиболее узкие в плане производительности места. Также добавлена
			возможность сброса накопленной статистики производительности.
		</li>
		<li>
			Добавлен поиск по шаблонам в панели администрирования. Это очень удобно, когда нужно массово заменить
			какой-то аспект дизайна, который может потенциально находиться в нескольких местах сайта. Теперь прямо из
			панели администрирования можно искать все что угодно.
		</li>
		<li>
			Изменена концепция пагинации: теперь в урлах показываются номера страниц, а не номера первого элемента
			на странице, как было раньше. Также любой список можно перевести на аяксовую пагинацию, сохранив при
			этом ссылки для поисковиков.
		</li>
		<li>
			Полностью изменена концепция подключения яваскриптов. Теперь они подключаются автоматически в
			зависимости от блоков, которые вставлены на странице. Каждый блок знает, какой яваскрипт ему нужен и
			подключает его.
		</li>
	</ul>
	<h4>Плеер и его использование в KVS</h4>
	<ul>
		<li>
			Добавлена возможность настроить редирект пользователя при клике на область просмотра видео во время
			проигрывания.
		</li>
		<li>
			Добавлено отображение пермалинка (линка на страницу с этим видео на сайте).
		</li>
		<li>
			Добавлена возможность указать рекламную строку в контролбаре и урл клика по ней.
		</li>
		<li>
			Добавлена возможность указать, чтобы все ссылки из плеера открывались в этом же окне браузера.
		</li>
		<li>
			Добавлена возможность показывать похожие видео в плеере.
		</li>
		<li>
			Добавлена возможность защитить видео от копирование через capture-софт (настраивается интервал, через
			который в разных углах плеера показывается настроенный текст, например IP и логин текущего
			пользователя).
		</li>
		<li>
			Добавлена возможность показывать таймлайновые скриншоты видео для текущего видеофайла (если они
			включены для этого формата видео) при прокрутке.
		</li>
		<li>
			В embed режиме плеера добавлена возможность для различных рекламных опций редиректить пользователя на
			страницу с этим видео на вашем сайте.
		</li>
		<li>
			В связи с появлением мультиформатности видео добавлена возможность настраивать списки форматов для
			разных уровней доступа пользователей (как на ютубе - 360p, 480p и т.д. - все это настраивается).
			Объяснить эти оцпии в двух словах очень сложно, в них нужно детально разобраться. Используя их вы
			можете, например, настроить, чтобы незарегистрированные пользователи могли смотреть только урезанное
			видео в плохом качестве, а при выборе опции 720p уходили на сайт спонсора или на вашу страницу сайнапа,
			или просто куда-то в другое место. При этом зарегистрированные пользователи могут смотреть видео в HD
			качестве, используя эту же опцию 720p. Это лишь один из десятков примеров использования, фантазия здесь
			неограничена, разве что только тем, что максимальное кол-во опций в списке - 3.
		</li>
		<li>
			В целом добавлена возможность указывать различные настройки плеера для различных типов пользователей.
			Таким образом, вы можете показывать рекламу в плеере только для гостей, а для мемберов не показывать,
			и т.д. - уровней доступа 3: незарегистрированные (гости), стандартные и премиум пользователи.
		</li>
	</ul>
	<h4>Различные аспекты работы и администрирования</h4>
	<ul>
		<li>
			Добавлена ссылка на сайт из панели администрирования.
		</li>
		<li>
			В персональных настройках пользователей добавлена возможность полностью настроить столбцы списка видео
			в панели администрирования (которых стало на порядок больше). Появилась возможность показывать тумбу на
			списке видео в панели администрирования.
		</li>
		<li>
			Возможность просмотра видео прямо со списка в панели администрирования.
		</li>
		<li>
			Добавлена возможность залочить отдельные видео, чтобы их нельзя было редактировать или удалять на
			сайте.
		</li>
		<li>
			Введены DVD, для которых можно задать список видео (сцен). DVD - это самостоятельные объекты, которые
			можно показать на сайте в виде списка, показать данные по DVD, списки сцен по ним, их можно
			рейтинговать и добавлять комментариии.
		</li>
		<li>
			Добавлены доп. поля в категории и группы категорий.
		</li>
		<li>
			Для всех страниц в панели администрирования сделан уникальный HTML &lt;title&gt;, таким образом навигация
			по истории стала легче и легче разобраться в нескольких открытых окнах.
		</li>
		<li>
			Добавлены рейтинг и комментарии по контент провайдерам и моделям.
		</li>
		<li>
			По моделям расширен набор личных данных моделей.
		</li>
	</ul>
	<h4>Статистика</h4>
	<ul>
		<li>
			Статистика полностью переведена на связку JS+cookie. Добавлен рассчет nocookie траффика.
		</li>
		<li>
			Добавлен рассчет загрузок вашего embed кода с других сайтов. При задании рефереров для мониторинга -
			загрузка embed кодов будет также учитываться по реферерам.
		</li>
		<li>
			Появилась возможность сброса статистики за указанный период.
		</li>
	</ul>
	<h4>Сайт и блоки сайта</h4>
	<ul>
		<li>
			Блок логина - появилась возможность настроить защиту от мультилогинов. Вы можете указать кол-во
			уникальных IP, масок IP, стран и браузеров, которое разрешается за указанный промежуток времени. Если
			для какого-то мембера нарушается хотя бы одно из этих условий - наступает бан. Бан может быть 2 видов:
			временный - когда пользователю отправляется на email письмо с просьбой конфирма, и постоянный. Можно
			настраивать кол-во разрешенных временных банов, после которого наступает постоянный бан. Разумеется по
			всем заблокированным пользователям будет возможность посмотреть информацию, почему он был забанен и
			сколько раз, при необходимости можно будет разбанить.
		</li>
		<li>
			По залогиненному пользователю можно подсчитывать время его нахождения на сайте (опционально). Таким
			образом, по каждому пользователю вы сможете видеть среднее время, проведенное им на сайте. Также эта
			функциональность позволяет отображать "online" индикатор для каждого пользователя и выводить
			пользователей, которые "online" прямо сейчас.
		</li>
		<li>
			Несколько поправок сделано для всех комментариев (по видео, альбомам, моделям, DVD и контент
			провайдерам):<br/>
			<b>(a)</b> Логгируется не только IP, но и страна.<br/>
			<b>(b)</b> Возможность настроить поведение captcha (отображать ли всем, только гостям,
			  не отображать никому).<br/>
			<b>(c)</b> Если комментарии настроены сразу появляться на сайте, то они тем не менее
			  будут попадать в панели администрирования в список на проверку (раньше в этом случае
			  комментарии не попадали в список на проверку).
		</li>
		<li>
			В списки категорий и тэгов добавилась возможность сортировать элементы по среднему рейтингу видео
			(альбомов) в данной категории / тэге, а также аналогично по средней популярности видео (альбомов).
		</li>
		<li>
			В списки моделей и контент провайдеров добавилась возможность сортировать элементы по среднему рейтингу
			и по средней популярности видео, которые относятся к модели / контент провайдеру.
		</li>
		<li>
			Добавлен блок обратной связи, который позволяет пользователям писать админам сервиса любую информацию.
		</li>
		<li>
			Появилась возможность анонимным гостям загружать видео (раньше могли только мемберы). Добавилась
			возможность сделать некоторые из полей необязательными (убрать проверку), например, описание, тэги,
			категории.
		</li>
		<li>
			Добавлена возможность отобразить глобальный список изображений фотоальбомов - без привязки в самим
			альбомам.
		</li>
		<li>
			Во многих блоках списков добавилась возможность отфильтровать элементы с пустым описанием.
		</li>
		<li>
			Добавилась возможность показывать мемберов сайта из страны текущего пользователя.
		</li>
	</ul>
	<h4>Плагины софта</h4>
	<ul>
		<li>
			Добавилась поддержка плагинов, которые могут быть легко установлены / удалены. Плагины будут
			использоваться нами для предоставления различных сторонних функций нашим клиентам без требования
			установки новых версий софта.
		</li>
		<li>
			Плагин аудита - позволяет проверить различные аспекты софта:<br/>
			<b>(a)</b> Наличие нужных привилегий на системных файлах.<br/>
			<b>(b)</b> Целостность БД.<br/>
			<b>(c)</b> Корректность всех форматов видео и скриншотов (для тестового видео пытается создать файлы
			всех форматов видео и скриншотов).<br/>
			<b>(d)</b> Кэширование страниц и блоков сайта.<br/>
			<b>(e)</b> Глубокая проверка контента - полностью проверяет наличие и размеры всех видеофайлов и всех
			скриншотов.
		</li>
	</ul>
	<h2 id="section_whats_new_1_5">KVS v1.5</h2>
	<h3 id="section_whats_new_1_5_0">KVS v1.5.0 [13.01.2010]</h3>
	<h4>Конвертация основного видео и трейлеров, системные опции</h4>
	<ul>
		<li>
			Добавилась возможность использовать двухпроходное кодирование для ffmpeg, что дает лучше качество
			выходного видео.
		</li>
		<li>
			Добавилась поддержка watermark изображения (с поддержкой прозрачности PNG), а также возможность
			указать угол его положения (либо рандомный угол).
		</li>
		<li>
			Добавилась возможность указать приоритет всех процессов конвертации (выбор из нескольких доступных
			констант).
		</li>
		<li>
			Добавилась возможность указать уровень логгирования ошибок конвертации (нет логгирования, полное
			логгирование, логгирование только в случае ошибок).
		</li>
		<li>
			Для трейлеров теперь возможно указывать отдельные опции конвертации, размер, отдельный watermark.
		</li>
		<li>
			Видео на сайте отображается с учетом пропорций (высота плеера регулируется автоматически под пропорции
			видео, исходя из заданной ширины).
		</li>
	</ul>
	<h4>Создание скриншотов и ручная нарезка скриншотов</h4>
	<ul>
		<li>
			4 строки опций ImageMagick были заменены на одну строку с токенами для размеров.
		</li>
		<li>
			Операция кропа вынесена в отдельную опцию и позволяет указать кроп с 4-х сторон в пикселях или
			процентах.
		</li>
		<li>
			Добавилась опция, которая позволяет выбрать метод нарезки скриншотов в случаях, когда аспект ратио
			видео не совпадает с аспект ратио скриншотов. Вы можете выбрать либо сохранение полезной графической
			информации (тогда на скриншотах могут появиться черные полосы по краям), либо урезание полезной
			графической информации для приведения скриншота к нужному аспект ратио (черных полос не будет, если
			конечно в самом видео их не было).
		</li>
		<li>
			При ручной нарезке скриншотов добавилась возможность выбрать библиотеку нарезки (ffmpeg / mplayer),
			также указать кроп непосредственно для данной операции (системные опции при этом живут сами по себе).
		</li>
		<li>
			Кроме скриншотов настраиваемых размеров теперь всегда сохраняются изображения исходных размеров,
			которые могут быть использованы в дальнейшем (например, для импорта их в другие системы). Также
			отдельно сохраняется превью изображение главного скриншота, которое используется как превью в плеере.
		</li>
	</ul>
	<h4>Защита видео от хотлинка и несанкционированного доступа</h4>
	<ul>
		<li>
			Добавилась поддержка серверной защиты прямого доступа к файлам для Nginx (через X-Accel-Redirect). При
			хранении контента на удаленных серверах / мультисерверности защита также может быть включена.
		</li>
		<li>
			Добавилась возможность указать для пользователей каких статусов доступно полное видео. Например, вы
			можете указать, что полное видео доступно только для Премиум и VIP пользователей. В этом случае только
			пользователи со статусами Премиум и VIP могут получить доступ к полным видеофайлам;
			незарегистрированным посетителям сайта и просто активным пользователям будут отдаваться трейлеры
			вместо полного видео (если они включены), либо 403 ошибка, если трейлеры выключены.
		</li>
	</ul>
	<h4>Платный доступ, уровни доступа, биллинги</h4>
	<ul>
		<li>
			В дополнение к Премиум статусу пользователей добавился VIP статус, таким образом вы можете разделять
			функциональность вашего сайта для разных категорий пользователей:<br/>
			<b>(a)</b> Незарегистрированные посетители (например, они могут смотреть только урезанные трейлеры не
			более 5 в сутки).<br/>
			<b>(b)</b> Зарегистрированные пользователи (например, они могут смотреть только трейлеры без
			ограничений по кол-ву).<br/>
			<b>(c)</b> Премиум пользователи (например, они могут смотреть полное стандартное видео).<br/>
			<b>(d)</b> VIP пользователи (например, они могут смотреть полное видео включая VIP видео хорошего
			качества).
		</li>
		<li>
			Кроме Премиум видео, теперь можно создавать и VIP видео.
		</li>
		<li>
			Добавилась поддержка SMS биллингов и биллингов по кредиткам (начиная со 2 пакета). В настоящее время
			мы внесли поддержку SegPay и SmsCoin. Мы будем добавлять поддержку тех или иных процессоров (как SMS,
			так и по кредиткам) по мере необходимости нашим клиентам, т.к. для подключения биллинга нужна тестовая
			площадка. Если вы заинтересованы в других процессорах, обращайтесь к нам с запросами. В идеале, когда
			добавятся несколько дополнительных процессоров, вы сможете настраивать параллельно резервный процессор
			(SMS или по кредиткам) и мгновенно переключаться на него в случаях проблем с основным или по каким-то
			другим причинам. Тема биллингов еще только начинается в KVS, поэтому в дальнейшем она будет дополняться
			различной функциональностью в зависимости от пожеланий наших клиентов.
		</li>
		<li>
			Для карточных и SMS биллингов есть возможность задать список пакетов доступа. Каждый пакет доступа
			позволяет задать статус пользователя (Премиум или VIP), который будет установлен пользователю после
			оплаты, т.е. вы можете создавать отдельные пакеты для Премиум и VIP доступа с разными ценами.
		</li>
		<li>
			Блок регистрации на сайте теперь позволяет включить SMS биллинг, биллинг по кредиткам и оставить
			бесплатную регистрацию параллельно. При желании возможность бесплатной регистрации можно выключить в
			настройках блока. Кроме оплаты во время регистрации, при условии сохранении бесплатного доступа,
			пользователь может сначала зарегистрироваться бесплатно, а потом сделать апгрейд доступа на платный.
			Таким же образом пользователи, оплатившие через SMS, могут продлевать доступ при завершении периода
			подписки.
		</li>
		<li>
			Добавилась статистика по всем транзакциям, статистика по активности пользователей, логгирование входов
			пользователей.
		</li>
	</ul>
	<h4>Плеер, настройки плеера в панели администрирования</h4>
	<ul>
		<li>
			В самом плеере было сделано большое количество поправок и дополнений, как визуальных, так и
			функциональных:<br/>
			<b>(a)</b> Добавилась кнопка остановки.<br/>
			<b>(b)</b> Добавилась возможность указать URL выхода при клике на логотип.<br/>
			<b>(c)</b> Добавилась реклама во время паузы и остановки видео.<br/>
			<b>(d)</b> Добавилась возможность указывать поведение панели управления (показывать всегда, прятать
			всегда, показывать только во время активности пользователя).<br/>
			<b>(e)</b> Добавилась возможность показывать embed код внутри плеера.<br/>
			<b>(f)</b> Добавилась поддержка светлого скина.<br/>
			<b>(g)</b> Много небольших поправок по стабильности плеера в целом.
		</li>
		<li>
			В панели администрирования добавились разделы для конфигурации опций плеера на сайте и "embed" плеера
			(в системных настройках). Набор опций в двух случаях примерно одинаков. Кроме стандартных опций
			отображения плеера, настройки плеера в панели администрирования позволят вам задать всю рекламу внутри
			плеера. Реклама может задаваться как глобальными рекламными баннерами, так и привязкой к рекламе
			спонсоров видео (контент провайдеров). Все это теперь возможно настроить очень быстро и удобно.
		</li>
	</ul>
	<h4>Категоризация, модели</h4>
	<ul>
		<li>
			Добавились модели в качестве еще одной ступени категоризации видео в дополнение к категориям и тэгам.
			Модели поддерживают базовые поля, 2 скриншота разных размеров (настраивается в системных опциях), а
			также дополнительные текстовые и файловые поля для кастомизации.
		</li>
		<li>
			Улучшился процесс категоризации в панели администрирования с точки зрения юзабилити. Это относится к
			категориям, тэгам и моделям. Если раньше тэги задавались через запятую в текстэрии, а категории
			выбирались чекбоксами, то сейчас и для тэгов, и для категорий, и для моделей созданы специальные
			контролы, которые отображают список уже имеющихся элементов категоризации и предоставляют подсказки при
			вводе новых элементов. Также есть возможность отобразить всплывающую панель со списком всех возможных
			элементов и выбрать чекбоксами нужные для добавления.
		</li>
		<li>
			Добавилась возможность указывать категории для спонсоров (контент провайдеров). В блок списка спонсоров
			(list_content_sources) добавилась возможность настроить отображение списков спонсоров по категориям.
		</li>
		<li>
			Для построения сайта добавилось несколько новых блоков:<br/>
			<b>(a)</b> list_categories_group (позволяет вывести список групп категорий, настроить их фильтрацию и
			сортировку).<br/>
			<b>(b)</b> list_models (позволяет вывести список моделей, настроить их фильтрацию и сортировку).<br/>
			<b>(c)</b> model_view (позволяет отобразить информацию о модели).
		</li>
		<li>
			В блок списка видео (list_videos) добавилась возможность настроить отображение списков видео по
			моделям.
		</li>
		<li>
			В блоке списка видео (list_videos) добавилась возможность выводить категории, тэги и модели для каждого
			видео в списке.
		</li>
		<li>
			В блок списка категорий (list_categories) добавилась возможность настроить отображение списков
			категорий по группам категорий.
		</li>
		<li>
			Модели можно указывать в импорте / экспорте видео.
		</li>
	</ul>
	<h4>Сайт</h4>
	<ul>
		<li>
			Поменялся дизайн сайта, который предоставляется по умолчанию.
		</li>
		<li>
			Пагинация стала встроенной во всех блоках списков, а также переведена на se-friendly линки (раньше
			пагинация была только отдельным блоком). Отдельный блок пагинации остался для обратной совместимости, а
			также для некоторого расширения функционала пагинации.
		</li>
		<li>
			Добавлена страница Sitemap, которая генерирует необходимую XML структуру.
		</li>
		<li>
			Значительно расширилось использование спонсоров на сайте. Теперь, благодаря новым блокам сайта, KVS
			предоставляет возможность организовать ревью спонсоров. В дополнение к блоку списка спонсоров
			добавились следующие блоки сайта:<br/>
			<b>(a)</b> list_content_sources_groups (позволяет вывести список групп спонсоров видео, настроить их
			фильтрацию и сортировку).<br/>
			<b>(b)</b> content_source_view (позволяет отобразить информацию о спонсоре видео).<br/>
			<b>(c)</b> content_source_group_view (позволяет отобразить информацию о группе спонсоров видео).
		</li>
		<li>
			Добавилась возможность делать выход на спонсоров через директорию (se-friendly).
		</li>
		<li>
			В блоках сайта, которые поддерживают поиск по строке, добавилась возможность выбирать механизм поиска
			(LIKE по всей строке, LIKE по элементам строки или FULL-TEXT индексы).
		</li>
		<li>
			Добавлена возможность показывать список последних записей по всем блогам пользователей на сайте.
		</li>
	</ul>
	<h4>Другие поправки</h4>
	<ul>
		<li>
			Добавилась поддержка пользователей со статусом "webmaster". Вы можете использовать эту
			функциональность, например, для организации загрузки видео только от партнеров. Работа в вебмастерами
			в софте еще только начинается, и мы ожидаем от вас указание направлений, по которым стоит развивать эту
			тему далее.
		</li>
		<li>
			Добавлена возможность удалять тэги вручную на списке тэгов (раньше тэги удалялись автоматически после
			удаления их использования).
		</li>
		<li>
			Добавлен экспорт embed кода на свои видео.
		</li>
		<li>
			Добавлены еще 5 дополнительных полей для спонсоров видео.
		</li>
		<li>
			Добавлены 3 дополнительных файловых поля для рефереров.
		</li>
		<li>
			Сделана возможность указания названий для дополнительных полей в панели администрирования.
		</li>
		<li>
			Добавлено редактирование времени появления видео на сайте (раньше можно было менять только дату, сейчас
			можно и время в пределах даты).
		</li>
		<li>
			Добавились групповые операции для активации / деактивации рекламы.
		</li>
		<li>
			Много различных улучшений было внесено в раздел управления сайтов в панели администрирования для
			удобства работы.
		</li>
	</ul>
	<h2 id="section_whats_new_1_4">KVS v1.4</h2>
	<h3 id="section_whats_new_1_4_2">KVS v1.4.2 [02.09.2009]</h3>
	<ul>
		<li>
			Добавилась возможность указывать количество частей трэйлеров, чтобы они создавались по всему видео
			небольшими частями.
		</li>
		<li>
			Добавились группы контент провайдеров.
		</li>
		<li>
			В шапке панели администрирования появилась информация о серверном времени и загрузке сервера.
		</li>
		<li>
			На странице редактирования видео в панели администрирования теперь можно скачать или просмотреть
			трейлер.
		</li>
		<li>
			Несколько мелких поправок в импорте видео и блоках.
		</li>
	</ul>
	<h3 id="section_whats_new_1_4_1">KVS v1.4.1 [18.07.2009]</h3>
	<ul>
		<li>
			Повышена стабильность обработки видео и создания скриншотов. Теперь KVS позволяет выбрать, какой
			серверный софт должен использоваться для конвертации видео и создания скриншотов (MEncoder и MPlayer
			или FFmpeg).
		</li>
		<li>
			Добавлена возможность для создания ограниченных по времени трейлеров к загруженным видео файлам. В
			настройках вы можете указать длительность трейлера в секундах или в процентах от длительности основного
			видео.
		</li>
	</ul>
	<h3 id="section_whats_new_1_4_0">KVS v1.4.0 [01.07.2009]</h3>
	<ul>
		<li>
			Полностью изменена концепция параметров в блоках. Теперь каждый параметр блока задается через свое
			отдельное поле, которое отличается от параметра к параметру в зависимости от его типа. Таким образом,
			настраивать сайт стало намного проще и понятнее.
		</li>
		<li>
			Добавилась поддержка создания видео на основе галереи (FHG).
		</li>
		<li>
			Добавилась возможность настраивать до 3-х динамических HTTP параметров, которые будут подхватываться
			поверх кэширования. Это очень важная поправка для тех, кто хочет принимать траффик от партнеров и
			учитывать его.
		</li>
		<li>
			Появился новый блок топа рефереров, который позволяет организовать базовый трейд, не подключая при
			этом сторонних скриптов. Блок позволяет не только выводить список рефереров по разным опциям, но и
			выводить список видео со ссылками на трейд, и даже поддерживает возможность скима.
		</li>
		<li>
			Появился новый блок глобальной информации о сайте, который позволяет отобразить суммарную статистику
			данных сайта.
		</li>
		<li>
			Добавился учет статистики выходов на рекламу.
		</li>
		<li>
			Обновился видео плеер. Добавилась отдельная версия плеера для использования его в embed кодах. Теперь
			вы можете позволить пользователям или другим вебмастерам вставлять embed код с вашим видео на других
			сайтах, при этом вместе с видео будет показываться ваша реклама.
		</li>
		<li>
			Появилась подробная документация по блокам и их параметрам.
		</li>
		<li>
			Добавилась функциональность для сохранения настроек массового добавления / экспорта видео. Если вы
			регулярно добавляете видео из одного источника данных и постоянно используете одни и те же настройки -
			эта поправка поможет вам сэкономить время.
		</li>
		<li>
			Несколько дополнений внесено в блок списка сообщений внутренней почты. Во-первых, при подтверждении
			дружеских отношений инициатору теперь отправляется системное сообщение о подтверждении. Во-вторых,
			список непрочитанных сообщений в новой версии отображает сначала обычные сообщения, а только затем
			сообщения о запросе дружеских отношений.
		</li>
		<li>
			В блок логина добавлена возможность включить каптчу при логине, а также сделана защита от перебора
			паролей. Эти поправки имеют большой смысл для платных внутренних зон.
		</li>
		<li>
			Появилась возможность настроить в опциях строку MEncoder-а для создания скриншотов.
		</li>
		<li>
			Обновилась функциональность ручной загрузки скриншотов. Теперь можно загружать скриншоты любых
			размеров, которые будут автоматически смасштабированы до нужных.
		</li>
		<li>
			На странице редактирования видео в панели администрирования теперь можно включить отображение
			скриншотов. Опция включения находится в персональных настройках администратора.
		</li>
		<li>
			Улучшена защита от хотлинка.
		</li>
		<li>
			Добавилась возможность отключить выборку ненужной информации в блоке списка категорий для улучшения
			производительности блока.
		</li>
		<li>
			Добавился блок сайта для отображения любого списка тэгов (в дополнение к уже существующему блоку облака
			тэгов). В новом блоке существует возможность отключить выбоку ненужной информации для улучшения
			производительности блока.
		</li>
		<li>
			Появилась возможность использовать mod_rewrite директорию для контент-провайдеров (спонсоров). В блоке
			списка видео соответственно появилась возможность выводить список видео по директории
			контент-провайдера (раньше можно было только по ID контент-провайдера).
		</li>
		<li>
			В блоке списка видео добавилась возможность использования полных данных категории, тэга и
			контент-провайдера в списках видео по данным объектам (например, можно показать полную информацию о
			контент-провайдере, а рядом с этой информацией список видео данного контент-провайдера).
		</li>
		<li>
			Сделан запрет на кэширование результатов поиска на сайте в блоках списка видео, фотоальбомов и
			пользователей. Соответственно, несколько страниц, созданных специально для отображения результат
			поиска, были удалены за ненадобностью.
		</li>
		<li>
			Сделан дополнительний файл конфигурации всплывающей рекламы в плеере, который позволяет указывать
			разную рекламу для разных контент-провайдеров, а также учитывать клики по всплывающей рекламе.
		</li>
	</ul>
	<h2 id="section_whats_new_1_3">KVS v1.3</h2>
	<h3 id="section_whats_new_1_3_0">KVS v1.3.0 [24.04.2009]</h3>
	<ul>
		<li>
			Добавились премиум пользователи и премиум видео. Теперь на основе KVS можно сделать платную зону, и
			например, давать смотреть премиум видео только премиум пользователям - так сделано на демо сайте. Но этим
			не ограничено: можно развязывать премиум пользователей и видео как понадобится.
		</li>
		<li>
			В блоке просмотра видео добавилась возможность настроить ограничения по кол-ву просмотренного видео за
			промежуток времени. Причем можно настроить 3 разных ограничения: отдельно для незалогиненных
			пользователей (например, попросить их залогиниться или зарегистрироваться, чтобы смотреть больше 3
			видео за сутки), отдельно для стандартных пользователей (например, попросить купить премиум доступ) и
			также отдельно для премиум пользователей, если понадобится.
		</li>
		<li>
			Добавилась возможность оставлять комментарии анонимным пользователям (без необходимости регистрации).
			Эта опция может быть включена / выключена в настройках блоков комментариев.
		</li>
		<li>
			Появился учет глобальной статистики просмотров видео и учет входящего траффика без реферера (так
			называемые букмарки).
		</li>
		<li>
			Блок списка видео был улучшен возможностью опционального показа информации о контент-провайдере
			(спонсоре) видео для каждого видео. Также в этом блоке появилась возможность вывести список всех видео
			по контент-провайдеру (спонсору).
		</li>
		<li>
			Добавился новый блок произвольного списка контент-провайдеров (спонсоров).
		</li>
		<li>
			Обновилась концепция рефереров - они стали больше похожи на трейдеров. Можно задавать название,
			описание и ссылку отдачи траффика. В следующей версии добавится блок топа рефереров, который можно
			будет использоваться для организации трейда.
		</li>
		<li>
			Улучшилась концепция верстки демо-сайта. Шаблоны блоков, которые используются в многих местах
			(например, список видео, пагинация) вынесены в отдельные компоненты (инклюды). Нет дублирования
			шаблонов - меньше времени займет подвязка своего дизайна.
		</li>
		<li>
			Добавился новый функционал в фотоальбомы. Рейтинг и комментарии устанавливаются для каждой картинки
			отдельно, как и должно логически быть.
		</li>
		<li>
			Диапазон рейтинга расширился с 5 до 10.
		</li>
		<li>
			Обновилась страница старта в панели администрирования.
		</li>
	</ul>
	<h2 id="section_whats_new_1_0">KVS v1.0</h2>
	<h3 id="section_whats_new_1_0_0">KVS v1.0.0 [01.02.2009]</h3>
	<p>
		Официальный анонс KVS.
	</p>
</div>